/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8)
            .offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)

pub const N_FQ_LAZY_ITCH: u32 = 6;
pub const N_FQ_INV_ITCH: u32 = 1;
pub const N_FQ_POLY_DIVREM_DIVCONQUER_CUTOFF: u32 = 20;
pub const FLINT_NUM_CLOCKS: u32 = 20;
pub const FLINT_CLOCKSPEED: f64 = 3100000000.0;
pub const FLINT_CLOCK_SCALE_FACTOR: f64 = 0.0003225806451612903;
pub const DURATION_THRESHOLD: f64 = 5000.0;
pub const DURATION_TARGET: f64 = 10000.0;
pub const QS_DEBUG: u32 = 0;
pub const BITS_ADJUST: u32 = 25;
pub const BLOCK_SIZE: u32 = 262144;
pub const _RED: &::std::ffi::CStr = c"\u{1b}[0;31m";
pub const _RED_B: &::std::ffi::CStr = c"\u{1b}[1;31m";
pub const _GREEN: &::std::ffi::CStr = c"\u{1b}[0;32m";
pub const _GREEN_B: &::std::ffi::CStr = c"\u{1b}[1;32m";
pub const _YELLOW: &::std::ffi::CStr = c"\u{1b}[0;33m";
pub const _YELLOW_B: &::std::ffi::CStr = c"\u{1b}[1;33m";
pub const _RESET: &::std::ffi::CStr = c"\u{1b}[0m";
pub const FLINT_DEFAULT_THREAD_LIMIT: u32 = 99999;
pub const FLINT_PARALLEL_UNIFORM: u32 = 1;
pub const FLINT_PARALLEL_STRIDED: u32 = 2;
pub const FLINT_PARALLEL_DYNAMIC: u32 = 4;
pub const FLINT_PARALLEL_BSPLIT_LEFT_INPLACE: u32 = 8;
pub const FLINT_PARALLEL_VERBOSE: u32 = 512;
pub type __gnuc_va_list = __builtin_va_list;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type FILE = _IO_FILE;
#[repr(C)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub _short_backupbuf: [::std::os::raw::c_char; 1usize],
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    [
        "Offset of field: _IO_FILE::_flags",
    ][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    [
        "Offset of field: _IO_FILE::_IO_read_ptr",
    ][::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    [
        "Offset of field: _IO_FILE::_IO_read_end",
    ][::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    [
        "Offset of field: _IO_FILE::_IO_read_base",
    ][::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    [
        "Offset of field: _IO_FILE::_IO_write_base",
    ][::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    [
        "Offset of field: _IO_FILE::_IO_write_ptr",
    ][::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    [
        "Offset of field: _IO_FILE::_IO_write_end",
    ][::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    [
        "Offset of field: _IO_FILE::_IO_buf_base",
    ][::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    [
        "Offset of field: _IO_FILE::_IO_buf_end",
    ][::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    [
        "Offset of field: _IO_FILE::_IO_save_base",
    ][::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    [
        "Offset of field: _IO_FILE::_IO_backup_base",
    ][::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    [
        "Offset of field: _IO_FILE::_IO_save_end",
    ][::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    [
        "Offset of field: _IO_FILE::_markers",
    ][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    [
        "Offset of field: _IO_FILE::_chain",
    ][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    [
        "Offset of field: _IO_FILE::_fileno",
    ][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    [
        "Offset of field: _IO_FILE::_short_backupbuf",
    ][::std::mem::offset_of!(_IO_FILE, _short_backupbuf) - 119usize];
    [
        "Offset of field: _IO_FILE::_old_offset",
    ][::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    [
        "Offset of field: _IO_FILE::_cur_column",
    ][::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    [
        "Offset of field: _IO_FILE::_vtable_offset",
    ][::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    [
        "Offset of field: _IO_FILE::_shortbuf",
    ][::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    [
        "Offset of field: _IO_FILE::_lock",
    ][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    [
        "Offset of field: _IO_FILE::_offset",
    ][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    [
        "Offset of field: _IO_FILE::_codecvt",
    ][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    [
        "Offset of field: _IO_FILE::_wide_data",
    ][::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    [
        "Offset of field: _IO_FILE::_freeres_list",
    ][::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    [
        "Offset of field: _IO_FILE::_freeres_buf",
    ][::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    [
        "Offset of field: _IO_FILE::_prevchain",
    ][::std::mem::offset_of!(_IO_FILE, _prevchain) - 184usize];
    [
        "Offset of field: _IO_FILE::_mode",
    ][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    [
        "Offset of field: _IO_FILE::_unused2",
    ][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
impl _IO_FILE {
    #[inline]
    pub fn _flags2(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set__flags2(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _flags2_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 3usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 24u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set__flags2_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 3usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _flags2: ::std::os::raw::c_int,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                24u8,
                {
                    let _flags2: u32 = unsafe { ::std::mem::transmute(_flags2) };
                    _flags2 as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
pub type va_list = __gnuc_va_list;
#[repr(C)]
pub struct __FLINT_FILE {
    _unused: [u8; 0],
}
pub type FLINT_FILE = __FLINT_FILE;
pub type ulong = ::std::os::raw::c_ulong;
pub type slong = ::std::os::raw::c_long;
pub type flint_bitcnt_t = ulong;
pub type nn_ptr = *mut ulong;
pub type nn_srcptr = *const ulong;
pub type flint_cleanup_function_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type thread_pool_handle = ::std::os::raw::c_int;
#[repr(C)]
pub struct flint_rand_struct {
    pub __gmp_state: *mut ::std::os::raw::c_void,
    pub __randval: ulong,
    pub __randval2: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of flint_rand_struct"][::std::mem::size_of::<flint_rand_struct>() - 24usize];
    [
        "Alignment of flint_rand_struct",
    ][::std::mem::align_of::<flint_rand_struct>() - 8usize];
    [
        "Offset of field: flint_rand_struct::__gmp_state",
    ][::std::mem::offset_of!(flint_rand_struct, __gmp_state) - 0usize];
    [
        "Offset of field: flint_rand_struct::__randval",
    ][::std::mem::offset_of!(flint_rand_struct, __randval) - 8usize];
    [
        "Offset of field: flint_rand_struct::__randval2",
    ][::std::mem::offset_of!(flint_rand_struct, __randval2) - 16usize];
};
pub type flint_rand_t = [flint_rand_struct; 1usize];
pub const flint_err_t_FLINT_ERROR: flint_err_t = 0;
pub const flint_err_t_FLINT_OVERFLOW: flint_err_t = 1;
pub const flint_err_t_FLINT_IMPINV: flint_err_t = 2;
pub const flint_err_t_FLINT_DOMERR: flint_err_t = 3;
pub const flint_err_t_FLINT_DIVZERO: flint_err_t = 4;
pub const flint_err_t_FLINT_EXPOF: flint_err_t = 5;
pub const flint_err_t_FLINT_INEXACT: flint_err_t = 6;
pub const flint_err_t_FLINT_TEST_FAIL: flint_err_t = 7;
pub type flint_err_t = ::std::os::raw::c_uint;
#[repr(C)]
pub struct nmod_t {
    pub n: ulong,
    pub ninv: ulong,
    pub norm: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_t"][::std::mem::size_of::<nmod_t>() - 24usize];
    ["Alignment of nmod_t"][::std::mem::align_of::<nmod_t>() - 8usize];
    ["Offset of field: nmod_t::n"][::std::mem::offset_of!(nmod_t, n) - 0usize];
    ["Offset of field: nmod_t::ninv"][::std::mem::offset_of!(nmod_t, ninv) - 8usize];
    ["Offset of field: nmod_t::norm"][::std::mem::offset_of!(nmod_t, norm) - 16usize];
};
pub type fmpz = slong;
pub type fmpz_t = [fmpz; 1usize];
#[repr(C)]
pub struct fmpq {
    pub num: fmpz,
    pub den: fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpq"][::std::mem::size_of::<fmpq>() - 16usize];
    ["Alignment of fmpq"][::std::mem::align_of::<fmpq>() - 8usize];
    ["Offset of field: fmpq::num"][::std::mem::offset_of!(fmpq, num) - 0usize];
    ["Offset of field: fmpq::den"][::std::mem::offset_of!(fmpq, den) - 8usize];
};
pub type fmpq_t = [fmpq; 1usize];
#[repr(C)]
pub struct mantissa_noptr_struct {
    pub d: [ulong; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of mantissa_noptr_struct",
    ][::std::mem::size_of::<mantissa_noptr_struct>() - 16usize];
    [
        "Alignment of mantissa_noptr_struct",
    ][::std::mem::align_of::<mantissa_noptr_struct>() - 8usize];
    [
        "Offset of field: mantissa_noptr_struct::d",
    ][::std::mem::offset_of!(mantissa_noptr_struct, d) - 0usize];
};
#[repr(C)]
pub struct mantissa_ptr_struct {
    pub alloc: slong,
    pub d: nn_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of mantissa_ptr_struct",
    ][::std::mem::size_of::<mantissa_ptr_struct>() - 16usize];
    [
        "Alignment of mantissa_ptr_struct",
    ][::std::mem::align_of::<mantissa_ptr_struct>() - 8usize];
    [
        "Offset of field: mantissa_ptr_struct::alloc",
    ][::std::mem::offset_of!(mantissa_ptr_struct, alloc) - 0usize];
    [
        "Offset of field: mantissa_ptr_struct::d",
    ][::std::mem::offset_of!(mantissa_ptr_struct, d) - 8usize];
};
#[repr(C)]
pub struct mantissa_struct {
    pub noptr: __BindgenUnionField<mantissa_noptr_struct>,
    pub ptr: __BindgenUnionField<mantissa_ptr_struct>,
    pub bindgen_union_field: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mantissa_struct"][::std::mem::size_of::<mantissa_struct>() - 16usize];
    ["Alignment of mantissa_struct"][::std::mem::align_of::<mantissa_struct>() - 8usize];
    [
        "Offset of field: mantissa_struct::noptr",
    ][::std::mem::offset_of!(mantissa_struct, noptr) - 0usize];
    [
        "Offset of field: mantissa_struct::ptr",
    ][::std::mem::offset_of!(mantissa_struct, ptr) - 0usize];
};
#[repr(C)]
pub struct arf_struct {
    pub exp: fmpz,
    pub size: slong,
    pub d: mantissa_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arf_struct"][::std::mem::size_of::<arf_struct>() - 32usize];
    ["Alignment of arf_struct"][::std::mem::align_of::<arf_struct>() - 8usize];
    [
        "Offset of field: arf_struct::exp",
    ][::std::mem::offset_of!(arf_struct, exp) - 0usize];
    [
        "Offset of field: arf_struct::size",
    ][::std::mem::offset_of!(arf_struct, size) - 8usize];
    ["Offset of field: arf_struct::d"][::std::mem::offset_of!(arf_struct, d) - 16usize];
};
pub type arf_t = [arf_struct; 1usize];
pub type arf_ptr = *mut arf_struct;
pub type arf_srcptr = *const arf_struct;
#[repr(C)]
pub struct arf_interval_struct {
    pub a: arf_struct,
    pub b: arf_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of arf_interval_struct",
    ][::std::mem::size_of::<arf_interval_struct>() - 64usize];
    [
        "Alignment of arf_interval_struct",
    ][::std::mem::align_of::<arf_interval_struct>() - 8usize];
    [
        "Offset of field: arf_interval_struct::a",
    ][::std::mem::offset_of!(arf_interval_struct, a) - 0usize];
    [
        "Offset of field: arf_interval_struct::b",
    ][::std::mem::offset_of!(arf_interval_struct, b) - 32usize];
};
pub type arf_interval_t = [arf_interval_struct; 1usize];
pub type arf_interval_ptr = *mut arf_interval_struct;
pub type arf_interval_srcptr = *const arf_interval_struct;
#[repr(C)]
pub struct mag_struct {
    pub exp: fmpz,
    pub man: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mag_struct"][::std::mem::size_of::<mag_struct>() - 16usize];
    ["Alignment of mag_struct"][::std::mem::align_of::<mag_struct>() - 8usize];
    [
        "Offset of field: mag_struct::exp",
    ][::std::mem::offset_of!(mag_struct, exp) - 0usize];
    [
        "Offset of field: mag_struct::man",
    ][::std::mem::offset_of!(mag_struct, man) - 8usize];
};
pub type mag_t = [mag_struct; 1usize];
pub type mag_ptr = *mut mag_struct;
pub type mag_srcptr = *const mag_struct;
#[repr(C)]
pub struct arb_struct {
    pub mid: arf_struct,
    pub rad: mag_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arb_struct"][::std::mem::size_of::<arb_struct>() - 48usize];
    ["Alignment of arb_struct"][::std::mem::align_of::<arb_struct>() - 8usize];
    [
        "Offset of field: arb_struct::mid",
    ][::std::mem::offset_of!(arb_struct, mid) - 0usize];
    [
        "Offset of field: arb_struct::rad",
    ][::std::mem::offset_of!(arb_struct, rad) - 32usize];
};
pub type arb_t = [arb_struct; 1usize];
pub type arb_ptr = *mut arb_struct;
pub type arb_srcptr = *const arb_struct;
#[repr(C)]
pub struct arb_mat_struct {
    pub entries: arb_ptr,
    pub r: slong,
    pub c: slong,
    pub rows: *mut arb_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arb_mat_struct"][::std::mem::size_of::<arb_mat_struct>() - 32usize];
    ["Alignment of arb_mat_struct"][::std::mem::align_of::<arb_mat_struct>() - 8usize];
    [
        "Offset of field: arb_mat_struct::entries",
    ][::std::mem::offset_of!(arb_mat_struct, entries) - 0usize];
    [
        "Offset of field: arb_mat_struct::r",
    ][::std::mem::offset_of!(arb_mat_struct, r) - 8usize];
    [
        "Offset of field: arb_mat_struct::c",
    ][::std::mem::offset_of!(arb_mat_struct, c) - 16usize];
    [
        "Offset of field: arb_mat_struct::rows",
    ][::std::mem::offset_of!(arb_mat_struct, rows) - 24usize];
};
pub type arb_mat_t = [arb_mat_struct; 1usize];
#[repr(C)]
pub struct arb_poly_struct {
    pub coeffs: arb_ptr,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arb_poly_struct"][::std::mem::size_of::<arb_poly_struct>() - 24usize];
    ["Alignment of arb_poly_struct"][::std::mem::align_of::<arb_poly_struct>() - 8usize];
    [
        "Offset of field: arb_poly_struct::coeffs",
    ][::std::mem::offset_of!(arb_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: arb_poly_struct::alloc",
    ][::std::mem::offset_of!(arb_poly_struct, alloc) - 8usize];
    [
        "Offset of field: arb_poly_struct::length",
    ][::std::mem::offset_of!(arb_poly_struct, length) - 16usize];
};
pub type arb_poly_t = [arb_poly_struct; 1usize];
#[repr(C)]
pub struct acb_struct {
    pub real: arb_struct,
    pub imag: arb_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_struct"][::std::mem::size_of::<acb_struct>() - 96usize];
    ["Alignment of acb_struct"][::std::mem::align_of::<acb_struct>() - 8usize];
    [
        "Offset of field: acb_struct::real",
    ][::std::mem::offset_of!(acb_struct, real) - 0usize];
    [
        "Offset of field: acb_struct::imag",
    ][::std::mem::offset_of!(acb_struct, imag) - 48usize];
};
pub type acb_t = [acb_struct; 1usize];
pub type acb_ptr = *mut acb_struct;
pub type acb_srcptr = *const acb_struct;
#[repr(C)]
pub struct acb_mat_struct {
    pub entries: acb_ptr,
    pub r: slong,
    pub c: slong,
    pub rows: *mut acb_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_mat_struct"][::std::mem::size_of::<acb_mat_struct>() - 32usize];
    ["Alignment of acb_mat_struct"][::std::mem::align_of::<acb_mat_struct>() - 8usize];
    [
        "Offset of field: acb_mat_struct::entries",
    ][::std::mem::offset_of!(acb_mat_struct, entries) - 0usize];
    [
        "Offset of field: acb_mat_struct::r",
    ][::std::mem::offset_of!(acb_mat_struct, r) - 8usize];
    [
        "Offset of field: acb_mat_struct::c",
    ][::std::mem::offset_of!(acb_mat_struct, c) - 16usize];
    [
        "Offset of field: acb_mat_struct::rows",
    ][::std::mem::offset_of!(acb_mat_struct, rows) - 24usize];
};
pub type acb_mat_t = [acb_mat_struct; 1usize];
#[repr(C)]
pub struct acb_poly_struct {
    pub coeffs: acb_ptr,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_poly_struct"][::std::mem::size_of::<acb_poly_struct>() - 24usize];
    ["Alignment of acb_poly_struct"][::std::mem::align_of::<acb_poly_struct>() - 8usize];
    [
        "Offset of field: acb_poly_struct::coeffs",
    ][::std::mem::offset_of!(acb_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: acb_poly_struct::alloc",
    ][::std::mem::offset_of!(acb_poly_struct, alloc) - 8usize];
    [
        "Offset of field: acb_poly_struct::length",
    ][::std::mem::offset_of!(acb_poly_struct, length) - 16usize];
};
pub type acb_poly_t = [acb_poly_struct; 1usize];
pub type acb_calc_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        out: acb_ptr,
        inp: *const acb_struct,
        param: *mut ::std::os::raw::c_void,
        order: slong,
        prec: slong,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
pub struct acb_calc_integrate_opt_struct {
    pub deg_limit: slong,
    pub eval_limit: slong,
    pub depth_limit: slong,
    pub use_heap: ::std::os::raw::c_int,
    pub verbose: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_calc_integrate_opt_struct",
    ][::std::mem::size_of::<acb_calc_integrate_opt_struct>() - 32usize];
    [
        "Alignment of acb_calc_integrate_opt_struct",
    ][::std::mem::align_of::<acb_calc_integrate_opt_struct>() - 8usize];
    [
        "Offset of field: acb_calc_integrate_opt_struct::deg_limit",
    ][::std::mem::offset_of!(acb_calc_integrate_opt_struct, deg_limit) - 0usize];
    [
        "Offset of field: acb_calc_integrate_opt_struct::eval_limit",
    ][::std::mem::offset_of!(acb_calc_integrate_opt_struct, eval_limit) - 8usize];
    [
        "Offset of field: acb_calc_integrate_opt_struct::depth_limit",
    ][::std::mem::offset_of!(acb_calc_integrate_opt_struct, depth_limit) - 16usize];
    [
        "Offset of field: acb_calc_integrate_opt_struct::use_heap",
    ][::std::mem::offset_of!(acb_calc_integrate_opt_struct, use_heap) - 24usize];
    [
        "Offset of field: acb_calc_integrate_opt_struct::verbose",
    ][::std::mem::offset_of!(acb_calc_integrate_opt_struct, verbose) - 28usize];
};
pub type acb_calc_integrate_opt_t = [acb_calc_integrate_opt_struct; 1usize];
#[repr(C)]
pub struct n_factor_t {
    pub num: ::std::os::raw::c_int,
    pub exp: [::std::os::raw::c_int; 15usize],
    pub p: [ulong; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_factor_t"][::std::mem::size_of::<n_factor_t>() - 184usize];
    ["Alignment of n_factor_t"][::std::mem::align_of::<n_factor_t>() - 8usize];
    [
        "Offset of field: n_factor_t::num",
    ][::std::mem::offset_of!(n_factor_t, num) - 0usize];
    [
        "Offset of field: n_factor_t::exp",
    ][::std::mem::offset_of!(n_factor_t, exp) - 4usize];
    ["Offset of field: n_factor_t::p"][::std::mem::offset_of!(n_factor_t, p) - 64usize];
};
#[repr(C)]
pub struct n_primes_struct {
    pub small_i: slong,
    pub small_num: slong,
    pub small_primes: *mut ::std::os::raw::c_uint,
    pub sieve_a: ulong,
    pub sieve_b: ulong,
    pub sieve_i: slong,
    pub sieve_num: slong,
    pub sieve: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_primes_struct"][::std::mem::size_of::<n_primes_struct>() - 64usize];
    ["Alignment of n_primes_struct"][::std::mem::align_of::<n_primes_struct>() - 8usize];
    [
        "Offset of field: n_primes_struct::small_i",
    ][::std::mem::offset_of!(n_primes_struct, small_i) - 0usize];
    [
        "Offset of field: n_primes_struct::small_num",
    ][::std::mem::offset_of!(n_primes_struct, small_num) - 8usize];
    [
        "Offset of field: n_primes_struct::small_primes",
    ][::std::mem::offset_of!(n_primes_struct, small_primes) - 16usize];
    [
        "Offset of field: n_primes_struct::sieve_a",
    ][::std::mem::offset_of!(n_primes_struct, sieve_a) - 24usize];
    [
        "Offset of field: n_primes_struct::sieve_b",
    ][::std::mem::offset_of!(n_primes_struct, sieve_b) - 32usize];
    [
        "Offset of field: n_primes_struct::sieve_i",
    ][::std::mem::offset_of!(n_primes_struct, sieve_i) - 40usize];
    [
        "Offset of field: n_primes_struct::sieve_num",
    ][::std::mem::offset_of!(n_primes_struct, sieve_num) - 48usize];
    [
        "Offset of field: n_primes_struct::sieve",
    ][::std::mem::offset_of!(n_primes_struct, sieve) - 56usize];
};
pub type n_primes_t = [n_primes_struct; 1usize];
pub type mp_limb_t = ::std::os::raw::c_ulong;
pub type mp_limb_signed_t = ::std::os::raw::c_long;
#[repr(C)]
pub struct __mpz_struct {
    pub _mp_alloc: ::std::os::raw::c_int,
    pub _mp_size: ::std::os::raw::c_int,
    pub _mp_d: *mut mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mpz_struct"][::std::mem::size_of::<__mpz_struct>() - 16usize];
    ["Alignment of __mpz_struct"][::std::mem::align_of::<__mpz_struct>() - 8usize];
    [
        "Offset of field: __mpz_struct::_mp_alloc",
    ][::std::mem::offset_of!(__mpz_struct, _mp_alloc) - 0usize];
    [
        "Offset of field: __mpz_struct::_mp_size",
    ][::std::mem::offset_of!(__mpz_struct, _mp_size) - 4usize];
    [
        "Offset of field: __mpz_struct::_mp_d",
    ][::std::mem::offset_of!(__mpz_struct, _mp_d) - 8usize];
};
pub type mpz_t = [__mpz_struct; 1usize];
pub type mp_ptr = *mut mp_limb_t;
pub type mp_srcptr = *const mp_limb_t;
pub type mp_size_t = ::std::os::raw::c_long;
pub type mp_exp_t = ::std::os::raw::c_long;
#[repr(C)]
pub struct __mpq_struct {
    pub _mp_num: __mpz_struct,
    pub _mp_den: __mpz_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mpq_struct"][::std::mem::size_of::<__mpq_struct>() - 32usize];
    ["Alignment of __mpq_struct"][::std::mem::align_of::<__mpq_struct>() - 8usize];
    [
        "Offset of field: __mpq_struct::_mp_num",
    ][::std::mem::offset_of!(__mpq_struct, _mp_num) - 0usize];
    [
        "Offset of field: __mpq_struct::_mp_den",
    ][::std::mem::offset_of!(__mpq_struct, _mp_den) - 16usize];
};
pub type mpq_t = [__mpq_struct; 1usize];
#[repr(C)]
pub struct __mpf_struct {
    pub _mp_prec: ::std::os::raw::c_int,
    pub _mp_size: ::std::os::raw::c_int,
    pub _mp_exp: mp_exp_t,
    pub _mp_d: *mut mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mpf_struct"][::std::mem::size_of::<__mpf_struct>() - 24usize];
    ["Alignment of __mpf_struct"][::std::mem::align_of::<__mpf_struct>() - 8usize];
    [
        "Offset of field: __mpf_struct::_mp_prec",
    ][::std::mem::offset_of!(__mpf_struct, _mp_prec) - 0usize];
    [
        "Offset of field: __mpf_struct::_mp_size",
    ][::std::mem::offset_of!(__mpf_struct, _mp_size) - 4usize];
    [
        "Offset of field: __mpf_struct::_mp_exp",
    ][::std::mem::offset_of!(__mpf_struct, _mp_exp) - 8usize];
    [
        "Offset of field: __mpf_struct::_mp_d",
    ][::std::mem::offset_of!(__mpf_struct, _mp_d) - 16usize];
};
pub type mpf_t = [__mpf_struct; 1usize];
pub type mpz_ptr = *mut __mpz_struct;
#[repr(C)]
pub struct zz_struct {
    pub alloc: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub ptr: nn_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zz_struct"][::std::mem::size_of::<zz_struct>() - 16usize];
    ["Alignment of zz_struct"][::std::mem::align_of::<zz_struct>() - 8usize];
    [
        "Offset of field: zz_struct::alloc",
    ][::std::mem::offset_of!(zz_struct, alloc) - 0usize];
    [
        "Offset of field: zz_struct::size",
    ][::std::mem::offset_of!(zz_struct, size) - 4usize];
    ["Offset of field: zz_struct::ptr"][::std::mem::offset_of!(zz_struct, ptr) - 8usize];
};
pub type zz_ptr = *mut zz_struct;
pub type zz_srcptr = *const zz_struct;
#[repr(C)]
pub struct fmpz_factor_struct {
    pub sign: ::std::os::raw::c_int,
    pub p: *mut fmpz,
    pub exp: *mut ulong,
    pub alloc: slong,
    pub num: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_factor_struct",
    ][::std::mem::size_of::<fmpz_factor_struct>() - 40usize];
    [
        "Alignment of fmpz_factor_struct",
    ][::std::mem::align_of::<fmpz_factor_struct>() - 8usize];
    [
        "Offset of field: fmpz_factor_struct::sign",
    ][::std::mem::offset_of!(fmpz_factor_struct, sign) - 0usize];
    [
        "Offset of field: fmpz_factor_struct::p",
    ][::std::mem::offset_of!(fmpz_factor_struct, p) - 8usize];
    [
        "Offset of field: fmpz_factor_struct::exp",
    ][::std::mem::offset_of!(fmpz_factor_struct, exp) - 16usize];
    [
        "Offset of field: fmpz_factor_struct::alloc",
    ][::std::mem::offset_of!(fmpz_factor_struct, alloc) - 24usize];
    [
        "Offset of field: fmpz_factor_struct::num",
    ][::std::mem::offset_of!(fmpz_factor_struct, num) - 32usize];
};
pub type fmpz_factor_t = [fmpz_factor_struct; 1usize];
#[repr(C)]
pub struct fmpz_preinvn_struct {
    pub dinv: nn_ptr,
    pub n: slong,
    pub norm: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_preinvn_struct",
    ][::std::mem::size_of::<fmpz_preinvn_struct>() - 24usize];
    [
        "Alignment of fmpz_preinvn_struct",
    ][::std::mem::align_of::<fmpz_preinvn_struct>() - 8usize];
    [
        "Offset of field: fmpz_preinvn_struct::dinv",
    ][::std::mem::offset_of!(fmpz_preinvn_struct, dinv) - 0usize];
    [
        "Offset of field: fmpz_preinvn_struct::n",
    ][::std::mem::offset_of!(fmpz_preinvn_struct, n) - 8usize];
    [
        "Offset of field: fmpz_preinvn_struct::norm",
    ][::std::mem::offset_of!(fmpz_preinvn_struct, norm) - 16usize];
};
pub type fmpz_preinvn_t = [fmpz_preinvn_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_struct {
    pub coeffs: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_poly_struct"][::std::mem::size_of::<fmpz_poly_struct>() - 24usize];
    [
        "Alignment of fmpz_poly_struct",
    ][::std::mem::align_of::<fmpz_poly_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_poly_struct::alloc",
    ][::std::mem::offset_of!(fmpz_poly_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_poly_struct::length",
    ][::std::mem::offset_of!(fmpz_poly_struct, length) - 16usize];
};
pub type fmpz_poly_t = [fmpz_poly_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_factor_struct {
    pub c: fmpz,
    pub p: *mut fmpz_poly_struct,
    pub exp: *mut slong,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_poly_factor_struct",
    ][::std::mem::size_of::<fmpz_poly_factor_struct>() - 40usize];
    [
        "Alignment of fmpz_poly_factor_struct",
    ][::std::mem::align_of::<fmpz_poly_factor_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_factor_struct::c",
    ][::std::mem::offset_of!(fmpz_poly_factor_struct, c) - 0usize];
    [
        "Offset of field: fmpz_poly_factor_struct::p",
    ][::std::mem::offset_of!(fmpz_poly_factor_struct, p) - 8usize];
    [
        "Offset of field: fmpz_poly_factor_struct::exp",
    ][::std::mem::offset_of!(fmpz_poly_factor_struct, exp) - 16usize];
    [
        "Offset of field: fmpz_poly_factor_struct::num",
    ][::std::mem::offset_of!(fmpz_poly_factor_struct, num) - 24usize];
    [
        "Offset of field: fmpz_poly_factor_struct::alloc",
    ][::std::mem::offset_of!(fmpz_poly_factor_struct, alloc) - 32usize];
};
pub type fmpz_poly_factor_t = [fmpz_poly_factor_struct; 1usize];
#[repr(C)]
pub struct fmpz_mat_struct {
    pub entries: *mut fmpz,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mat_struct"][::std::mem::size_of::<fmpz_mat_struct>() - 32usize];
    ["Alignment of fmpz_mat_struct"][::std::mem::align_of::<fmpz_mat_struct>() - 8usize];
    [
        "Offset of field: fmpz_mat_struct::entries",
    ][::std::mem::offset_of!(fmpz_mat_struct, entries) - 0usize];
    [
        "Offset of field: fmpz_mat_struct::r",
    ][::std::mem::offset_of!(fmpz_mat_struct, r) - 8usize];
    [
        "Offset of field: fmpz_mat_struct::c",
    ][::std::mem::offset_of!(fmpz_mat_struct, c) - 16usize];
    [
        "Offset of field: fmpz_mat_struct::rows",
    ][::std::mem::offset_of!(fmpz_mat_struct, rows) - 24usize];
};
pub type fmpz_mat_t = [fmpz_mat_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_mat_struct {
    pub entries: *mut fmpz_poly_struct,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut fmpz_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_poly_mat_struct",
    ][::std::mem::size_of::<fmpz_poly_mat_struct>() - 32usize];
    [
        "Alignment of fmpz_poly_mat_struct",
    ][::std::mem::align_of::<fmpz_poly_mat_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_mat_struct::entries",
    ][::std::mem::offset_of!(fmpz_poly_mat_struct, entries) - 0usize];
    [
        "Offset of field: fmpz_poly_mat_struct::r",
    ][::std::mem::offset_of!(fmpz_poly_mat_struct, r) - 8usize];
    [
        "Offset of field: fmpz_poly_mat_struct::c",
    ][::std::mem::offset_of!(fmpz_poly_mat_struct, c) - 16usize];
    [
        "Offset of field: fmpz_poly_mat_struct::rows",
    ][::std::mem::offset_of!(fmpz_poly_mat_struct, rows) - 24usize];
};
pub type fmpz_poly_mat_t = [fmpz_poly_mat_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_struct {
    pub coeffs: *mut fmpz,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpoly_struct"][::std::mem::size_of::<fmpz_mpoly_struct>() - 40usize];
    [
        "Alignment of fmpz_mpoly_struct",
    ][::std::mem::align_of::<fmpz_mpoly_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mpoly_struct::exps",
    ][::std::mem::offset_of!(fmpz_mpoly_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mpoly_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mpoly_struct, alloc) - 16usize];
    [
        "Offset of field: fmpz_mpoly_struct::length",
    ][::std::mem::offset_of!(fmpz_mpoly_struct, length) - 24usize];
    [
        "Offset of field: fmpz_mpoly_struct::bits",
    ][::std::mem::offset_of!(fmpz_mpoly_struct, bits) - 32usize];
};
pub type fmpz_mpoly_t = [fmpz_mpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_factor_struct {
    pub constant: fmpz_t,
    pub constant_den: fmpz_t,
    pub poly: *mut fmpz_mpoly_struct,
    pub exp: *mut fmpz,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpoly_factor_struct",
    ][::std::mem::size_of::<fmpz_mpoly_factor_struct>() - 48usize];
    [
        "Alignment of fmpz_mpoly_factor_struct",
    ][::std::mem::align_of::<fmpz_mpoly_factor_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_factor_struct::constant",
    ][::std::mem::offset_of!(fmpz_mpoly_factor_struct, constant) - 0usize];
    [
        "Offset of field: fmpz_mpoly_factor_struct::constant_den",
    ][::std::mem::offset_of!(fmpz_mpoly_factor_struct, constant_den) - 8usize];
    [
        "Offset of field: fmpz_mpoly_factor_struct::poly",
    ][::std::mem::offset_of!(fmpz_mpoly_factor_struct, poly) - 16usize];
    [
        "Offset of field: fmpz_mpoly_factor_struct::exp",
    ][::std::mem::offset_of!(fmpz_mpoly_factor_struct, exp) - 24usize];
    [
        "Offset of field: fmpz_mpoly_factor_struct::num",
    ][::std::mem::offset_of!(fmpz_mpoly_factor_struct, num) - 32usize];
    [
        "Offset of field: fmpz_mpoly_factor_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mpoly_factor_struct, alloc) - 40usize];
};
pub type fmpz_mpoly_factor_t = [fmpz_mpoly_factor_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_q_struct {
    pub num: *mut fmpz_poly_struct,
    pub den: *mut fmpz_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_poly_q_struct",
    ][::std::mem::size_of::<fmpz_poly_q_struct>() - 16usize];
    [
        "Alignment of fmpz_poly_q_struct",
    ][::std::mem::align_of::<fmpz_poly_q_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_q_struct::num",
    ][::std::mem::offset_of!(fmpz_poly_q_struct, num) - 0usize];
    [
        "Offset of field: fmpz_poly_q_struct::den",
    ][::std::mem::offset_of!(fmpz_poly_q_struct, den) - 8usize];
};
pub type fmpz_poly_q_t = [fmpz_poly_q_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_q_struct {
    pub num: fmpz_mpoly_struct,
    pub den: fmpz_mpoly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpoly_q_struct",
    ][::std::mem::size_of::<fmpz_mpoly_q_struct>() - 80usize];
    [
        "Alignment of fmpz_mpoly_q_struct",
    ][::std::mem::align_of::<fmpz_mpoly_q_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_q_struct::num",
    ][::std::mem::offset_of!(fmpz_mpoly_q_struct, num) - 0usize];
    [
        "Offset of field: fmpz_mpoly_q_struct::den",
    ][::std::mem::offset_of!(fmpz_mpoly_q_struct, den) - 40usize];
};
pub type fmpz_mpoly_q_t = [fmpz_mpoly_q_struct; 1usize];
#[repr(C)]
pub struct fmpzi_struct {
    pub a: fmpz,
    pub b: fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpzi_struct"][::std::mem::size_of::<fmpzi_struct>() - 16usize];
    ["Alignment of fmpzi_struct"][::std::mem::align_of::<fmpzi_struct>() - 8usize];
    [
        "Offset of field: fmpzi_struct::a",
    ][::std::mem::offset_of!(fmpzi_struct, a) - 0usize];
    [
        "Offset of field: fmpzi_struct::b",
    ][::std::mem::offset_of!(fmpzi_struct, b) - 8usize];
};
pub type fmpzi_t = [fmpzi_struct; 1usize];
#[repr(C)]
pub struct _fmpz_multi_CRT_instr {
    pub a_idx: slong,
    pub b_idx: slong,
    pub c_idx: slong,
    pub b_modulus: fmpz_t,
    pub c_modulus: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of _fmpz_multi_CRT_instr",
    ][::std::mem::size_of::<_fmpz_multi_CRT_instr>() - 40usize];
    [
        "Alignment of _fmpz_multi_CRT_instr",
    ][::std::mem::align_of::<_fmpz_multi_CRT_instr>() - 8usize];
    [
        "Offset of field: _fmpz_multi_CRT_instr::a_idx",
    ][::std::mem::offset_of!(_fmpz_multi_CRT_instr, a_idx) - 0usize];
    [
        "Offset of field: _fmpz_multi_CRT_instr::b_idx",
    ][::std::mem::offset_of!(_fmpz_multi_CRT_instr, b_idx) - 8usize];
    [
        "Offset of field: _fmpz_multi_CRT_instr::c_idx",
    ][::std::mem::offset_of!(_fmpz_multi_CRT_instr, c_idx) - 16usize];
    [
        "Offset of field: _fmpz_multi_CRT_instr::b_modulus",
    ][::std::mem::offset_of!(_fmpz_multi_CRT_instr, b_modulus) - 24usize];
    [
        "Offset of field: _fmpz_multi_CRT_instr::c_modulus",
    ][::std::mem::offset_of!(_fmpz_multi_CRT_instr, c_modulus) - 32usize];
};
#[repr(C)]
pub struct fmpz_multi_CRT_struct {
    pub prog: *mut _fmpz_multi_CRT_instr,
    pub moduli: *mut fmpz,
    pub fracmoduli: *mut fmpz,
    pub final_modulus: fmpz_t,
    pub moduli_count: slong,
    pub min_modulus_bits: flint_bitcnt_t,
    pub length: slong,
    pub alloc: slong,
    pub localsize: slong,
    pub temp1loc: slong,
    pub temp2loc: slong,
    pub temp3loc: slong,
    pub temp4loc: slong,
    pub good: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_multi_CRT_struct",
    ][::std::mem::size_of::<fmpz_multi_CRT_struct>() - 112usize];
    [
        "Alignment of fmpz_multi_CRT_struct",
    ][::std::mem::align_of::<fmpz_multi_CRT_struct>() - 8usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::prog",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, prog) - 0usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::moduli",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, moduli) - 8usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::fracmoduli",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, fracmoduli) - 16usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::final_modulus",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, final_modulus) - 24usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::moduli_count",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, moduli_count) - 32usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::min_modulus_bits",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, min_modulus_bits) - 40usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::length",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, length) - 48usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::alloc",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, alloc) - 56usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::localsize",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, localsize) - 64usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::temp1loc",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, temp1loc) - 72usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::temp2loc",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, temp2loc) - 80usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::temp3loc",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, temp3loc) - 88usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::temp4loc",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, temp4loc) - 96usize];
    [
        "Offset of field: fmpz_multi_CRT_struct::good",
    ][::std::mem::offset_of!(fmpz_multi_CRT_struct, good) - 104usize];
};
pub type fmpz_multi_CRT_t = [fmpz_multi_CRT_struct; 1usize];
#[repr(C)]
pub struct _fmpz_multi_mod_instr {
    pub in_idx: slong,
    pub out_idx: slong,
    pub modulus: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of _fmpz_multi_mod_instr",
    ][::std::mem::size_of::<_fmpz_multi_mod_instr>() - 24usize];
    [
        "Alignment of _fmpz_multi_mod_instr",
    ][::std::mem::align_of::<_fmpz_multi_mod_instr>() - 8usize];
    [
        "Offset of field: _fmpz_multi_mod_instr::in_idx",
    ][::std::mem::offset_of!(_fmpz_multi_mod_instr, in_idx) - 0usize];
    [
        "Offset of field: _fmpz_multi_mod_instr::out_idx",
    ][::std::mem::offset_of!(_fmpz_multi_mod_instr, out_idx) - 8usize];
    [
        "Offset of field: _fmpz_multi_mod_instr::modulus",
    ][::std::mem::offset_of!(_fmpz_multi_mod_instr, modulus) - 16usize];
};
#[repr(C)]
pub struct fmpz_multi_mod_struct {
    pub prog: *mut _fmpz_multi_mod_instr,
    pub moduli: *mut fmpz,
    pub moduli_count: slong,
    pub min_modulus_bits: flint_bitcnt_t,
    pub length: slong,
    pub alloc: slong,
    pub localsize: slong,
    pub temp1loc: slong,
    pub good: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_multi_mod_struct",
    ][::std::mem::size_of::<fmpz_multi_mod_struct>() - 72usize];
    [
        "Alignment of fmpz_multi_mod_struct",
    ][::std::mem::align_of::<fmpz_multi_mod_struct>() - 8usize];
    [
        "Offset of field: fmpz_multi_mod_struct::prog",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, prog) - 0usize];
    [
        "Offset of field: fmpz_multi_mod_struct::moduli",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, moduli) - 8usize];
    [
        "Offset of field: fmpz_multi_mod_struct::moduli_count",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, moduli_count) - 16usize];
    [
        "Offset of field: fmpz_multi_mod_struct::min_modulus_bits",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, min_modulus_bits) - 24usize];
    [
        "Offset of field: fmpz_multi_mod_struct::length",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, length) - 32usize];
    [
        "Offset of field: fmpz_multi_mod_struct::alloc",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, alloc) - 40usize];
    [
        "Offset of field: fmpz_multi_mod_struct::localsize",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, localsize) - 48usize];
    [
        "Offset of field: fmpz_multi_mod_struct::temp1loc",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, temp1loc) - 56usize];
    [
        "Offset of field: fmpz_multi_mod_struct::good",
    ][::std::mem::offset_of!(fmpz_multi_mod_struct, good) - 64usize];
};
pub type fmpz_multi_mod_t = [fmpz_multi_mod_struct; 1usize];
#[repr(C)]
pub struct crt_lut_entry {
    pub mod_: nmod_t,
    pub i0: ulong,
    pub i1: ulong,
    pub i2: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crt_lut_entry"][::std::mem::size_of::<crt_lut_entry>() - 48usize];
    ["Alignment of crt_lut_entry"][::std::mem::align_of::<crt_lut_entry>() - 8usize];
    [
        "Offset of field: crt_lut_entry::mod_",
    ][::std::mem::offset_of!(crt_lut_entry, mod_) - 0usize];
    [
        "Offset of field: crt_lut_entry::i0",
    ][::std::mem::offset_of!(crt_lut_entry, i0) - 24usize];
    [
        "Offset of field: crt_lut_entry::i1",
    ][::std::mem::offset_of!(crt_lut_entry, i1) - 32usize];
    [
        "Offset of field: crt_lut_entry::i2",
    ][::std::mem::offset_of!(crt_lut_entry, i2) - 40usize];
};
#[repr(C)]
pub struct mod_lut_entry {
    pub mod_: nmod_t,
    pub mod0: nmod_t,
    pub mod1: nmod_t,
    pub mod2: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mod_lut_entry"][::std::mem::size_of::<mod_lut_entry>() - 96usize];
    ["Alignment of mod_lut_entry"][::std::mem::align_of::<mod_lut_entry>() - 8usize];
    [
        "Offset of field: mod_lut_entry::mod_",
    ][::std::mem::offset_of!(mod_lut_entry, mod_) - 0usize];
    [
        "Offset of field: mod_lut_entry::mod0",
    ][::std::mem::offset_of!(mod_lut_entry, mod0) - 24usize];
    [
        "Offset of field: mod_lut_entry::mod1",
    ][::std::mem::offset_of!(mod_lut_entry, mod1) - 48usize];
    [
        "Offset of field: mod_lut_entry::mod2",
    ][::std::mem::offset_of!(mod_lut_entry, mod2) - 72usize];
};
#[repr(C)]
pub struct fmpz_comb_struct {
    pub crt_P: fmpz_multi_CRT_t,
    pub mod_P: fmpz_multi_mod_t,
    pub packed_multipliers: *mut ulong,
    pub step: *mut slong,
    pub crt_offsets: *mut slong,
    pub crt_offsets_alloc: slong,
    pub mod_offsets: *mut slong,
    pub mod_offsets_alloc: slong,
    pub crt_lu: *mut crt_lut_entry,
    pub crt_lu_alloc: slong,
    pub crt_klen: slong,
    pub mod_lu: *mut mod_lut_entry,
    pub mod_lu_alloc: slong,
    pub mod_klen: slong,
    pub num_primes: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_comb_struct"][::std::mem::size_of::<fmpz_comb_struct>() - 288usize];
    [
        "Alignment of fmpz_comb_struct",
    ][::std::mem::align_of::<fmpz_comb_struct>() - 8usize];
    [
        "Offset of field: fmpz_comb_struct::crt_P",
    ][::std::mem::offset_of!(fmpz_comb_struct, crt_P) - 0usize];
    [
        "Offset of field: fmpz_comb_struct::mod_P",
    ][::std::mem::offset_of!(fmpz_comb_struct, mod_P) - 112usize];
    [
        "Offset of field: fmpz_comb_struct::packed_multipliers",
    ][::std::mem::offset_of!(fmpz_comb_struct, packed_multipliers) - 184usize];
    [
        "Offset of field: fmpz_comb_struct::step",
    ][::std::mem::offset_of!(fmpz_comb_struct, step) - 192usize];
    [
        "Offset of field: fmpz_comb_struct::crt_offsets",
    ][::std::mem::offset_of!(fmpz_comb_struct, crt_offsets) - 200usize];
    [
        "Offset of field: fmpz_comb_struct::crt_offsets_alloc",
    ][::std::mem::offset_of!(fmpz_comb_struct, crt_offsets_alloc) - 208usize];
    [
        "Offset of field: fmpz_comb_struct::mod_offsets",
    ][::std::mem::offset_of!(fmpz_comb_struct, mod_offsets) - 216usize];
    [
        "Offset of field: fmpz_comb_struct::mod_offsets_alloc",
    ][::std::mem::offset_of!(fmpz_comb_struct, mod_offsets_alloc) - 224usize];
    [
        "Offset of field: fmpz_comb_struct::crt_lu",
    ][::std::mem::offset_of!(fmpz_comb_struct, crt_lu) - 232usize];
    [
        "Offset of field: fmpz_comb_struct::crt_lu_alloc",
    ][::std::mem::offset_of!(fmpz_comb_struct, crt_lu_alloc) - 240usize];
    [
        "Offset of field: fmpz_comb_struct::crt_klen",
    ][::std::mem::offset_of!(fmpz_comb_struct, crt_klen) - 248usize];
    [
        "Offset of field: fmpz_comb_struct::mod_lu",
    ][::std::mem::offset_of!(fmpz_comb_struct, mod_lu) - 256usize];
    [
        "Offset of field: fmpz_comb_struct::mod_lu_alloc",
    ][::std::mem::offset_of!(fmpz_comb_struct, mod_lu_alloc) - 264usize];
    [
        "Offset of field: fmpz_comb_struct::mod_klen",
    ][::std::mem::offset_of!(fmpz_comb_struct, mod_klen) - 272usize];
    [
        "Offset of field: fmpz_comb_struct::num_primes",
    ][::std::mem::offset_of!(fmpz_comb_struct, num_primes) - 280usize];
};
pub type fmpz_comb_t = [fmpz_comb_struct; 1usize];
#[repr(C)]
pub struct fmpz_comb_temp_struct {
    pub Alen: slong,
    pub Tlen: slong,
    pub A: *mut fmpz,
    pub T: *mut fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_comb_temp_struct",
    ][::std::mem::size_of::<fmpz_comb_temp_struct>() - 32usize];
    [
        "Alignment of fmpz_comb_temp_struct",
    ][::std::mem::align_of::<fmpz_comb_temp_struct>() - 8usize];
    [
        "Offset of field: fmpz_comb_temp_struct::Alen",
    ][::std::mem::offset_of!(fmpz_comb_temp_struct, Alen) - 0usize];
    [
        "Offset of field: fmpz_comb_temp_struct::Tlen",
    ][::std::mem::offset_of!(fmpz_comb_temp_struct, Tlen) - 8usize];
    [
        "Offset of field: fmpz_comb_temp_struct::A",
    ][::std::mem::offset_of!(fmpz_comb_temp_struct, A) - 16usize];
    [
        "Offset of field: fmpz_comb_temp_struct::T",
    ][::std::mem::offset_of!(fmpz_comb_temp_struct, T) - 24usize];
};
pub type fmpz_comb_temp_t = [fmpz_comb_temp_struct; 1usize];
pub const arf_rnd_t_ARF_RND_DOWN: arf_rnd_t = 0;
pub const arf_rnd_t_ARF_RND_UP: arf_rnd_t = 1;
pub const arf_rnd_t_ARF_RND_FLOOR: arf_rnd_t = 2;
pub const arf_rnd_t_ARF_RND_CEIL: arf_rnd_t = 3;
pub const arf_rnd_t_ARF_RND_NEAR: arf_rnd_t = 4;
pub type arf_rnd_t = ::std::os::raw::c_uint;
#[repr(C)]
pub struct crt_struct {
    pub num: ::std::os::raw::c_int,
    pub n: nmod_t,
    pub m: [slong; 15usize],
    pub M: [ulong; 15usize],
    pub vM: [ulong; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crt_struct"][::std::mem::size_of::<crt_struct>() - 392usize];
    ["Alignment of crt_struct"][::std::mem::align_of::<crt_struct>() - 8usize];
    [
        "Offset of field: crt_struct::num",
    ][::std::mem::offset_of!(crt_struct, num) - 0usize];
    ["Offset of field: crt_struct::n"][::std::mem::offset_of!(crt_struct, n) - 8usize];
    ["Offset of field: crt_struct::m"][::std::mem::offset_of!(crt_struct, m) - 32usize];
    ["Offset of field: crt_struct::M"][::std::mem::offset_of!(crt_struct, M) - 152usize];
    [
        "Offset of field: crt_struct::vM",
    ][::std::mem::offset_of!(crt_struct, vM) - 272usize];
};
pub type crt_t = [crt_struct; 1usize];
pub type acb_dft_step_ptr = *mut acb_dft_step_struct;
#[repr(C)]
pub struct acb_dft_cyc_struct {
    pub n: slong,
    pub z: acb_ptr,
    pub zclear: ::std::os::raw::c_int,
    pub num: slong,
    pub cyc: acb_dft_step_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_cyc_struct",
    ][::std::mem::size_of::<acb_dft_cyc_struct>() - 40usize];
    [
        "Alignment of acb_dft_cyc_struct",
    ][::std::mem::align_of::<acb_dft_cyc_struct>() - 8usize];
    [
        "Offset of field: acb_dft_cyc_struct::n",
    ][::std::mem::offset_of!(acb_dft_cyc_struct, n) - 0usize];
    [
        "Offset of field: acb_dft_cyc_struct::z",
    ][::std::mem::offset_of!(acb_dft_cyc_struct, z) - 8usize];
    [
        "Offset of field: acb_dft_cyc_struct::zclear",
    ][::std::mem::offset_of!(acb_dft_cyc_struct, zclear) - 16usize];
    [
        "Offset of field: acb_dft_cyc_struct::num",
    ][::std::mem::offset_of!(acb_dft_cyc_struct, num) - 24usize];
    [
        "Offset of field: acb_dft_cyc_struct::cyc",
    ][::std::mem::offset_of!(acb_dft_cyc_struct, cyc) - 32usize];
};
pub type acb_dft_cyc_t = [acb_dft_cyc_struct; 1usize];
#[repr(C)]
pub struct acb_dft_rad2_struct {
    pub e: ::std::os::raw::c_int,
    pub n: slong,
    pub dv: slong,
    pub nz: slong,
    pub z: acb_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_rad2_struct",
    ][::std::mem::size_of::<acb_dft_rad2_struct>() - 40usize];
    [
        "Alignment of acb_dft_rad2_struct",
    ][::std::mem::align_of::<acb_dft_rad2_struct>() - 8usize];
    [
        "Offset of field: acb_dft_rad2_struct::e",
    ][::std::mem::offset_of!(acb_dft_rad2_struct, e) - 0usize];
    [
        "Offset of field: acb_dft_rad2_struct::n",
    ][::std::mem::offset_of!(acb_dft_rad2_struct, n) - 8usize];
    [
        "Offset of field: acb_dft_rad2_struct::dv",
    ][::std::mem::offset_of!(acb_dft_rad2_struct, dv) - 16usize];
    [
        "Offset of field: acb_dft_rad2_struct::nz",
    ][::std::mem::offset_of!(acb_dft_rad2_struct, nz) - 24usize];
    [
        "Offset of field: acb_dft_rad2_struct::z",
    ][::std::mem::offset_of!(acb_dft_rad2_struct, z) - 32usize];
};
pub type acb_dft_rad2_t = [acb_dft_rad2_struct; 1usize];
#[repr(C)]
pub struct acb_dft_bluestein_struct {
    pub n: slong,
    pub dv: slong,
    pub z: acb_ptr,
    pub g: acb_ptr,
    pub rad2: acb_dft_rad2_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_bluestein_struct",
    ][::std::mem::size_of::<acb_dft_bluestein_struct>() - 72usize];
    [
        "Alignment of acb_dft_bluestein_struct",
    ][::std::mem::align_of::<acb_dft_bluestein_struct>() - 8usize];
    [
        "Offset of field: acb_dft_bluestein_struct::n",
    ][::std::mem::offset_of!(acb_dft_bluestein_struct, n) - 0usize];
    [
        "Offset of field: acb_dft_bluestein_struct::dv",
    ][::std::mem::offset_of!(acb_dft_bluestein_struct, dv) - 8usize];
    [
        "Offset of field: acb_dft_bluestein_struct::z",
    ][::std::mem::offset_of!(acb_dft_bluestein_struct, z) - 16usize];
    [
        "Offset of field: acb_dft_bluestein_struct::g",
    ][::std::mem::offset_of!(acb_dft_bluestein_struct, g) - 24usize];
    [
        "Offset of field: acb_dft_bluestein_struct::rad2",
    ][::std::mem::offset_of!(acb_dft_bluestein_struct, rad2) - 32usize];
};
pub type acb_dft_bluestein_t = [acb_dft_bluestein_struct; 1usize];
#[repr(C)]
pub struct acb_dft_prod_struct {
    pub n: slong,
    pub num: slong,
    pub cyc: acb_dft_step_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_prod_struct",
    ][::std::mem::size_of::<acb_dft_prod_struct>() - 24usize];
    [
        "Alignment of acb_dft_prod_struct",
    ][::std::mem::align_of::<acb_dft_prod_struct>() - 8usize];
    [
        "Offset of field: acb_dft_prod_struct::n",
    ][::std::mem::offset_of!(acb_dft_prod_struct, n) - 0usize];
    [
        "Offset of field: acb_dft_prod_struct::num",
    ][::std::mem::offset_of!(acb_dft_prod_struct, num) - 8usize];
    [
        "Offset of field: acb_dft_prod_struct::cyc",
    ][::std::mem::offset_of!(acb_dft_prod_struct, cyc) - 16usize];
};
pub type acb_dft_prod_t = [acb_dft_prod_struct; 1usize];
#[repr(C)]
pub struct acb_dft_crt_struct {
    pub n: slong,
    pub c: crt_t,
    pub dv: slong,
    pub cyc: acb_dft_step_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_crt_struct",
    ][::std::mem::size_of::<acb_dft_crt_struct>() - 416usize];
    [
        "Alignment of acb_dft_crt_struct",
    ][::std::mem::align_of::<acb_dft_crt_struct>() - 8usize];
    [
        "Offset of field: acb_dft_crt_struct::n",
    ][::std::mem::offset_of!(acb_dft_crt_struct, n) - 0usize];
    [
        "Offset of field: acb_dft_crt_struct::c",
    ][::std::mem::offset_of!(acb_dft_crt_struct, c) - 8usize];
    [
        "Offset of field: acb_dft_crt_struct::dv",
    ][::std::mem::offset_of!(acb_dft_crt_struct, dv) - 400usize];
    [
        "Offset of field: acb_dft_crt_struct::cyc",
    ][::std::mem::offset_of!(acb_dft_crt_struct, cyc) - 408usize];
};
pub type acb_dft_crt_t = [acb_dft_crt_struct; 1usize];
#[repr(C)]
pub struct acb_dft_naive_struct {
    pub n: slong,
    pub dv: slong,
    pub zclear: ::std::os::raw::c_int,
    pub z: acb_ptr,
    pub dz: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_naive_struct",
    ][::std::mem::size_of::<acb_dft_naive_struct>() - 40usize];
    [
        "Alignment of acb_dft_naive_struct",
    ][::std::mem::align_of::<acb_dft_naive_struct>() - 8usize];
    [
        "Offset of field: acb_dft_naive_struct::n",
    ][::std::mem::offset_of!(acb_dft_naive_struct, n) - 0usize];
    [
        "Offset of field: acb_dft_naive_struct::dv",
    ][::std::mem::offset_of!(acb_dft_naive_struct, dv) - 8usize];
    [
        "Offset of field: acb_dft_naive_struct::zclear",
    ][::std::mem::offset_of!(acb_dft_naive_struct, zclear) - 16usize];
    [
        "Offset of field: acb_dft_naive_struct::z",
    ][::std::mem::offset_of!(acb_dft_naive_struct, z) - 24usize];
    [
        "Offset of field: acb_dft_naive_struct::dz",
    ][::std::mem::offset_of!(acb_dft_naive_struct, dz) - 32usize];
};
pub type acb_dft_naive_t = [acb_dft_naive_struct; 1usize];
#[repr(C)]
pub struct acb_dft_pre_struct {
    pub n: slong,
    pub type_: ::std::os::raw::c_int,
    pub t: acb_dft_pre_struct__bindgen_ty_1,
}
#[repr(C)]
pub struct acb_dft_pre_struct__bindgen_ty_1 {
    pub rad2: __BindgenUnionField<acb_dft_rad2_t>,
    pub cyc: __BindgenUnionField<acb_dft_cyc_t>,
    pub prod: __BindgenUnionField<acb_dft_prod_t>,
    pub crt: __BindgenUnionField<acb_dft_crt_t>,
    pub naive: __BindgenUnionField<acb_dft_naive_t>,
    pub bluestein: __BindgenUnionField<acb_dft_bluestein_t>,
    pub bindgen_union_field: [u64; 52usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_pre_struct__bindgen_ty_1",
    ][::std::mem::size_of::<acb_dft_pre_struct__bindgen_ty_1>() - 416usize];
    [
        "Alignment of acb_dft_pre_struct__bindgen_ty_1",
    ][::std::mem::align_of::<acb_dft_pre_struct__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: acb_dft_pre_struct__bindgen_ty_1::rad2",
    ][::std::mem::offset_of!(acb_dft_pre_struct__bindgen_ty_1, rad2) - 0usize];
    [
        "Offset of field: acb_dft_pre_struct__bindgen_ty_1::cyc",
    ][::std::mem::offset_of!(acb_dft_pre_struct__bindgen_ty_1, cyc) - 0usize];
    [
        "Offset of field: acb_dft_pre_struct__bindgen_ty_1::prod",
    ][::std::mem::offset_of!(acb_dft_pre_struct__bindgen_ty_1, prod) - 0usize];
    [
        "Offset of field: acb_dft_pre_struct__bindgen_ty_1::crt",
    ][::std::mem::offset_of!(acb_dft_pre_struct__bindgen_ty_1, crt) - 0usize];
    [
        "Offset of field: acb_dft_pre_struct__bindgen_ty_1::naive",
    ][::std::mem::offset_of!(acb_dft_pre_struct__bindgen_ty_1, naive) - 0usize];
    [
        "Offset of field: acb_dft_pre_struct__bindgen_ty_1::bluestein",
    ][::std::mem::offset_of!(acb_dft_pre_struct__bindgen_ty_1, bluestein) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_pre_struct",
    ][::std::mem::size_of::<acb_dft_pre_struct>() - 432usize];
    [
        "Alignment of acb_dft_pre_struct",
    ][::std::mem::align_of::<acb_dft_pre_struct>() - 8usize];
    [
        "Offset of field: acb_dft_pre_struct::n",
    ][::std::mem::offset_of!(acb_dft_pre_struct, n) - 0usize];
    [
        "Offset of field: acb_dft_pre_struct::type_",
    ][::std::mem::offset_of!(acb_dft_pre_struct, type_) - 8usize];
    [
        "Offset of field: acb_dft_pre_struct::t",
    ][::std::mem::offset_of!(acb_dft_pre_struct, t) - 16usize];
};
pub type acb_dft_pre_t = [acb_dft_pre_struct; 1usize];
#[repr(C)]
pub struct acb_dft_step_struct {
    pub m: slong,
    pub M: slong,
    pub dv: slong,
    pub z: acb_srcptr,
    pub dz: slong,
    pub pre: acb_dft_pre_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dft_step_struct",
    ][::std::mem::size_of::<acb_dft_step_struct>() - 472usize];
    [
        "Alignment of acb_dft_step_struct",
    ][::std::mem::align_of::<acb_dft_step_struct>() - 8usize];
    [
        "Offset of field: acb_dft_step_struct::m",
    ][::std::mem::offset_of!(acb_dft_step_struct, m) - 0usize];
    [
        "Offset of field: acb_dft_step_struct::M",
    ][::std::mem::offset_of!(acb_dft_step_struct, M) - 8usize];
    [
        "Offset of field: acb_dft_step_struct::dv",
    ][::std::mem::offset_of!(acb_dft_step_struct, dv) - 16usize];
    [
        "Offset of field: acb_dft_step_struct::z",
    ][::std::mem::offset_of!(acb_dft_step_struct, z) - 24usize];
    [
        "Offset of field: acb_dft_step_struct::dz",
    ][::std::mem::offset_of!(acb_dft_step_struct, dz) - 32usize];
    [
        "Offset of field: acb_dft_step_struct::pre",
    ][::std::mem::offset_of!(acb_dft_step_struct, pre) - 40usize];
};
pub const DFT_NAIVE: _bindgen_ty_13 = 0;
pub const DFT_CYC: _bindgen_ty_13 = 1;
pub const DFT_PROD: _bindgen_ty_13 = 2;
pub const DFT_CRT: _bindgen_ty_13 = 3;
pub const DFT_RAD2: _bindgen_ty_13 = 4;
pub const DFT_CONV: _bindgen_ty_13 = 5;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[repr(C)]
pub struct n_ecm_s {
    pub x: ulong,
    pub z: ulong,
    pub a24: ulong,
    pub ninv: ulong,
    pub normbits: ulong,
    pub one: ulong,
    pub GCD_table: *mut ::std::os::raw::c_uchar,
    pub prime_table: *mut *mut ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_ecm_s"][::std::mem::size_of::<n_ecm_s>() - 64usize];
    ["Alignment of n_ecm_s"][::std::mem::align_of::<n_ecm_s>() - 8usize];
    ["Offset of field: n_ecm_s::x"][::std::mem::offset_of!(n_ecm_s, x) - 0usize];
    ["Offset of field: n_ecm_s::z"][::std::mem::offset_of!(n_ecm_s, z) - 8usize];
    ["Offset of field: n_ecm_s::a24"][::std::mem::offset_of!(n_ecm_s, a24) - 16usize];
    ["Offset of field: n_ecm_s::ninv"][::std::mem::offset_of!(n_ecm_s, ninv) - 24usize];
    [
        "Offset of field: n_ecm_s::normbits",
    ][::std::mem::offset_of!(n_ecm_s, normbits) - 32usize];
    ["Offset of field: n_ecm_s::one"][::std::mem::offset_of!(n_ecm_s, one) - 40usize];
    [
        "Offset of field: n_ecm_s::GCD_table",
    ][::std::mem::offset_of!(n_ecm_s, GCD_table) - 48usize];
    [
        "Offset of field: n_ecm_s::prime_table",
    ][::std::mem::offset_of!(n_ecm_s, prime_table) - 56usize];
};
pub type n_ecm_t = [n_ecm_s; 1usize];
#[repr(C)]
pub struct nmod_mat_struct {
    pub entries: *mut ulong,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut ulong,
    pub mod_: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mat_struct"][::std::mem::size_of::<nmod_mat_struct>() - 56usize];
    ["Alignment of nmod_mat_struct"][::std::mem::align_of::<nmod_mat_struct>() - 8usize];
    [
        "Offset of field: nmod_mat_struct::entries",
    ][::std::mem::offset_of!(nmod_mat_struct, entries) - 0usize];
    [
        "Offset of field: nmod_mat_struct::r",
    ][::std::mem::offset_of!(nmod_mat_struct, r) - 8usize];
    [
        "Offset of field: nmod_mat_struct::c",
    ][::std::mem::offset_of!(nmod_mat_struct, c) - 16usize];
    [
        "Offset of field: nmod_mat_struct::rows",
    ][::std::mem::offset_of!(nmod_mat_struct, rows) - 24usize];
    [
        "Offset of field: nmod_mat_struct::mod_",
    ][::std::mem::offset_of!(nmod_mat_struct, mod_) - 32usize];
};
pub type nmod_mat_t = [nmod_mat_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_struct {
    pub coeffs: nn_ptr,
    pub alloc: slong,
    pub length: slong,
    pub mod_: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_struct"][::std::mem::size_of::<nmod_poly_struct>() - 48usize];
    [
        "Alignment of nmod_poly_struct",
    ][::std::mem::align_of::<nmod_poly_struct>() - 8usize];
    [
        "Offset of field: nmod_poly_struct::coeffs",
    ][::std::mem::offset_of!(nmod_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: nmod_poly_struct::alloc",
    ][::std::mem::offset_of!(nmod_poly_struct, alloc) - 8usize];
    [
        "Offset of field: nmod_poly_struct::length",
    ][::std::mem::offset_of!(nmod_poly_struct, length) - 16usize];
    [
        "Offset of field: nmod_poly_struct::mod_",
    ][::std::mem::offset_of!(nmod_poly_struct, mod_) - 24usize];
};
pub type nmod_poly_t = [nmod_poly_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_factor_struct {
    pub p: *mut nmod_poly_struct,
    pub exp: *mut slong,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_poly_factor_struct",
    ][::std::mem::size_of::<nmod_poly_factor_struct>() - 32usize];
    [
        "Alignment of nmod_poly_factor_struct",
    ][::std::mem::align_of::<nmod_poly_factor_struct>() - 8usize];
    [
        "Offset of field: nmod_poly_factor_struct::p",
    ][::std::mem::offset_of!(nmod_poly_factor_struct, p) - 0usize];
    [
        "Offset of field: nmod_poly_factor_struct::exp",
    ][::std::mem::offset_of!(nmod_poly_factor_struct, exp) - 8usize];
    [
        "Offset of field: nmod_poly_factor_struct::num",
    ][::std::mem::offset_of!(nmod_poly_factor_struct, num) - 16usize];
    [
        "Offset of field: nmod_poly_factor_struct::alloc",
    ][::std::mem::offset_of!(nmod_poly_factor_struct, alloc) - 24usize];
};
pub type nmod_poly_factor_t = [nmod_poly_factor_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_mat_struct {
    pub entries: *mut nmod_poly_struct,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut nmod_poly_struct,
    pub modulus: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_poly_mat_struct",
    ][::std::mem::size_of::<nmod_poly_mat_struct>() - 40usize];
    [
        "Alignment of nmod_poly_mat_struct",
    ][::std::mem::align_of::<nmod_poly_mat_struct>() - 8usize];
    [
        "Offset of field: nmod_poly_mat_struct::entries",
    ][::std::mem::offset_of!(nmod_poly_mat_struct, entries) - 0usize];
    [
        "Offset of field: nmod_poly_mat_struct::r",
    ][::std::mem::offset_of!(nmod_poly_mat_struct, r) - 8usize];
    [
        "Offset of field: nmod_poly_mat_struct::c",
    ][::std::mem::offset_of!(nmod_poly_mat_struct, c) - 16usize];
    [
        "Offset of field: nmod_poly_mat_struct::rows",
    ][::std::mem::offset_of!(nmod_poly_mat_struct, rows) - 24usize];
    [
        "Offset of field: nmod_poly_mat_struct::modulus",
    ][::std::mem::offset_of!(nmod_poly_mat_struct, modulus) - 32usize];
};
pub type nmod_poly_mat_t = [nmod_poly_mat_struct; 1usize];
#[repr(C)]
pub struct nmod_mpoly_struct {
    pub coeffs: *mut ulong,
    pub exps: *mut ulong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
    pub coeffs_alloc: slong,
    pub exps_alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpoly_struct"][::std::mem::size_of::<nmod_mpoly_struct>() - 48usize];
    [
        "Alignment of nmod_mpoly_struct",
    ][::std::mem::align_of::<nmod_mpoly_struct>() - 8usize];
    [
        "Offset of field: nmod_mpoly_struct::coeffs",
    ][::std::mem::offset_of!(nmod_mpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: nmod_mpoly_struct::exps",
    ][::std::mem::offset_of!(nmod_mpoly_struct, exps) - 8usize];
    [
        "Offset of field: nmod_mpoly_struct::length",
    ][::std::mem::offset_of!(nmod_mpoly_struct, length) - 16usize];
    [
        "Offset of field: nmod_mpoly_struct::bits",
    ][::std::mem::offset_of!(nmod_mpoly_struct, bits) - 24usize];
    [
        "Offset of field: nmod_mpoly_struct::coeffs_alloc",
    ][::std::mem::offset_of!(nmod_mpoly_struct, coeffs_alloc) - 32usize];
    [
        "Offset of field: nmod_mpoly_struct::exps_alloc",
    ][::std::mem::offset_of!(nmod_mpoly_struct, exps_alloc) - 40usize];
};
pub type nmod_mpoly_t = [nmod_mpoly_struct; 1usize];
#[repr(C)]
pub struct nmod_mpoly_factor_struct {
    pub constant: ulong,
    pub poly: *mut nmod_mpoly_struct,
    pub exp: *mut fmpz,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_mpoly_factor_struct",
    ][::std::mem::size_of::<nmod_mpoly_factor_struct>() - 40usize];
    [
        "Alignment of nmod_mpoly_factor_struct",
    ][::std::mem::align_of::<nmod_mpoly_factor_struct>() - 8usize];
    [
        "Offset of field: nmod_mpoly_factor_struct::constant",
    ][::std::mem::offset_of!(nmod_mpoly_factor_struct, constant) - 0usize];
    [
        "Offset of field: nmod_mpoly_factor_struct::poly",
    ][::std::mem::offset_of!(nmod_mpoly_factor_struct, poly) - 8usize];
    [
        "Offset of field: nmod_mpoly_factor_struct::exp",
    ][::std::mem::offset_of!(nmod_mpoly_factor_struct, exp) - 16usize];
    [
        "Offset of field: nmod_mpoly_factor_struct::num",
    ][::std::mem::offset_of!(nmod_mpoly_factor_struct, num) - 24usize];
    [
        "Offset of field: nmod_mpoly_factor_struct::alloc",
    ][::std::mem::offset_of!(nmod_mpoly_factor_struct, alloc) - 32usize];
};
pub type nmod_mpoly_factor_t = [nmod_mpoly_factor_struct; 1usize];
#[repr(C)]
pub struct nmod_discrete_log_pohlig_hellman_table_entry_struct {
    pub gammapow: ulong,
    pub cm: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_discrete_log_pohlig_hellman_table_entry_struct",
    ][::std::mem::size_of::<nmod_discrete_log_pohlig_hellman_table_entry_struct>()
        - 16usize];
    [
        "Alignment of nmod_discrete_log_pohlig_hellman_table_entry_struct",
    ][::std::mem::align_of::<nmod_discrete_log_pohlig_hellman_table_entry_struct>()
        - 8usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_table_entry_struct::gammapow",
    ][::std::mem::offset_of!(
        nmod_discrete_log_pohlig_hellman_table_entry_struct, gammapow
    ) - 0usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_table_entry_struct::cm",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_table_entry_struct, cm)
        - 8usize];
};
#[repr(C)]
pub struct nmod_discrete_log_pohlig_hellman_entry_struct {
    pub exp: slong,
    pub prime: ulong,
    pub gamma: ulong,
    pub gammainv: ulong,
    pub startingbeta: ulong,
    pub co: ulong,
    pub startinge: ulong,
    pub idem: ulong,
    pub cbound: ulong,
    pub dbound: ulong,
    pub table: *mut nmod_discrete_log_pohlig_hellman_table_entry_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_discrete_log_pohlig_hellman_entry_struct",
    ][::std::mem::size_of::<nmod_discrete_log_pohlig_hellman_entry_struct>() - 88usize];
    [
        "Alignment of nmod_discrete_log_pohlig_hellman_entry_struct",
    ][::std::mem::align_of::<nmod_discrete_log_pohlig_hellman_entry_struct>() - 8usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::exp",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, exp)
        - 0usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::prime",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, prime)
        - 8usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::gamma",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, gamma)
        - 16usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::gammainv",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, gammainv)
        - 24usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::startingbeta",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, startingbeta)
        - 32usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::co",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, co)
        - 40usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::startinge",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, startinge)
        - 48usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::idem",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, idem)
        - 56usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::cbound",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, cbound)
        - 64usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::dbound",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, dbound)
        - 72usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::table",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, table)
        - 80usize];
};
#[repr(C)]
pub struct nmod_discrete_log_pohlig_hellman_struct {
    pub mod_: nmod_t,
    pub alpha: ulong,
    pub alphainv: ulong,
    pub num_factors: slong,
    pub entries: *mut nmod_discrete_log_pohlig_hellman_entry_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_discrete_log_pohlig_hellman_struct",
    ][::std::mem::size_of::<nmod_discrete_log_pohlig_hellman_struct>() - 56usize];
    [
        "Alignment of nmod_discrete_log_pohlig_hellman_struct",
    ][::std::mem::align_of::<nmod_discrete_log_pohlig_hellman_struct>() - 8usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_struct::mod_",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, mod_) - 0usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_struct::alpha",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, alpha) - 24usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_struct::alphainv",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, alphainv)
        - 32usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_struct::num_factors",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, num_factors)
        - 40usize];
    [
        "Offset of field: nmod_discrete_log_pohlig_hellman_struct::entries",
    ][::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, entries)
        - 48usize];
};
pub type nmod_discrete_log_pohlig_hellman_t = [nmod_discrete_log_pohlig_hellman_struct; 1usize];
pub const DLOG_MODPE: _bindgen_ty_14 = 0;
pub const DLOG_CRT: _bindgen_ty_14 = 1;
pub const DLOG_POWER: _bindgen_ty_14 = 2;
pub const DLOG_BSGS: _bindgen_ty_14 = 3;
pub const DLOG_TABLE: _bindgen_ty_14 = 4;
pub const DLOG_23: _bindgen_ty_14 = 5;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
pub type dlog_preconn_ptr = *mut dlog_precomp_struct;
#[repr(C)]
pub struct dlog_1modpe_struct {
    pub inv1p: ulong,
    pub invloga1: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of dlog_1modpe_struct",
    ][::std::mem::size_of::<dlog_1modpe_struct>() - 16usize];
    [
        "Alignment of dlog_1modpe_struct",
    ][::std::mem::align_of::<dlog_1modpe_struct>() - 8usize];
    [
        "Offset of field: dlog_1modpe_struct::inv1p",
    ][::std::mem::offset_of!(dlog_1modpe_struct, inv1p) - 0usize];
    [
        "Offset of field: dlog_1modpe_struct::invloga1",
    ][::std::mem::offset_of!(dlog_1modpe_struct, invloga1) - 8usize];
};
pub type dlog_1modpe_t = [dlog_1modpe_struct; 1usize];
#[repr(C)]
pub struct dlog_modpe_struct {
    pub p: ulong,
    pub e: ulong,
    pub pe1: ulong,
    pub inva: ulong,
    pub pe: nmod_t,
    pub modp: *mut dlog_precomp_struct,
    pub modpe: dlog_1modpe_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dlog_modpe_struct"][::std::mem::size_of::<dlog_modpe_struct>() - 80usize];
    [
        "Alignment of dlog_modpe_struct",
    ][::std::mem::align_of::<dlog_modpe_struct>() - 8usize];
    [
        "Offset of field: dlog_modpe_struct::p",
    ][::std::mem::offset_of!(dlog_modpe_struct, p) - 0usize];
    [
        "Offset of field: dlog_modpe_struct::e",
    ][::std::mem::offset_of!(dlog_modpe_struct, e) - 8usize];
    [
        "Offset of field: dlog_modpe_struct::pe1",
    ][::std::mem::offset_of!(dlog_modpe_struct, pe1) - 16usize];
    [
        "Offset of field: dlog_modpe_struct::inva",
    ][::std::mem::offset_of!(dlog_modpe_struct, inva) - 24usize];
    [
        "Offset of field: dlog_modpe_struct::pe",
    ][::std::mem::offset_of!(dlog_modpe_struct, pe) - 32usize];
    [
        "Offset of field: dlog_modpe_struct::modp",
    ][::std::mem::offset_of!(dlog_modpe_struct, modp) - 56usize];
    [
        "Offset of field: dlog_modpe_struct::modpe",
    ][::std::mem::offset_of!(dlog_modpe_struct, modpe) - 64usize];
};
pub type dlog_modpe_t = [dlog_modpe_struct; 1usize];
#[repr(C)]
pub struct dlog_table_struct {
    pub mod_: ulong,
    pub table: *mut ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dlog_table_struct"][::std::mem::size_of::<dlog_table_struct>() - 16usize];
    [
        "Alignment of dlog_table_struct",
    ][::std::mem::align_of::<dlog_table_struct>() - 8usize];
    [
        "Offset of field: dlog_table_struct::mod_",
    ][::std::mem::offset_of!(dlog_table_struct, mod_) - 0usize];
    [
        "Offset of field: dlog_table_struct::table",
    ][::std::mem::offset_of!(dlog_table_struct, table) - 8usize];
};
pub type dlog_table_t = [dlog_table_struct; 1usize];
#[repr(C)]
pub struct apow {
    pub k: ulong,
    pub ak: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of apow"][::std::mem::size_of::<apow>() - 16usize];
    ["Alignment of apow"][::std::mem::align_of::<apow>() - 8usize];
    ["Offset of field: apow::k"][::std::mem::offset_of!(apow, k) - 0usize];
    ["Offset of field: apow::ak"][::std::mem::offset_of!(apow, ak) - 8usize];
};
pub type apow_t = apow;
#[repr(C)]
pub struct dlog_bsgs_struct {
    pub mod_: nmod_t,
    pub m: ulong,
    pub am: ulong,
    pub g: ulong,
    pub table: *mut apow_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dlog_bsgs_struct"][::std::mem::size_of::<dlog_bsgs_struct>() - 56usize];
    [
        "Alignment of dlog_bsgs_struct",
    ][::std::mem::align_of::<dlog_bsgs_struct>() - 8usize];
    [
        "Offset of field: dlog_bsgs_struct::mod_",
    ][::std::mem::offset_of!(dlog_bsgs_struct, mod_) - 0usize];
    [
        "Offset of field: dlog_bsgs_struct::m",
    ][::std::mem::offset_of!(dlog_bsgs_struct, m) - 24usize];
    [
        "Offset of field: dlog_bsgs_struct::am",
    ][::std::mem::offset_of!(dlog_bsgs_struct, am) - 32usize];
    [
        "Offset of field: dlog_bsgs_struct::g",
    ][::std::mem::offset_of!(dlog_bsgs_struct, g) - 40usize];
    [
        "Offset of field: dlog_bsgs_struct::table",
    ][::std::mem::offset_of!(dlog_bsgs_struct, table) - 48usize];
};
pub type dlog_bsgs_t = [dlog_bsgs_struct; 1usize];
#[repr(C)]
pub struct dlog_rho_struct {
    pub a: ulong,
    pub n: nmod_t,
    pub mod_: nmod_t,
    pub nisprime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dlog_rho_struct"][::std::mem::size_of::<dlog_rho_struct>() - 64usize];
    ["Alignment of dlog_rho_struct"][::std::mem::align_of::<dlog_rho_struct>() - 8usize];
    [
        "Offset of field: dlog_rho_struct::a",
    ][::std::mem::offset_of!(dlog_rho_struct, a) - 0usize];
    [
        "Offset of field: dlog_rho_struct::n",
    ][::std::mem::offset_of!(dlog_rho_struct, n) - 8usize];
    [
        "Offset of field: dlog_rho_struct::mod_",
    ][::std::mem::offset_of!(dlog_rho_struct, mod_) - 32usize];
    [
        "Offset of field: dlog_rho_struct::nisprime",
    ][::std::mem::offset_of!(dlog_rho_struct, nisprime) - 56usize];
};
pub type dlog_rho_t = [dlog_rho_struct; 1usize];
#[repr(C)]
pub struct dlog_crt_struct {
    pub mod_: nmod_t,
    pub n: nmod_t,
    pub num: ulong,
    pub expo: *mut ulong,
    pub crt_coeffs: *mut ulong,
    pub pre: dlog_preconn_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dlog_crt_struct"][::std::mem::size_of::<dlog_crt_struct>() - 80usize];
    ["Alignment of dlog_crt_struct"][::std::mem::align_of::<dlog_crt_struct>() - 8usize];
    [
        "Offset of field: dlog_crt_struct::mod_",
    ][::std::mem::offset_of!(dlog_crt_struct, mod_) - 0usize];
    [
        "Offset of field: dlog_crt_struct::n",
    ][::std::mem::offset_of!(dlog_crt_struct, n) - 24usize];
    [
        "Offset of field: dlog_crt_struct::num",
    ][::std::mem::offset_of!(dlog_crt_struct, num) - 48usize];
    [
        "Offset of field: dlog_crt_struct::expo",
    ][::std::mem::offset_of!(dlog_crt_struct, expo) - 56usize];
    [
        "Offset of field: dlog_crt_struct::crt_coeffs",
    ][::std::mem::offset_of!(dlog_crt_struct, crt_coeffs) - 64usize];
    [
        "Offset of field: dlog_crt_struct::pre",
    ][::std::mem::offset_of!(dlog_crt_struct, pre) - 72usize];
};
pub type dlog_crt_t = [dlog_crt_struct; 1usize];
#[repr(C)]
pub struct dlog_power_struct {
    pub mod_: nmod_t,
    pub p: ulong,
    pub e: ulong,
    pub apk: *mut ulong,
    pub pre: *mut dlog_precomp_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dlog_power_struct"][::std::mem::size_of::<dlog_power_struct>() - 56usize];
    [
        "Alignment of dlog_power_struct",
    ][::std::mem::align_of::<dlog_power_struct>() - 8usize];
    [
        "Offset of field: dlog_power_struct::mod_",
    ][::std::mem::offset_of!(dlog_power_struct, mod_) - 0usize];
    [
        "Offset of field: dlog_power_struct::p",
    ][::std::mem::offset_of!(dlog_power_struct, p) - 24usize];
    [
        "Offset of field: dlog_power_struct::e",
    ][::std::mem::offset_of!(dlog_power_struct, e) - 32usize];
    [
        "Offset of field: dlog_power_struct::apk",
    ][::std::mem::offset_of!(dlog_power_struct, apk) - 40usize];
    [
        "Offset of field: dlog_power_struct::pre",
    ][::std::mem::offset_of!(dlog_power_struct, pre) - 48usize];
};
pub type dlog_power_t = [dlog_power_struct; 1usize];
pub type dlog_order23_t = [ulong; 1usize];
#[repr(C)]
pub struct dlog_precomp_struct {
    pub type_: ::std::os::raw::c_int,
    pub cost: ulong,
    pub t: dlog_precomp_struct__bindgen_ty_1,
}
#[repr(C)]
pub struct dlog_precomp_struct__bindgen_ty_1 {
    pub table: __BindgenUnionField<dlog_table_t>,
    pub bsgs: __BindgenUnionField<dlog_bsgs_t>,
    pub crt: __BindgenUnionField<dlog_crt_t>,
    pub power: __BindgenUnionField<dlog_power_t>,
    pub modpe: __BindgenUnionField<dlog_modpe_t>,
    pub order23: __BindgenUnionField<dlog_order23_t>,
    pub bindgen_union_field: [u64; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of dlog_precomp_struct__bindgen_ty_1",
    ][::std::mem::size_of::<dlog_precomp_struct__bindgen_ty_1>() - 80usize];
    [
        "Alignment of dlog_precomp_struct__bindgen_ty_1",
    ][::std::mem::align_of::<dlog_precomp_struct__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: dlog_precomp_struct__bindgen_ty_1::table",
    ][::std::mem::offset_of!(dlog_precomp_struct__bindgen_ty_1, table) - 0usize];
    [
        "Offset of field: dlog_precomp_struct__bindgen_ty_1::bsgs",
    ][::std::mem::offset_of!(dlog_precomp_struct__bindgen_ty_1, bsgs) - 0usize];
    [
        "Offset of field: dlog_precomp_struct__bindgen_ty_1::crt",
    ][::std::mem::offset_of!(dlog_precomp_struct__bindgen_ty_1, crt) - 0usize];
    [
        "Offset of field: dlog_precomp_struct__bindgen_ty_1::power",
    ][::std::mem::offset_of!(dlog_precomp_struct__bindgen_ty_1, power) - 0usize];
    [
        "Offset of field: dlog_precomp_struct__bindgen_ty_1::modpe",
    ][::std::mem::offset_of!(dlog_precomp_struct__bindgen_ty_1, modpe) - 0usize];
    [
        "Offset of field: dlog_precomp_struct__bindgen_ty_1::order23",
    ][::std::mem::offset_of!(dlog_precomp_struct__bindgen_ty_1, order23) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of dlog_precomp_struct",
    ][::std::mem::size_of::<dlog_precomp_struct>() - 96usize];
    [
        "Alignment of dlog_precomp_struct",
    ][::std::mem::align_of::<dlog_precomp_struct>() - 8usize];
    [
        "Offset of field: dlog_precomp_struct::type_",
    ][::std::mem::offset_of!(dlog_precomp_struct, type_) - 0usize];
    [
        "Offset of field: dlog_precomp_struct::cost",
    ][::std::mem::offset_of!(dlog_precomp_struct, cost) - 8usize];
    [
        "Offset of field: dlog_precomp_struct::t",
    ][::std::mem::offset_of!(dlog_precomp_struct, t) - 16usize];
};
pub type dlog_precomp_t = [dlog_precomp_struct; 1usize];
#[repr(C)]
pub struct dirichlet_prime_group_struct {
    pub p: ulong,
    pub e: ::std::os::raw::c_int,
    pub pe: nmod_t,
    pub phi: nmod_t,
    pub g: ulong,
    pub dlog: *mut dlog_precomp_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of dirichlet_prime_group_struct",
    ][::std::mem::size_of::<dirichlet_prime_group_struct>() - 80usize];
    [
        "Alignment of dirichlet_prime_group_struct",
    ][::std::mem::align_of::<dirichlet_prime_group_struct>() - 8usize];
    [
        "Offset of field: dirichlet_prime_group_struct::p",
    ][::std::mem::offset_of!(dirichlet_prime_group_struct, p) - 0usize];
    [
        "Offset of field: dirichlet_prime_group_struct::e",
    ][::std::mem::offset_of!(dirichlet_prime_group_struct, e) - 8usize];
    [
        "Offset of field: dirichlet_prime_group_struct::pe",
    ][::std::mem::offset_of!(dirichlet_prime_group_struct, pe) - 16usize];
    [
        "Offset of field: dirichlet_prime_group_struct::phi",
    ][::std::mem::offset_of!(dirichlet_prime_group_struct, phi) - 40usize];
    [
        "Offset of field: dirichlet_prime_group_struct::g",
    ][::std::mem::offset_of!(dirichlet_prime_group_struct, g) - 64usize];
    [
        "Offset of field: dirichlet_prime_group_struct::dlog",
    ][::std::mem::offset_of!(dirichlet_prime_group_struct, dlog) - 72usize];
};
#[repr(C)]
pub struct dirichlet_group_struct {
    pub q: ulong,
    pub q_even: ulong,
    pub mod_: nmod_t,
    pub rad_q: ulong,
    pub phi_q: ulong,
    pub neven: slong,
    pub num: slong,
    pub expo: ulong,
    pub P: *mut dirichlet_prime_group_struct,
    pub generators: *mut ulong,
    pub PHI: *mut ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of dirichlet_group_struct",
    ][::std::mem::size_of::<dirichlet_group_struct>() - 104usize];
    [
        "Alignment of dirichlet_group_struct",
    ][::std::mem::align_of::<dirichlet_group_struct>() - 8usize];
    [
        "Offset of field: dirichlet_group_struct::q",
    ][::std::mem::offset_of!(dirichlet_group_struct, q) - 0usize];
    [
        "Offset of field: dirichlet_group_struct::q_even",
    ][::std::mem::offset_of!(dirichlet_group_struct, q_even) - 8usize];
    [
        "Offset of field: dirichlet_group_struct::mod_",
    ][::std::mem::offset_of!(dirichlet_group_struct, mod_) - 16usize];
    [
        "Offset of field: dirichlet_group_struct::rad_q",
    ][::std::mem::offset_of!(dirichlet_group_struct, rad_q) - 40usize];
    [
        "Offset of field: dirichlet_group_struct::phi_q",
    ][::std::mem::offset_of!(dirichlet_group_struct, phi_q) - 48usize];
    [
        "Offset of field: dirichlet_group_struct::neven",
    ][::std::mem::offset_of!(dirichlet_group_struct, neven) - 56usize];
    [
        "Offset of field: dirichlet_group_struct::num",
    ][::std::mem::offset_of!(dirichlet_group_struct, num) - 64usize];
    [
        "Offset of field: dirichlet_group_struct::expo",
    ][::std::mem::offset_of!(dirichlet_group_struct, expo) - 72usize];
    [
        "Offset of field: dirichlet_group_struct::P",
    ][::std::mem::offset_of!(dirichlet_group_struct, P) - 80usize];
    [
        "Offset of field: dirichlet_group_struct::generators",
    ][::std::mem::offset_of!(dirichlet_group_struct, generators) - 88usize];
    [
        "Offset of field: dirichlet_group_struct::PHI",
    ][::std::mem::offset_of!(dirichlet_group_struct, PHI) - 96usize];
};
pub type dirichlet_group_t = [dirichlet_group_struct; 1usize];
#[repr(C)]
pub struct dirichlet_char_struct {
    pub n: ulong,
    pub log: *mut ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of dirichlet_char_struct",
    ][::std::mem::size_of::<dirichlet_char_struct>() - 16usize];
    [
        "Alignment of dirichlet_char_struct",
    ][::std::mem::align_of::<dirichlet_char_struct>() - 8usize];
    [
        "Offset of field: dirichlet_char_struct::n",
    ][::std::mem::offset_of!(dirichlet_char_struct, n) - 0usize];
    [
        "Offset of field: dirichlet_char_struct::log",
    ][::std::mem::offset_of!(dirichlet_char_struct, log) - 8usize];
};
pub type dirichlet_char_t = [dirichlet_char_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_hurwitz_precomp_struct {
    pub s: acb_struct,
    pub err: mag_struct,
    pub coeffs: acb_ptr,
    pub deflate: ::std::os::raw::c_int,
    pub A: slong,
    pub N: slong,
    pub K: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dirichlet_hurwitz_precomp_struct",
    ][::std::mem::size_of::<acb_dirichlet_hurwitz_precomp_struct>() - 152usize];
    [
        "Alignment of acb_dirichlet_hurwitz_precomp_struct",
    ][::std::mem::align_of::<acb_dirichlet_hurwitz_precomp_struct>() - 8usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::s",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, s) - 0usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::err",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, err) - 96usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::coeffs",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, coeffs) - 112usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::deflate",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, deflate) - 120usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::A",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, A) - 128usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::N",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, N) - 136usize];
    [
        "Offset of field: acb_dirichlet_hurwitz_precomp_struct::K",
    ][::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, K) - 144usize];
};
pub type acb_dirichlet_hurwitz_precomp_t = [acb_dirichlet_hurwitz_precomp_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_roots_struct {
    pub order: ulong,
    pub reduced_order: ulong,
    pub z: acb_t,
    pub size: slong,
    pub depth: slong,
    pub Z: *mut acb_ptr,
    pub use_pow: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dirichlet_roots_struct",
    ][::std::mem::size_of::<acb_dirichlet_roots_struct>() - 144usize];
    [
        "Alignment of acb_dirichlet_roots_struct",
    ][::std::mem::align_of::<acb_dirichlet_roots_struct>() - 8usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::order",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, order) - 0usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::reduced_order",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, reduced_order) - 8usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::z",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, z) - 16usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::size",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, size) - 112usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::depth",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, depth) - 120usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::Z",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, Z) - 128usize];
    [
        "Offset of field: acb_dirichlet_roots_struct::use_pow",
    ][::std::mem::offset_of!(acb_dirichlet_roots_struct, use_pow) - 136usize];
};
pub type acb_dirichlet_roots_t = [acb_dirichlet_roots_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_platt_c_precomp_struct {
    pub len: slong,
    pub p: arb_ptr,
    pub Xa: arb_struct,
    pub Xb: arb_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dirichlet_platt_c_precomp_struct",
    ][::std::mem::size_of::<acb_dirichlet_platt_c_precomp_struct>() - 112usize];
    [
        "Alignment of acb_dirichlet_platt_c_precomp_struct",
    ][::std::mem::align_of::<acb_dirichlet_platt_c_precomp_struct>() - 8usize];
    [
        "Offset of field: acb_dirichlet_platt_c_precomp_struct::len",
    ][::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, len) - 0usize];
    [
        "Offset of field: acb_dirichlet_platt_c_precomp_struct::p",
    ][::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, p) - 8usize];
    [
        "Offset of field: acb_dirichlet_platt_c_precomp_struct::Xa",
    ][::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, Xa) - 16usize];
    [
        "Offset of field: acb_dirichlet_platt_c_precomp_struct::Xb",
    ][::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, Xb) - 64usize];
};
pub type acb_dirichlet_platt_c_precomp_t = [acb_dirichlet_platt_c_precomp_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_platt_i_precomp_struct {
    pub c1: arb_struct,
    pub c2: arb_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dirichlet_platt_i_precomp_struct",
    ][::std::mem::size_of::<acb_dirichlet_platt_i_precomp_struct>() - 96usize];
    [
        "Alignment of acb_dirichlet_platt_i_precomp_struct",
    ][::std::mem::align_of::<acb_dirichlet_platt_i_precomp_struct>() - 8usize];
    [
        "Offset of field: acb_dirichlet_platt_i_precomp_struct::c1",
    ][::std::mem::offset_of!(acb_dirichlet_platt_i_precomp_struct, c1) - 0usize];
    [
        "Offset of field: acb_dirichlet_platt_i_precomp_struct::c2",
    ][::std::mem::offset_of!(acb_dirichlet_platt_i_precomp_struct, c2) - 48usize];
};
pub type acb_dirichlet_platt_i_precomp_t = [acb_dirichlet_platt_i_precomp_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_platt_ws_precomp_struct {
    pub pre_c: acb_dirichlet_platt_c_precomp_struct,
    pub pre_i: acb_dirichlet_platt_i_precomp_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_dirichlet_platt_ws_precomp_struct",
    ][::std::mem::size_of::<acb_dirichlet_platt_ws_precomp_struct>() - 208usize];
    [
        "Alignment of acb_dirichlet_platt_ws_precomp_struct",
    ][::std::mem::align_of::<acb_dirichlet_platt_ws_precomp_struct>() - 8usize];
    [
        "Offset of field: acb_dirichlet_platt_ws_precomp_struct::pre_c",
    ][::std::mem::offset_of!(acb_dirichlet_platt_ws_precomp_struct, pre_c) - 0usize];
    [
        "Offset of field: acb_dirichlet_platt_ws_precomp_struct::pre_i",
    ][::std::mem::offset_of!(acb_dirichlet_platt_ws_precomp_struct, pre_i) - 112usize];
};
pub type acb_dirichlet_platt_ws_precomp_t = [acb_dirichlet_platt_ws_precomp_struct; 1usize];
#[repr(C)]
pub struct fmpq_mat_struct {
    pub entries: *mut fmpq,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut fmpq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpq_mat_struct"][::std::mem::size_of::<fmpq_mat_struct>() - 32usize];
    ["Alignment of fmpq_mat_struct"][::std::mem::align_of::<fmpq_mat_struct>() - 8usize];
    [
        "Offset of field: fmpq_mat_struct::entries",
    ][::std::mem::offset_of!(fmpq_mat_struct, entries) - 0usize];
    [
        "Offset of field: fmpq_mat_struct::r",
    ][::std::mem::offset_of!(fmpq_mat_struct, r) - 8usize];
    [
        "Offset of field: fmpq_mat_struct::c",
    ][::std::mem::offset_of!(fmpq_mat_struct, c) - 16usize];
    [
        "Offset of field: fmpq_mat_struct::rows",
    ][::std::mem::offset_of!(fmpq_mat_struct, rows) - 24usize];
};
pub type fmpq_mat_t = [fmpq_mat_struct; 1usize];
#[repr(C)]
pub struct fmpq_poly_struct {
    pub coeffs: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
    pub den: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpq_poly_struct"][::std::mem::size_of::<fmpq_poly_struct>() - 32usize];
    [
        "Alignment of fmpq_poly_struct",
    ][::std::mem::align_of::<fmpq_poly_struct>() - 8usize];
    [
        "Offset of field: fmpq_poly_struct::coeffs",
    ][::std::mem::offset_of!(fmpq_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpq_poly_struct::alloc",
    ][::std::mem::offset_of!(fmpq_poly_struct, alloc) - 8usize];
    [
        "Offset of field: fmpq_poly_struct::length",
    ][::std::mem::offset_of!(fmpq_poly_struct, length) - 16usize];
    [
        "Offset of field: fmpq_poly_struct::den",
    ][::std::mem::offset_of!(fmpq_poly_struct, den) - 24usize];
};
pub type fmpq_poly_t = [fmpq_poly_struct; 1usize];
#[repr(C)]
pub struct fmpq_mpoly_struct {
    pub content: fmpq_t,
    pub zpoly: fmpz_mpoly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpq_mpoly_struct"][::std::mem::size_of::<fmpq_mpoly_struct>() - 56usize];
    [
        "Alignment of fmpq_mpoly_struct",
    ][::std::mem::align_of::<fmpq_mpoly_struct>() - 8usize];
    [
        "Offset of field: fmpq_mpoly_struct::content",
    ][::std::mem::offset_of!(fmpq_mpoly_struct, content) - 0usize];
    [
        "Offset of field: fmpq_mpoly_struct::zpoly",
    ][::std::mem::offset_of!(fmpq_mpoly_struct, zpoly) - 16usize];
};
pub type fmpq_mpoly_t = [fmpq_mpoly_struct; 1usize];
#[repr(C)]
pub struct fmpq_mpoly_factor_struct {
    pub constant: fmpq_t,
    pub poly: *mut fmpq_mpoly_struct,
    pub exp: *mut fmpz,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpq_mpoly_factor_struct",
    ][::std::mem::size_of::<fmpq_mpoly_factor_struct>() - 48usize];
    [
        "Alignment of fmpq_mpoly_factor_struct",
    ][::std::mem::align_of::<fmpq_mpoly_factor_struct>() - 8usize];
    [
        "Offset of field: fmpq_mpoly_factor_struct::constant",
    ][::std::mem::offset_of!(fmpq_mpoly_factor_struct, constant) - 0usize];
    [
        "Offset of field: fmpq_mpoly_factor_struct::poly",
    ][::std::mem::offset_of!(fmpq_mpoly_factor_struct, poly) - 16usize];
    [
        "Offset of field: fmpq_mpoly_factor_struct::exp",
    ][::std::mem::offset_of!(fmpq_mpoly_factor_struct, exp) - 24usize];
    [
        "Offset of field: fmpq_mpoly_factor_struct::num",
    ][::std::mem::offset_of!(fmpq_mpoly_factor_struct, num) - 32usize];
    [
        "Offset of field: fmpq_mpoly_factor_struct::alloc",
    ][::std::mem::offset_of!(fmpq_mpoly_factor_struct, alloc) - 40usize];
};
pub type fmpq_mpoly_factor_t = [fmpq_mpoly_factor_struct; 1usize];
#[repr(C)]
pub struct psl2z_struct {
    pub a: fmpz,
    pub b: fmpz,
    pub c: fmpz,
    pub d: fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of psl2z_struct"][::std::mem::size_of::<psl2z_struct>() - 32usize];
    ["Alignment of psl2z_struct"][::std::mem::align_of::<psl2z_struct>() - 8usize];
    [
        "Offset of field: psl2z_struct::a",
    ][::std::mem::offset_of!(psl2z_struct, a) - 0usize];
    [
        "Offset of field: psl2z_struct::b",
    ][::std::mem::offset_of!(psl2z_struct, b) - 8usize];
    [
        "Offset of field: psl2z_struct::c",
    ][::std::mem::offset_of!(psl2z_struct, c) - 16usize];
    [
        "Offset of field: psl2z_struct::d",
    ][::std::mem::offset_of!(psl2z_struct, d) - 24usize];
};
pub type psl2z_t = [psl2z_struct; 1usize];
#[repr(C)]
pub struct acb_theta_eld_struct {
    pub dim: slong,
    pub ambient_dim: slong,
    pub last_coords: *mut slong,
    pub min: slong,
    pub mid: slong,
    pub max: slong,
    pub nr: slong,
    pub nl: slong,
    pub rchildren: *mut acb_theta_eld_struct,
    pub lchildren: *mut acb_theta_eld_struct,
    pub nb_pts: slong,
    pub nb_border: slong,
    pub box_: *mut slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of acb_theta_eld_struct",
    ][::std::mem::size_of::<acb_theta_eld_struct>() - 104usize];
    [
        "Alignment of acb_theta_eld_struct",
    ][::std::mem::align_of::<acb_theta_eld_struct>() - 8usize];
    [
        "Offset of field: acb_theta_eld_struct::dim",
    ][::std::mem::offset_of!(acb_theta_eld_struct, dim) - 0usize];
    [
        "Offset of field: acb_theta_eld_struct::ambient_dim",
    ][::std::mem::offset_of!(acb_theta_eld_struct, ambient_dim) - 8usize];
    [
        "Offset of field: acb_theta_eld_struct::last_coords",
    ][::std::mem::offset_of!(acb_theta_eld_struct, last_coords) - 16usize];
    [
        "Offset of field: acb_theta_eld_struct::min",
    ][::std::mem::offset_of!(acb_theta_eld_struct, min) - 24usize];
    [
        "Offset of field: acb_theta_eld_struct::mid",
    ][::std::mem::offset_of!(acb_theta_eld_struct, mid) - 32usize];
    [
        "Offset of field: acb_theta_eld_struct::max",
    ][::std::mem::offset_of!(acb_theta_eld_struct, max) - 40usize];
    [
        "Offset of field: acb_theta_eld_struct::nr",
    ][::std::mem::offset_of!(acb_theta_eld_struct, nr) - 48usize];
    [
        "Offset of field: acb_theta_eld_struct::nl",
    ][::std::mem::offset_of!(acb_theta_eld_struct, nl) - 56usize];
    [
        "Offset of field: acb_theta_eld_struct::rchildren",
    ][::std::mem::offset_of!(acb_theta_eld_struct, rchildren) - 64usize];
    [
        "Offset of field: acb_theta_eld_struct::lchildren",
    ][::std::mem::offset_of!(acb_theta_eld_struct, lchildren) - 72usize];
    [
        "Offset of field: acb_theta_eld_struct::nb_pts",
    ][::std::mem::offset_of!(acb_theta_eld_struct, nb_pts) - 80usize];
    [
        "Offset of field: acb_theta_eld_struct::nb_border",
    ][::std::mem::offset_of!(acb_theta_eld_struct, nb_border) - 88usize];
    [
        "Offset of field: acb_theta_eld_struct::box_",
    ][::std::mem::offset_of!(acb_theta_eld_struct, box_) - 96usize];
};
pub type acb_theta_eld_t = [acb_theta_eld_struct; 1usize];
pub type acb_theta_naive_worker_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: acb_ptr,
        arg2: acb_srcptr,
        arg3: acb_srcptr,
        arg4: *const slong,
        arg5: slong,
        arg6: *const acb_struct,
        arg7: *const slong,
        arg8: slong,
        arg9: slong,
        arg10: slong,
        arg11: slong,
    ),
>;
pub type acb_theta_ql_worker_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: acb_ptr,
        arg2: acb_srcptr,
        arg3: acb_srcptr,
        arg4: arb_srcptr,
        arg5: arb_srcptr,
        arg6: *const acb_mat_struct,
        arg7: slong,
        arg8: slong,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
pub struct acf_struct {
    pub real: arf_struct,
    pub imag: arf_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acf_struct"][::std::mem::size_of::<acf_struct>() - 64usize];
    ["Alignment of acf_struct"][::std::mem::align_of::<acf_struct>() - 8usize];
    [
        "Offset of field: acf_struct::real",
    ][::std::mem::offset_of!(acf_struct, real) - 0usize];
    [
        "Offset of field: acf_struct::imag",
    ][::std::mem::offset_of!(acf_struct, imag) - 32usize];
};
pub type acf_t = [acf_struct; 1usize];
pub type acf_ptr = *mut acf_struct;
pub type acf_srcptr = *const acf_struct;
#[repr(C)]
pub struct fmpz_mod_ctx {
    pub n: fmpz_t,
    pub add_fxn: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut fmpz,
            arg2: *const fmpz,
            arg3: *const fmpz,
            arg4: *const fmpz_mod_ctx,
        ),
    >,
    pub sub_fxn: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut fmpz,
            arg2: *const fmpz,
            arg3: *const fmpz,
            arg4: *const fmpz_mod_ctx,
        ),
    >,
    pub mul_fxn: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut fmpz,
            arg2: *const fmpz,
            arg3: *const fmpz,
            arg4: *const fmpz_mod_ctx,
        ),
    >,
    pub mod_: nmod_t,
    pub n_limbs: [ulong; 3usize],
    pub ninv_limbs: [ulong; 3usize],
    pub ninv_huge: *mut fmpz_preinvn_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_ctx"][::std::mem::size_of::<fmpz_mod_ctx>() - 112usize];
    ["Alignment of fmpz_mod_ctx"][::std::mem::align_of::<fmpz_mod_ctx>() - 8usize];
    [
        "Offset of field: fmpz_mod_ctx::n",
    ][::std::mem::offset_of!(fmpz_mod_ctx, n) - 0usize];
    [
        "Offset of field: fmpz_mod_ctx::add_fxn",
    ][::std::mem::offset_of!(fmpz_mod_ctx, add_fxn) - 8usize];
    [
        "Offset of field: fmpz_mod_ctx::sub_fxn",
    ][::std::mem::offset_of!(fmpz_mod_ctx, sub_fxn) - 16usize];
    [
        "Offset of field: fmpz_mod_ctx::mul_fxn",
    ][::std::mem::offset_of!(fmpz_mod_ctx, mul_fxn) - 24usize];
    [
        "Offset of field: fmpz_mod_ctx::mod_",
    ][::std::mem::offset_of!(fmpz_mod_ctx, mod_) - 32usize];
    [
        "Offset of field: fmpz_mod_ctx::n_limbs",
    ][::std::mem::offset_of!(fmpz_mod_ctx, n_limbs) - 56usize];
    [
        "Offset of field: fmpz_mod_ctx::ninv_limbs",
    ][::std::mem::offset_of!(fmpz_mod_ctx, ninv_limbs) - 80usize];
    [
        "Offset of field: fmpz_mod_ctx::ninv_huge",
    ][::std::mem::offset_of!(fmpz_mod_ctx, ninv_huge) - 104usize];
};
pub type fmpz_mod_ctx_struct = fmpz_mod_ctx;
pub type fmpz_mod_ctx_t = [fmpz_mod_ctx_struct; 1usize];
pub type fmpz_mod_mat_struct = fmpz_mat_struct;
pub type fmpz_mod_mat_t = [fmpz_mod_mat_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_struct {
    pub coeffs: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_poly_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_poly_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_poly_struct, length) - 16usize];
};
pub type fmpz_mod_poly_t = [fmpz_mod_poly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_factor_struct {
    pub poly: *mut fmpz_mod_poly_struct,
    pub exp: *mut slong,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_factor_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_factor_struct>() - 32usize];
    [
        "Alignment of fmpz_mod_poly_factor_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_factor_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_factor_struct::poly",
    ][::std::mem::offset_of!(fmpz_mod_poly_factor_struct, poly) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_factor_struct::exp",
    ][::std::mem::offset_of!(fmpz_mod_poly_factor_struct, exp) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_factor_struct::num",
    ][::std::mem::offset_of!(fmpz_mod_poly_factor_struct, num) - 16usize];
    [
        "Offset of field: fmpz_mod_poly_factor_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_poly_factor_struct, alloc) - 24usize];
};
pub type fmpz_mod_poly_factor_t = [fmpz_mod_poly_factor_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_struct {
    pub coeffs: *mut fmpz,
    pub exps: *mut ulong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
    pub coeffs_alloc: slong,
    pub exps_alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpoly_struct",
    ][::std::mem::size_of::<fmpz_mod_mpoly_struct>() - 48usize];
    [
        "Alignment of fmpz_mod_mpoly_struct",
    ][::std::mem::align_of::<fmpz_mod_mpoly_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_mpoly_struct::exps",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_struct, length) - 16usize];
    [
        "Offset of field: fmpz_mod_mpoly_struct::bits",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_struct, bits) - 24usize];
    [
        "Offset of field: fmpz_mod_mpoly_struct::coeffs_alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_struct, coeffs_alloc) - 32usize];
    [
        "Offset of field: fmpz_mod_mpoly_struct::exps_alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_struct, exps_alloc) - 40usize];
};
pub type fmpz_mod_mpoly_t = [fmpz_mod_mpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_factor_struct {
    pub constant: fmpz_t,
    pub poly: *mut fmpz_mod_mpoly_struct,
    pub exp: *mut fmpz,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpoly_factor_struct",
    ][::std::mem::size_of::<fmpz_mod_mpoly_factor_struct>() - 40usize];
    [
        "Alignment of fmpz_mod_mpoly_factor_struct",
    ][::std::mem::align_of::<fmpz_mod_mpoly_factor_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_factor_struct::constant",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_factor_struct, constant) - 0usize];
    [
        "Offset of field: fmpz_mod_mpoly_factor_struct::poly",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_factor_struct, poly) - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_factor_struct::exp",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_factor_struct, exp) - 16usize];
    [
        "Offset of field: fmpz_mod_mpoly_factor_struct::num",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_factor_struct, num) - 24usize];
    [
        "Offset of field: fmpz_mod_mpoly_factor_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_factor_struct, alloc) - 32usize];
};
pub type fmpz_mod_mpoly_factor_t = [fmpz_mod_mpoly_factor_struct; 1usize];
#[repr(C)]
pub struct _aprcl_config {
    pub R: ulong,
    pub s: fmpz_t,
    pub rs: n_factor_t,
    pub qs: fmpz_factor_t,
    pub qs_used: *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _aprcl_config"][::std::mem::size_of::<_aprcl_config>() - 248usize];
    ["Alignment of _aprcl_config"][::std::mem::align_of::<_aprcl_config>() - 8usize];
    [
        "Offset of field: _aprcl_config::R",
    ][::std::mem::offset_of!(_aprcl_config, R) - 0usize];
    [
        "Offset of field: _aprcl_config::s",
    ][::std::mem::offset_of!(_aprcl_config, s) - 8usize];
    [
        "Offset of field: _aprcl_config::rs",
    ][::std::mem::offset_of!(_aprcl_config, rs) - 16usize];
    [
        "Offset of field: _aprcl_config::qs",
    ][::std::mem::offset_of!(_aprcl_config, qs) - 200usize];
    [
        "Offset of field: _aprcl_config::qs_used",
    ][::std::mem::offset_of!(_aprcl_config, qs_used) - 240usize];
};
pub type aprcl_config = [_aprcl_config; 1usize];
#[repr(C)]
pub struct _unity_zpq {
    pub polys: *mut fmpz_mod_poly_t,
    pub p: ulong,
    pub q: ulong,
    pub ctx: fmpz_mod_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _unity_zpq"][::std::mem::size_of::<_unity_zpq>() - 136usize];
    ["Alignment of _unity_zpq"][::std::mem::align_of::<_unity_zpq>() - 8usize];
    [
        "Offset of field: _unity_zpq::polys",
    ][::std::mem::offset_of!(_unity_zpq, polys) - 0usize];
    ["Offset of field: _unity_zpq::p"][::std::mem::offset_of!(_unity_zpq, p) - 8usize];
    ["Offset of field: _unity_zpq::q"][::std::mem::offset_of!(_unity_zpq, q) - 16usize];
    [
        "Offset of field: _unity_zpq::ctx",
    ][::std::mem::offset_of!(_unity_zpq, ctx) - 24usize];
};
pub type unity_zpq = [_unity_zpq; 1usize];
#[repr(C)]
pub struct _unity_zp {
    pub poly: fmpz_mod_poly_t,
    pub p: ulong,
    pub exp: ulong,
    pub ctx: fmpz_mod_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _unity_zp"][::std::mem::size_of::<_unity_zp>() - 152usize];
    ["Alignment of _unity_zp"][::std::mem::align_of::<_unity_zp>() - 8usize];
    [
        "Offset of field: _unity_zp::poly",
    ][::std::mem::offset_of!(_unity_zp, poly) - 0usize];
    ["Offset of field: _unity_zp::p"][::std::mem::offset_of!(_unity_zp, p) - 24usize];
    [
        "Offset of field: _unity_zp::exp",
    ][::std::mem::offset_of!(_unity_zp, exp) - 32usize];
    [
        "Offset of field: _unity_zp::ctx",
    ][::std::mem::offset_of!(_unity_zp, ctx) - 40usize];
};
pub type unity_zp = [_unity_zp; 1usize];
pub const primality_test_status_UNKNOWN: primality_test_status = 0;
pub const primality_test_status_PRIME: primality_test_status = 1;
pub const primality_test_status_COMPOSITE: primality_test_status = 2;
pub const primality_test_status_PROBABPRIME: primality_test_status = 3;
pub type primality_test_status = ::std::os::raw::c_uint;
pub type arb_calc_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        out: arb_ptr,
        inp: *const arb_struct,
        param: *mut ::std::os::raw::c_void,
        order: slong,
        prec: slong,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
pub struct complex_double {
    pub real: f64,
    pub imag: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of complex_double"][::std::mem::size_of::<complex_double>() - 16usize];
    ["Alignment of complex_double"][::std::mem::align_of::<complex_double>() - 8usize];
    [
        "Offset of field: complex_double::real",
    ][::std::mem::offset_of!(complex_double, real) - 0usize];
    [
        "Offset of field: complex_double::imag",
    ][::std::mem::offset_of!(complex_double, imag) - 8usize];
};
#[repr(C)]
pub struct arb_hypgeom_gamma_coeff_t {
    pub exp: ::std::os::raw::c_short,
    pub tab_pos: ::std::os::raw::c_short,
    pub nlimbs: ::std::os::raw::c_char,
    pub negative: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of arb_hypgeom_gamma_coeff_t",
    ][::std::mem::size_of::<arb_hypgeom_gamma_coeff_t>() - 6usize];
    [
        "Alignment of arb_hypgeom_gamma_coeff_t",
    ][::std::mem::align_of::<arb_hypgeom_gamma_coeff_t>() - 2usize];
    [
        "Offset of field: arb_hypgeom_gamma_coeff_t::exp",
    ][::std::mem::offset_of!(arb_hypgeom_gamma_coeff_t, exp) - 0usize];
    [
        "Offset of field: arb_hypgeom_gamma_coeff_t::tab_pos",
    ][::std::mem::offset_of!(arb_hypgeom_gamma_coeff_t, tab_pos) - 2usize];
    [
        "Offset of field: arb_hypgeom_gamma_coeff_t::nlimbs",
    ][::std::mem::offset_of!(arb_hypgeom_gamma_coeff_t, nlimbs) - 4usize];
    [
        "Offset of field: arb_hypgeom_gamma_coeff_t::negative",
    ][::std::mem::offset_of!(arb_hypgeom_gamma_coeff_t, negative) - 5usize];
};
#[repr(C)]
pub struct trig_prod_struct {
    pub n: ::std::os::raw::c_int,
    pub prefactor: ::std::os::raw::c_int,
    pub sqrt_p: ulong,
    pub sqrt_q: ulong,
    pub cos_p: [slong; 64usize],
    pub cos_q: [ulong; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of trig_prod_struct"][::std::mem::size_of::<trig_prod_struct>() - 1048usize];
    [
        "Alignment of trig_prod_struct",
    ][::std::mem::align_of::<trig_prod_struct>() - 8usize];
    [
        "Offset of field: trig_prod_struct::n",
    ][::std::mem::offset_of!(trig_prod_struct, n) - 0usize];
    [
        "Offset of field: trig_prod_struct::prefactor",
    ][::std::mem::offset_of!(trig_prod_struct, prefactor) - 4usize];
    [
        "Offset of field: trig_prod_struct::sqrt_p",
    ][::std::mem::offset_of!(trig_prod_struct, sqrt_p) - 8usize];
    [
        "Offset of field: trig_prod_struct::sqrt_q",
    ][::std::mem::offset_of!(trig_prod_struct, sqrt_q) - 16usize];
    [
        "Offset of field: trig_prod_struct::cos_p",
    ][::std::mem::offset_of!(trig_prod_struct, cos_p) - 24usize];
    [
        "Offset of field: trig_prod_struct::cos_q",
    ][::std::mem::offset_of!(trig_prod_struct, cos_q) - 536usize];
};
pub type trig_prod_t = [trig_prod_struct; 1usize];
#[repr(C)]
pub struct bernoulli_rev_struct {
    pub alloc: slong,
    pub prec: slong,
    pub max_power: slong,
    pub powers: *mut fmpz,
    pub pow_error: fmpz_t,
    pub prefactor: arb_t,
    pub two_pi_squared: arb_t,
    pub n: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bernoulli_rev_struct",
    ][::std::mem::size_of::<bernoulli_rev_struct>() - 144usize];
    [
        "Alignment of bernoulli_rev_struct",
    ][::std::mem::align_of::<bernoulli_rev_struct>() - 8usize];
    [
        "Offset of field: bernoulli_rev_struct::alloc",
    ][::std::mem::offset_of!(bernoulli_rev_struct, alloc) - 0usize];
    [
        "Offset of field: bernoulli_rev_struct::prec",
    ][::std::mem::offset_of!(bernoulli_rev_struct, prec) - 8usize];
    [
        "Offset of field: bernoulli_rev_struct::max_power",
    ][::std::mem::offset_of!(bernoulli_rev_struct, max_power) - 16usize];
    [
        "Offset of field: bernoulli_rev_struct::powers",
    ][::std::mem::offset_of!(bernoulli_rev_struct, powers) - 24usize];
    [
        "Offset of field: bernoulli_rev_struct::pow_error",
    ][::std::mem::offset_of!(bernoulli_rev_struct, pow_error) - 32usize];
    [
        "Offset of field: bernoulli_rev_struct::prefactor",
    ][::std::mem::offset_of!(bernoulli_rev_struct, prefactor) - 40usize];
    [
        "Offset of field: bernoulli_rev_struct::two_pi_squared",
    ][::std::mem::offset_of!(bernoulli_rev_struct, two_pi_squared) - 88usize];
    [
        "Offset of field: bernoulli_rev_struct::n",
    ][::std::mem::offset_of!(bernoulli_rev_struct, n) - 136usize];
};
pub type bernoulli_rev_t = [bernoulli_rev_struct; 1usize];
#[repr(C)]
pub struct bool_mat_struct {
    pub entries: *mut ::std::os::raw::c_int,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bool_mat_struct"][::std::mem::size_of::<bool_mat_struct>() - 32usize];
    ["Alignment of bool_mat_struct"][::std::mem::align_of::<bool_mat_struct>() - 8usize];
    [
        "Offset of field: bool_mat_struct::entries",
    ][::std::mem::offset_of!(bool_mat_struct, entries) - 0usize];
    [
        "Offset of field: bool_mat_struct::r",
    ][::std::mem::offset_of!(bool_mat_struct, r) - 8usize];
    [
        "Offset of field: bool_mat_struct::c",
    ][::std::mem::offset_of!(bool_mat_struct, c) - 16usize];
    [
        "Offset of field: bool_mat_struct::rows",
    ][::std::mem::offset_of!(bool_mat_struct, rows) - 24usize];
};
pub type bool_mat_t = [bool_mat_struct; 1usize];
pub type fq_nmod_t = nmod_poly_t;
pub type fq_nmod_struct = nmod_poly_struct;
#[repr(C)]
pub struct fq_nmod_ctx_struct {
    pub mod_: nmod_t,
    pub sparse_modulus: ::std::os::raw::c_int,
    pub is_conway: ::std::os::raw::c_int,
    pub a: *mut ulong,
    pub j: *mut slong,
    pub len: slong,
    pub modulus: nmod_poly_t,
    pub inv: nmod_poly_t,
    pub var: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fq_nmod_ctx_struct",
    ][::std::mem::size_of::<fq_nmod_ctx_struct>() - 160usize];
    [
        "Alignment of fq_nmod_ctx_struct",
    ][::std::mem::align_of::<fq_nmod_ctx_struct>() - 8usize];
    [
        "Offset of field: fq_nmod_ctx_struct::mod_",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, mod_) - 0usize];
    [
        "Offset of field: fq_nmod_ctx_struct::sparse_modulus",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, sparse_modulus) - 24usize];
    [
        "Offset of field: fq_nmod_ctx_struct::is_conway",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, is_conway) - 28usize];
    [
        "Offset of field: fq_nmod_ctx_struct::a",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, a) - 32usize];
    [
        "Offset of field: fq_nmod_ctx_struct::j",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, j) - 40usize];
    [
        "Offset of field: fq_nmod_ctx_struct::len",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, len) - 48usize];
    [
        "Offset of field: fq_nmod_ctx_struct::modulus",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, modulus) - 56usize];
    [
        "Offset of field: fq_nmod_ctx_struct::inv",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, inv) - 104usize];
    [
        "Offset of field: fq_nmod_ctx_struct::var",
    ][::std::mem::offset_of!(fq_nmod_ctx_struct, var) - 152usize];
};
pub type fq_nmod_ctx_t = [fq_nmod_ctx_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mat_struct {
    pub entries: *mut fq_nmod_struct,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut fq_nmod_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fq_nmod_mat_struct",
    ][::std::mem::size_of::<fq_nmod_mat_struct>() - 32usize];
    [
        "Alignment of fq_nmod_mat_struct",
    ][::std::mem::align_of::<fq_nmod_mat_struct>() - 8usize];
    [
        "Offset of field: fq_nmod_mat_struct::entries",
    ][::std::mem::offset_of!(fq_nmod_mat_struct, entries) - 0usize];
    [
        "Offset of field: fq_nmod_mat_struct::r",
    ][::std::mem::offset_of!(fq_nmod_mat_struct, r) - 8usize];
    [
        "Offset of field: fq_nmod_mat_struct::c",
    ][::std::mem::offset_of!(fq_nmod_mat_struct, c) - 16usize];
    [
        "Offset of field: fq_nmod_mat_struct::rows",
    ][::std::mem::offset_of!(fq_nmod_mat_struct, rows) - 24usize];
};
pub type fq_nmod_mat_t = [fq_nmod_mat_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_poly_struct {
    pub coeffs: *mut fq_nmod_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fq_nmod_poly_struct",
    ][::std::mem::size_of::<fq_nmod_poly_struct>() - 24usize];
    [
        "Alignment of fq_nmod_poly_struct",
    ][::std::mem::align_of::<fq_nmod_poly_struct>() - 8usize];
    [
        "Offset of field: fq_nmod_poly_struct::coeffs",
    ][::std::mem::offset_of!(fq_nmod_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: fq_nmod_poly_struct::alloc",
    ][::std::mem::offset_of!(fq_nmod_poly_struct, alloc) - 8usize];
    [
        "Offset of field: fq_nmod_poly_struct::length",
    ][::std::mem::offset_of!(fq_nmod_poly_struct, length) - 16usize];
};
pub type fq_nmod_poly_t = [fq_nmod_poly_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_poly_factor_struct {
    pub poly: *mut fq_nmod_poly_struct,
    pub exp: *mut slong,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fq_nmod_poly_factor_struct",
    ][::std::mem::size_of::<fq_nmod_poly_factor_struct>() - 32usize];
    [
        "Alignment of fq_nmod_poly_factor_struct",
    ][::std::mem::align_of::<fq_nmod_poly_factor_struct>() - 8usize];
    [
        "Offset of field: fq_nmod_poly_factor_struct::poly",
    ][::std::mem::offset_of!(fq_nmod_poly_factor_struct, poly) - 0usize];
    [
        "Offset of field: fq_nmod_poly_factor_struct::exp",
    ][::std::mem::offset_of!(fq_nmod_poly_factor_struct, exp) - 8usize];
    [
        "Offset of field: fq_nmod_poly_factor_struct::num",
    ][::std::mem::offset_of!(fq_nmod_poly_factor_struct, num) - 16usize];
    [
        "Offset of field: fq_nmod_poly_factor_struct::alloc",
    ][::std::mem::offset_of!(fq_nmod_poly_factor_struct, alloc) - 24usize];
};
pub type fq_nmod_poly_factor_t = [fq_nmod_poly_factor_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mpoly_struct {
    pub coeffs: *mut ulong,
    pub exps: *mut ulong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
    pub coeffs_alloc: slong,
    pub exps_alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fq_nmod_mpoly_struct",
    ][::std::mem::size_of::<fq_nmod_mpoly_struct>() - 48usize];
    [
        "Alignment of fq_nmod_mpoly_struct",
    ][::std::mem::align_of::<fq_nmod_mpoly_struct>() - 8usize];
    [
        "Offset of field: fq_nmod_mpoly_struct::coeffs",
    ][::std::mem::offset_of!(fq_nmod_mpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: fq_nmod_mpoly_struct::exps",
    ][::std::mem::offset_of!(fq_nmod_mpoly_struct, exps) - 8usize];
    [
        "Offset of field: fq_nmod_mpoly_struct::length",
    ][::std::mem::offset_of!(fq_nmod_mpoly_struct, length) - 16usize];
    [
        "Offset of field: fq_nmod_mpoly_struct::bits",
    ][::std::mem::offset_of!(fq_nmod_mpoly_struct, bits) - 24usize];
    [
        "Offset of field: fq_nmod_mpoly_struct::coeffs_alloc",
    ][::std::mem::offset_of!(fq_nmod_mpoly_struct, coeffs_alloc) - 32usize];
    [
        "Offset of field: fq_nmod_mpoly_struct::exps_alloc",
    ][::std::mem::offset_of!(fq_nmod_mpoly_struct, exps_alloc) - 40usize];
};
pub type fq_nmod_mpoly_t = [fq_nmod_mpoly_struct; 1usize];
#[repr(C)]
pub struct n_poly_struct {
    pub coeffs: *mut ulong,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_poly_struct"][::std::mem::size_of::<n_poly_struct>() - 24usize];
    ["Alignment of n_poly_struct"][::std::mem::align_of::<n_poly_struct>() - 8usize];
    [
        "Offset of field: n_poly_struct::coeffs",
    ][::std::mem::offset_of!(n_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: n_poly_struct::alloc",
    ][::std::mem::offset_of!(n_poly_struct, alloc) - 8usize];
    [
        "Offset of field: n_poly_struct::length",
    ][::std::mem::offset_of!(n_poly_struct, length) - 16usize];
};
pub type n_poly_t = [n_poly_struct; 1usize];
pub type n_fq_poly_struct = n_poly_struct;
pub type n_fq_poly_t = n_poly_t;
#[repr(C)]
pub struct n_bpoly_struct {
    pub coeffs: *mut n_poly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_bpoly_struct"][::std::mem::size_of::<n_bpoly_struct>() - 24usize];
    ["Alignment of n_bpoly_struct"][::std::mem::align_of::<n_bpoly_struct>() - 8usize];
    [
        "Offset of field: n_bpoly_struct::coeffs",
    ][::std::mem::offset_of!(n_bpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: n_bpoly_struct::alloc",
    ][::std::mem::offset_of!(n_bpoly_struct, alloc) - 8usize];
    [
        "Offset of field: n_bpoly_struct::length",
    ][::std::mem::offset_of!(n_bpoly_struct, length) - 16usize];
};
pub type n_bpoly_t = [n_bpoly_struct; 1usize];
pub type n_fq_bpoly_struct = n_bpoly_struct;
pub type n_fq_bpoly_t = n_bpoly_t;
#[repr(C)]
pub struct n_tpoly_struct {
    pub coeffs: *mut n_bpoly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_tpoly_struct"][::std::mem::size_of::<n_tpoly_struct>() - 24usize];
    ["Alignment of n_tpoly_struct"][::std::mem::align_of::<n_tpoly_struct>() - 8usize];
    [
        "Offset of field: n_tpoly_struct::coeffs",
    ][::std::mem::offset_of!(n_tpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: n_tpoly_struct::alloc",
    ][::std::mem::offset_of!(n_tpoly_struct, alloc) - 8usize];
    [
        "Offset of field: n_tpoly_struct::length",
    ][::std::mem::offset_of!(n_tpoly_struct, length) - 16usize];
};
pub type n_tpoly_t = [n_tpoly_struct; 1usize];
pub type n_fq_tpoly_struct = n_tpoly_struct;
pub type n_fq_tpoly_t = n_tpoly_t;
#[repr(C)]
pub struct n_polyu_struct {
    pub exps: *mut ulong,
    pub coeffs: *mut ulong,
    pub length: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_polyu_struct"][::std::mem::size_of::<n_polyu_struct>() - 32usize];
    ["Alignment of n_polyu_struct"][::std::mem::align_of::<n_polyu_struct>() - 8usize];
    [
        "Offset of field: n_polyu_struct::exps",
    ][::std::mem::offset_of!(n_polyu_struct, exps) - 0usize];
    [
        "Offset of field: n_polyu_struct::coeffs",
    ][::std::mem::offset_of!(n_polyu_struct, coeffs) - 8usize];
    [
        "Offset of field: n_polyu_struct::length",
    ][::std::mem::offset_of!(n_polyu_struct, length) - 16usize];
    [
        "Offset of field: n_polyu_struct::alloc",
    ][::std::mem::offset_of!(n_polyu_struct, alloc) - 24usize];
};
pub type n_polyu_t = [n_polyu_struct; 1usize];
pub type n_fq_polyu_struct = n_polyu_struct;
pub type n_fq_polyu_t = n_polyu_t;
#[repr(C)]
pub struct n_polyun_struct {
    pub coeffs: *mut n_poly_struct,
    pub exps: *mut ulong,
    pub length: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_polyun_struct"][::std::mem::size_of::<n_polyun_struct>() - 32usize];
    ["Alignment of n_polyun_struct"][::std::mem::align_of::<n_polyun_struct>() - 8usize];
    [
        "Offset of field: n_polyun_struct::coeffs",
    ][::std::mem::offset_of!(n_polyun_struct, coeffs) - 0usize];
    [
        "Offset of field: n_polyun_struct::exps",
    ][::std::mem::offset_of!(n_polyun_struct, exps) - 8usize];
    [
        "Offset of field: n_polyun_struct::length",
    ][::std::mem::offset_of!(n_polyun_struct, length) - 16usize];
    [
        "Offset of field: n_polyun_struct::alloc",
    ][::std::mem::offset_of!(n_polyun_struct, alloc) - 24usize];
};
pub type n_polyun_t = [n_polyun_struct; 1usize];
pub type n_fq_polyun_struct = n_polyun_struct;
pub type n_fq_polyun_t = n_polyun_t;
#[repr(C)]
pub struct n_poly_stack_struct {
    pub array: *mut *mut n_poly_struct,
    pub alloc: slong,
    pub top: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of n_poly_stack_struct",
    ][::std::mem::size_of::<n_poly_stack_struct>() - 24usize];
    [
        "Alignment of n_poly_stack_struct",
    ][::std::mem::align_of::<n_poly_stack_struct>() - 8usize];
    [
        "Offset of field: n_poly_stack_struct::array",
    ][::std::mem::offset_of!(n_poly_stack_struct, array) - 0usize];
    [
        "Offset of field: n_poly_stack_struct::alloc",
    ][::std::mem::offset_of!(n_poly_stack_struct, alloc) - 8usize];
    [
        "Offset of field: n_poly_stack_struct::top",
    ][::std::mem::offset_of!(n_poly_stack_struct, top) - 16usize];
};
pub type n_poly_stack_t = [n_poly_stack_struct; 1usize];
#[repr(C)]
pub struct n_bpoly_stack_struct {
    pub array: *mut *mut n_bpoly_struct,
    pub alloc: slong,
    pub top: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of n_bpoly_stack_struct",
    ][::std::mem::size_of::<n_bpoly_stack_struct>() - 24usize];
    [
        "Alignment of n_bpoly_stack_struct",
    ][::std::mem::align_of::<n_bpoly_stack_struct>() - 8usize];
    [
        "Offset of field: n_bpoly_stack_struct::array",
    ][::std::mem::offset_of!(n_bpoly_stack_struct, array) - 0usize];
    [
        "Offset of field: n_bpoly_stack_struct::alloc",
    ][::std::mem::offset_of!(n_bpoly_stack_struct, alloc) - 8usize];
    [
        "Offset of field: n_bpoly_stack_struct::top",
    ][::std::mem::offset_of!(n_bpoly_stack_struct, top) - 16usize];
};
pub type n_bpoly_stack_t = [n_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct n_poly_bpoly_stack_struct {
    pub poly_stack: n_poly_stack_t,
    pub bpoly_stack: n_bpoly_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of n_poly_bpoly_stack_struct",
    ][::std::mem::size_of::<n_poly_bpoly_stack_struct>() - 48usize];
    [
        "Alignment of n_poly_bpoly_stack_struct",
    ][::std::mem::align_of::<n_poly_bpoly_stack_struct>() - 8usize];
    [
        "Offset of field: n_poly_bpoly_stack_struct::poly_stack",
    ][::std::mem::offset_of!(n_poly_bpoly_stack_struct, poly_stack) - 0usize];
    [
        "Offset of field: n_poly_bpoly_stack_struct::bpoly_stack",
    ][::std::mem::offset_of!(n_poly_bpoly_stack_struct, bpoly_stack) - 24usize];
};
pub type n_poly_bpoly_stack_t = [n_poly_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct nmod_eval_interp_struct {
    pub M: *mut ulong,
    pub T: *mut ulong,
    pub Q: *mut ulong,
    pub array: *mut ulong,
    pub alloc: slong,
    pub d: slong,
    pub radix: slong,
    pub w: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_eval_interp_struct",
    ][::std::mem::size_of::<nmod_eval_interp_struct>() - 64usize];
    [
        "Alignment of nmod_eval_interp_struct",
    ][::std::mem::align_of::<nmod_eval_interp_struct>() - 8usize];
    [
        "Offset of field: nmod_eval_interp_struct::M",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, M) - 0usize];
    [
        "Offset of field: nmod_eval_interp_struct::T",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, T) - 8usize];
    [
        "Offset of field: nmod_eval_interp_struct::Q",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, Q) - 16usize];
    [
        "Offset of field: nmod_eval_interp_struct::array",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, array) - 24usize];
    [
        "Offset of field: nmod_eval_interp_struct::alloc",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, alloc) - 32usize];
    [
        "Offset of field: nmod_eval_interp_struct::d",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, d) - 40usize];
    [
        "Offset of field: nmod_eval_interp_struct::radix",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, radix) - 48usize];
    [
        "Offset of field: nmod_eval_interp_struct::w",
    ][::std::mem::offset_of!(nmod_eval_interp_struct, w) - 56usize];
};
pub type nmod_eval_interp_t = [nmod_eval_interp_struct; 1usize];
pub const ordering_t_ORD_LEX: ordering_t = 0;
pub const ordering_t_ORD_DEGLEX: ordering_t = 1;
pub const ordering_t_ORD_DEGREVLEX: ordering_t = 2;
pub type ordering_t = ::std::os::raw::c_uint;
#[repr(C)]
pub struct mpoly_ctx_struct {
    pub nvars: slong,
    pub nfields: slong,
    pub ord: ordering_t,
    pub deg: ::std::os::raw::c_int,
    pub rev: ::std::os::raw::c_int,
    pub lut_words_per_exp: [slong; 64usize],
    pub lut_fix_bits: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_ctx_struct"][::std::mem::size_of::<mpoly_ctx_struct>() - 608usize];
    [
        "Alignment of mpoly_ctx_struct",
    ][::std::mem::align_of::<mpoly_ctx_struct>() - 8usize];
    [
        "Offset of field: mpoly_ctx_struct::nvars",
    ][::std::mem::offset_of!(mpoly_ctx_struct, nvars) - 0usize];
    [
        "Offset of field: mpoly_ctx_struct::nfields",
    ][::std::mem::offset_of!(mpoly_ctx_struct, nfields) - 8usize];
    [
        "Offset of field: mpoly_ctx_struct::ord",
    ][::std::mem::offset_of!(mpoly_ctx_struct, ord) - 16usize];
    [
        "Offset of field: mpoly_ctx_struct::deg",
    ][::std::mem::offset_of!(mpoly_ctx_struct, deg) - 20usize];
    [
        "Offset of field: mpoly_ctx_struct::rev",
    ][::std::mem::offset_of!(mpoly_ctx_struct, rev) - 24usize];
    [
        "Offset of field: mpoly_ctx_struct::lut_words_per_exp",
    ][::std::mem::offset_of!(mpoly_ctx_struct, lut_words_per_exp) - 32usize];
    [
        "Offset of field: mpoly_ctx_struct::lut_fix_bits",
    ][::std::mem::offset_of!(mpoly_ctx_struct, lut_fix_bits) - 544usize];
};
pub type mpoly_ctx_t = [mpoly_ctx_struct; 1usize];
#[repr(C)]
pub struct nmod_mpoly_ctx_struct {
    pub minfo: mpoly_ctx_t,
    pub mod_: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_mpoly_ctx_struct",
    ][::std::mem::size_of::<nmod_mpoly_ctx_struct>() - 632usize];
    [
        "Alignment of nmod_mpoly_ctx_struct",
    ][::std::mem::align_of::<nmod_mpoly_ctx_struct>() - 8usize];
    [
        "Offset of field: nmod_mpoly_ctx_struct::minfo",
    ][::std::mem::offset_of!(nmod_mpoly_ctx_struct, minfo) - 0usize];
    [
        "Offset of field: nmod_mpoly_ctx_struct::mod_",
    ][::std::mem::offset_of!(nmod_mpoly_ctx_struct, mod_) - 608usize];
};
pub type nmod_mpoly_ctx_t = [nmod_mpoly_ctx_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_ctx_struct {
    pub minfo: mpoly_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpoly_ctx_struct",
    ][::std::mem::size_of::<fmpz_mpoly_ctx_struct>() - 608usize];
    [
        "Alignment of fmpz_mpoly_ctx_struct",
    ][::std::mem::align_of::<fmpz_mpoly_ctx_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_ctx_struct::minfo",
    ][::std::mem::offset_of!(fmpz_mpoly_ctx_struct, minfo) - 0usize];
};
pub type fmpz_mpoly_ctx_t = [fmpz_mpoly_ctx_struct; 1usize];
#[repr(C)]
pub struct fmpq_mpoly_ctx_struct {
    pub zctx: fmpz_mpoly_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpq_mpoly_ctx_struct",
    ][::std::mem::size_of::<fmpq_mpoly_ctx_struct>() - 608usize];
    [
        "Alignment of fmpq_mpoly_ctx_struct",
    ][::std::mem::align_of::<fmpq_mpoly_ctx_struct>() - 8usize];
    [
        "Offset of field: fmpq_mpoly_ctx_struct::zctx",
    ][::std::mem::offset_of!(fmpq_mpoly_ctx_struct, zctx) - 0usize];
};
pub type fmpq_mpoly_ctx_t = [fmpq_mpoly_ctx_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_ctx_struct {
    pub minfo: mpoly_ctx_t,
    pub ffinfo: fmpz_mod_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpoly_ctx_struct",
    ][::std::mem::size_of::<fmpz_mod_mpoly_ctx_struct>() - 720usize];
    [
        "Alignment of fmpz_mod_mpoly_ctx_struct",
    ][::std::mem::align_of::<fmpz_mod_mpoly_ctx_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_ctx_struct::minfo",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_ctx_struct, minfo) - 0usize];
    [
        "Offset of field: fmpz_mod_mpoly_ctx_struct::ffinfo",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_ctx_struct, ffinfo) - 608usize];
};
pub type fmpz_mod_mpoly_ctx_t = [fmpz_mod_mpoly_ctx_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mpoly_ctx_struct {
    pub minfo: mpoly_ctx_t,
    pub fqctx: fq_nmod_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fq_nmod_mpoly_ctx_struct",
    ][::std::mem::size_of::<fq_nmod_mpoly_ctx_struct>() - 768usize];
    [
        "Alignment of fq_nmod_mpoly_ctx_struct",
    ][::std::mem::align_of::<fq_nmod_mpoly_ctx_struct>() - 8usize];
    [
        "Offset of field: fq_nmod_mpoly_ctx_struct::minfo",
    ][::std::mem::offset_of!(fq_nmod_mpoly_ctx_struct, minfo) - 0usize];
    [
        "Offset of field: fq_nmod_mpoly_ctx_struct::fqctx",
    ][::std::mem::offset_of!(fq_nmod_mpoly_ctx_struct, fqctx) - 608usize];
};
pub type fq_nmod_mpoly_ctx_t = [fq_nmod_mpoly_ctx_struct; 1usize];
#[repr(C)]
pub struct _bindgen_ty_15 {
    pub elem_size: slong,
    pub ctx: *const ::std::os::raw::c_void,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ),
    >,
    pub clear: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ),
    >,
    pub is_zero: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub zero: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ),
    >,
    pub one: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ),
    >,
    pub set_fmpz: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const fmpz,
            arg3: *const ::std::os::raw::c_void,
        ),
    >,
    pub set: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
        ),
    >,
    pub swap: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
        ),
    >,
    pub neg: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
        ),
    >,
    pub add: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
            arg4: *const ::std::os::raw::c_void,
        ),
    >,
    pub sub: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
            arg4: *const ::std::os::raw::c_void,
        ),
    >,
    pub mul_fmpz: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const fmpz,
            arg4: *const ::std::os::raw::c_void,
        ),
    >,
    pub mul: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
            arg4: *const ::std::os::raw::c_void,
        ),
    >,
    pub divexact: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
            arg4: *const ::std::os::raw::c_void,
        ),
    >,
    pub divides: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_void,
            arg4: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub pow_fmpz: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
            arg3: *const fmpz,
            arg4: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub length: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ) -> slong,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_15"][::std::mem::size_of::<_bindgen_ty_15>() - 152usize];
    ["Alignment of _bindgen_ty_15"][::std::mem::align_of::<_bindgen_ty_15>() - 8usize];
    [
        "Offset of field: _bindgen_ty_15::elem_size",
    ][::std::mem::offset_of!(_bindgen_ty_15, elem_size) - 0usize];
    [
        "Offset of field: _bindgen_ty_15::ctx",
    ][::std::mem::offset_of!(_bindgen_ty_15, ctx) - 8usize];
    [
        "Offset of field: _bindgen_ty_15::init",
    ][::std::mem::offset_of!(_bindgen_ty_15, init) - 16usize];
    [
        "Offset of field: _bindgen_ty_15::clear",
    ][::std::mem::offset_of!(_bindgen_ty_15, clear) - 24usize];
    [
        "Offset of field: _bindgen_ty_15::is_zero",
    ][::std::mem::offset_of!(_bindgen_ty_15, is_zero) - 32usize];
    [
        "Offset of field: _bindgen_ty_15::zero",
    ][::std::mem::offset_of!(_bindgen_ty_15, zero) - 40usize];
    [
        "Offset of field: _bindgen_ty_15::one",
    ][::std::mem::offset_of!(_bindgen_ty_15, one) - 48usize];
    [
        "Offset of field: _bindgen_ty_15::set_fmpz",
    ][::std::mem::offset_of!(_bindgen_ty_15, set_fmpz) - 56usize];
    [
        "Offset of field: _bindgen_ty_15::set",
    ][::std::mem::offset_of!(_bindgen_ty_15, set) - 64usize];
    [
        "Offset of field: _bindgen_ty_15::swap",
    ][::std::mem::offset_of!(_bindgen_ty_15, swap) - 72usize];
    [
        "Offset of field: _bindgen_ty_15::neg",
    ][::std::mem::offset_of!(_bindgen_ty_15, neg) - 80usize];
    [
        "Offset of field: _bindgen_ty_15::add",
    ][::std::mem::offset_of!(_bindgen_ty_15, add) - 88usize];
    [
        "Offset of field: _bindgen_ty_15::sub",
    ][::std::mem::offset_of!(_bindgen_ty_15, sub) - 96usize];
    [
        "Offset of field: _bindgen_ty_15::mul_fmpz",
    ][::std::mem::offset_of!(_bindgen_ty_15, mul_fmpz) - 104usize];
    [
        "Offset of field: _bindgen_ty_15::mul",
    ][::std::mem::offset_of!(_bindgen_ty_15, mul) - 112usize];
    [
        "Offset of field: _bindgen_ty_15::divexact",
    ][::std::mem::offset_of!(_bindgen_ty_15, divexact) - 120usize];
    [
        "Offset of field: _bindgen_ty_15::divides",
    ][::std::mem::offset_of!(_bindgen_ty_15, divides) - 128usize];
    [
        "Offset of field: _bindgen_ty_15::pow_fmpz",
    ][::std::mem::offset_of!(_bindgen_ty_15, pow_fmpz) - 136usize];
    [
        "Offset of field: _bindgen_ty_15::length",
    ][::std::mem::offset_of!(_bindgen_ty_15, length) - 144usize];
};
pub type mpoly_void_ring_t = [_bindgen_ty_15; 1usize];
#[repr(C)]
pub struct mpoly_gcd_info_struct {
    pub Amax_exp: *mut ulong,
    pub Amin_exp: *mut ulong,
    pub Astride: *mut ulong,
    pub Adeflate_deg: *mut slong,
    pub Alead_count: *mut slong,
    pub Atail_count: *mut slong,
    pub Bmax_exp: *mut ulong,
    pub Bmin_exp: *mut ulong,
    pub Bstride: *mut ulong,
    pub Bdeflate_deg: *mut slong,
    pub Blead_count: *mut slong,
    pub Btail_count: *mut slong,
    pub Gmin_exp: *mut ulong,
    pub Abarmin_exp: *mut ulong,
    pub Bbarmin_exp: *mut ulong,
    pub Gstride: *mut ulong,
    pub Gterm_count_est: *mut slong,
    pub Gdeflate_deg_bound: *mut slong,
    pub Gbits: flint_bitcnt_t,
    pub Abarbits: flint_bitcnt_t,
    pub Bbarbits: flint_bitcnt_t,
    pub mvars: slong,
    pub Adeflate_tdeg: slong,
    pub Bdeflate_tdeg: slong,
    pub Adensity: f64,
    pub Bdensity: f64,
    pub hensel_time: f64,
    pub brown_time: f64,
    pub zippel_time: f64,
    pub zippel2_time: f64,
    pub hensel_perm: *mut slong,
    pub brown_perm: *mut slong,
    pub zippel_perm: *mut slong,
    pub zippel2_perm: *mut slong,
    pub can_use: ::std::os::raw::c_uint,
    pub Gdeflate_deg_bounds_are_nice: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of mpoly_gcd_info_struct",
    ][::std::mem::size_of::<mpoly_gcd_info_struct>() - 288usize];
    [
        "Alignment of mpoly_gcd_info_struct",
    ][::std::mem::align_of::<mpoly_gcd_info_struct>() - 8usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Amax_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Amax_exp) - 0usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Amin_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Amin_exp) - 8usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Astride",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Astride) - 16usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Adeflate_deg",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Adeflate_deg) - 24usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Alead_count",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Alead_count) - 32usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Atail_count",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Atail_count) - 40usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bmax_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bmax_exp) - 48usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bmin_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bmin_exp) - 56usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bstride",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bstride) - 64usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bdeflate_deg",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bdeflate_deg) - 72usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Blead_count",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Blead_count) - 80usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Btail_count",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Btail_count) - 88usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Gmin_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Gmin_exp) - 96usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Abarmin_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Abarmin_exp) - 104usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bbarmin_exp",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bbarmin_exp) - 112usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Gstride",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Gstride) - 120usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Gterm_count_est",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Gterm_count_est) - 128usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Gdeflate_deg_bound",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Gdeflate_deg_bound) - 136usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Gbits",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Gbits) - 144usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Abarbits",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Abarbits) - 152usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bbarbits",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bbarbits) - 160usize];
    [
        "Offset of field: mpoly_gcd_info_struct::mvars",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, mvars) - 168usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Adeflate_tdeg",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Adeflate_tdeg) - 176usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bdeflate_tdeg",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bdeflate_tdeg) - 184usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Adensity",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Adensity) - 192usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Bdensity",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Bdensity) - 200usize];
    [
        "Offset of field: mpoly_gcd_info_struct::hensel_time",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, hensel_time) - 208usize];
    [
        "Offset of field: mpoly_gcd_info_struct::brown_time",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, brown_time) - 216usize];
    [
        "Offset of field: mpoly_gcd_info_struct::zippel_time",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, zippel_time) - 224usize];
    [
        "Offset of field: mpoly_gcd_info_struct::zippel2_time",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, zippel2_time) - 232usize];
    [
        "Offset of field: mpoly_gcd_info_struct::hensel_perm",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, hensel_perm) - 240usize];
    [
        "Offset of field: mpoly_gcd_info_struct::brown_perm",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, brown_perm) - 248usize];
    [
        "Offset of field: mpoly_gcd_info_struct::zippel_perm",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, zippel_perm) - 256usize];
    [
        "Offset of field: mpoly_gcd_info_struct::zippel2_perm",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, zippel2_perm) - 264usize];
    [
        "Offset of field: mpoly_gcd_info_struct::can_use",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, can_use) - 272usize];
    [
        "Offset of field: mpoly_gcd_info_struct::Gdeflate_deg_bounds_are_nice",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, Gdeflate_deg_bounds_are_nice)
        - 276usize];
    [
        "Offset of field: mpoly_gcd_info_struct::data",
    ][::std::mem::offset_of!(mpoly_gcd_info_struct, data) - 280usize];
};
pub type mpoly_gcd_info_t = [mpoly_gcd_info_struct; 1usize];
#[repr(C)]
pub struct mpoly_compression_struct {
    pub mvars: slong,
    pub nvars: slong,
    pub exps: *mut slong,
    pub exps_alloc: slong,
    pub rest: *mut slong,
    pub rest_alloc: slong,
    pub umat: *mut slong,
    pub deltas: *mut slong,
    pub degs: *mut slong,
    pub is_trivial: ::std::os::raw::c_int,
    pub is_perm: ::std::os::raw::c_int,
    pub is_irred: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of mpoly_compression_struct",
    ][::std::mem::size_of::<mpoly_compression_struct>() - 88usize];
    [
        "Alignment of mpoly_compression_struct",
    ][::std::mem::align_of::<mpoly_compression_struct>() - 8usize];
    [
        "Offset of field: mpoly_compression_struct::mvars",
    ][::std::mem::offset_of!(mpoly_compression_struct, mvars) - 0usize];
    [
        "Offset of field: mpoly_compression_struct::nvars",
    ][::std::mem::offset_of!(mpoly_compression_struct, nvars) - 8usize];
    [
        "Offset of field: mpoly_compression_struct::exps",
    ][::std::mem::offset_of!(mpoly_compression_struct, exps) - 16usize];
    [
        "Offset of field: mpoly_compression_struct::exps_alloc",
    ][::std::mem::offset_of!(mpoly_compression_struct, exps_alloc) - 24usize];
    [
        "Offset of field: mpoly_compression_struct::rest",
    ][::std::mem::offset_of!(mpoly_compression_struct, rest) - 32usize];
    [
        "Offset of field: mpoly_compression_struct::rest_alloc",
    ][::std::mem::offset_of!(mpoly_compression_struct, rest_alloc) - 40usize];
    [
        "Offset of field: mpoly_compression_struct::umat",
    ][::std::mem::offset_of!(mpoly_compression_struct, umat) - 48usize];
    [
        "Offset of field: mpoly_compression_struct::deltas",
    ][::std::mem::offset_of!(mpoly_compression_struct, deltas) - 56usize];
    [
        "Offset of field: mpoly_compression_struct::degs",
    ][::std::mem::offset_of!(mpoly_compression_struct, degs) - 64usize];
    [
        "Offset of field: mpoly_compression_struct::is_trivial",
    ][::std::mem::offset_of!(mpoly_compression_struct, is_trivial) - 72usize];
    [
        "Offset of field: mpoly_compression_struct::is_perm",
    ][::std::mem::offset_of!(mpoly_compression_struct, is_perm) - 76usize];
    [
        "Offset of field: mpoly_compression_struct::is_irred",
    ][::std::mem::offset_of!(mpoly_compression_struct, is_irred) - 80usize];
};
pub type mpoly_compression_t = [mpoly_compression_struct; 1usize];
#[repr(C)]
pub struct nmod_mpolyn_struct {
    pub coeffs: *mut n_poly_struct,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
    pub bits: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_mpolyn_struct",
    ][::std::mem::size_of::<nmod_mpolyn_struct>() - 40usize];
    [
        "Alignment of nmod_mpolyn_struct",
    ][::std::mem::align_of::<nmod_mpolyn_struct>() - 8usize];
    [
        "Offset of field: nmod_mpolyn_struct::coeffs",
    ][::std::mem::offset_of!(nmod_mpolyn_struct, coeffs) - 0usize];
    [
        "Offset of field: nmod_mpolyn_struct::exps",
    ][::std::mem::offset_of!(nmod_mpolyn_struct, exps) - 8usize];
    [
        "Offset of field: nmod_mpolyn_struct::alloc",
    ][::std::mem::offset_of!(nmod_mpolyn_struct, alloc) - 16usize];
    [
        "Offset of field: nmod_mpolyn_struct::length",
    ][::std::mem::offset_of!(nmod_mpolyn_struct, length) - 24usize];
    [
        "Offset of field: nmod_mpolyn_struct::bits",
    ][::std::mem::offset_of!(nmod_mpolyn_struct, bits) - 32usize];
};
pub type nmod_mpolyn_t = [nmod_mpolyn_struct; 1usize];
#[repr(C)]
pub struct nmod_mpolyun_struct {
    pub coeffs: *mut nmod_mpolyn_struct,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nmod_mpolyun_struct",
    ][::std::mem::size_of::<nmod_mpolyun_struct>() - 40usize];
    [
        "Alignment of nmod_mpolyun_struct",
    ][::std::mem::align_of::<nmod_mpolyun_struct>() - 8usize];
    [
        "Offset of field: nmod_mpolyun_struct::coeffs",
    ][::std::mem::offset_of!(nmod_mpolyun_struct, coeffs) - 0usize];
    [
        "Offset of field: nmod_mpolyun_struct::exps",
    ][::std::mem::offset_of!(nmod_mpolyun_struct, exps) - 8usize];
    [
        "Offset of field: nmod_mpolyun_struct::alloc",
    ][::std::mem::offset_of!(nmod_mpolyun_struct, alloc) - 16usize];
    [
        "Offset of field: nmod_mpolyun_struct::length",
    ][::std::mem::offset_of!(nmod_mpolyun_struct, length) - 24usize];
    [
        "Offset of field: nmod_mpolyun_struct::bits",
    ][::std::mem::offset_of!(nmod_mpolyun_struct, bits) - 32usize];
};
pub type nmod_mpolyun_t = [nmod_mpolyun_struct; 1usize];
pub const nmod_gcds_ret_t_nmod_gcds_success: nmod_gcds_ret_t = 0;
pub const nmod_gcds_ret_t_nmod_gcds_form_main_degree_too_high: nmod_gcds_ret_t = 1;
pub const nmod_gcds_ret_t_nmod_gcds_form_wrong: nmod_gcds_ret_t = 2;
pub const nmod_gcds_ret_t_nmod_gcds_no_solution: nmod_gcds_ret_t = 3;
pub const nmod_gcds_ret_t_nmod_gcds_scales_not_found: nmod_gcds_ret_t = 4;
pub const nmod_gcds_ret_t_nmod_gcds_eval_point_not_found: nmod_gcds_ret_t = 5;
pub const nmod_gcds_ret_t_nmod_gcds_eval_gcd_deg_too_high: nmod_gcds_ret_t = 6;
pub type nmod_gcds_ret_t = ::std::os::raw::c_uint;
#[repr(C)]
pub struct fmpz_mpoly_univar_struct {
    pub coeffs: *mut fmpz_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpoly_univar_struct",
    ][::std::mem::size_of::<fmpz_mpoly_univar_struct>() - 32usize];
    [
        "Alignment of fmpz_mpoly_univar_struct",
    ][::std::mem::align_of::<fmpz_mpoly_univar_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_univar_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mpoly_univar_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mpoly_univar_struct::exps",
    ][::std::mem::offset_of!(fmpz_mpoly_univar_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mpoly_univar_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mpoly_univar_struct, alloc) - 16usize];
    [
        "Offset of field: fmpz_mpoly_univar_struct::length",
    ][::std::mem::offset_of!(fmpz_mpoly_univar_struct, length) - 24usize];
};
pub type fmpz_mpoly_univar_t = [fmpz_mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpolyd_struct {
    pub nvars: slong,
    pub degb_alloc: slong,
    pub deg_bounds: *mut slong,
    pub length: slong,
    pub coeff_alloc: slong,
    pub coeffs: *mut fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpolyd_struct",
    ][::std::mem::size_of::<fmpz_mpolyd_struct>() - 48usize];
    [
        "Alignment of fmpz_mpolyd_struct",
    ][::std::mem::align_of::<fmpz_mpolyd_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpolyd_struct::nvars",
    ][::std::mem::offset_of!(fmpz_mpolyd_struct, nvars) - 0usize];
    [
        "Offset of field: fmpz_mpolyd_struct::degb_alloc",
    ][::std::mem::offset_of!(fmpz_mpolyd_struct, degb_alloc) - 8usize];
    [
        "Offset of field: fmpz_mpolyd_struct::deg_bounds",
    ][::std::mem::offset_of!(fmpz_mpolyd_struct, deg_bounds) - 16usize];
    [
        "Offset of field: fmpz_mpolyd_struct::length",
    ][::std::mem::offset_of!(fmpz_mpolyd_struct, length) - 24usize];
    [
        "Offset of field: fmpz_mpolyd_struct::coeff_alloc",
    ][::std::mem::offset_of!(fmpz_mpolyd_struct, coeff_alloc) - 32usize];
    [
        "Offset of field: fmpz_mpolyd_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mpolyd_struct, coeffs) - 40usize];
};
pub type fmpz_mpolyd_t = [fmpz_mpolyd_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_vec_struct {
    pub p: *mut fmpz_mpoly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpoly_vec_struct",
    ][::std::mem::size_of::<fmpz_mpoly_vec_struct>() - 24usize];
    [
        "Alignment of fmpz_mpoly_vec_struct",
    ][::std::mem::align_of::<fmpz_mpoly_vec_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_vec_struct::p",
    ][::std::mem::offset_of!(fmpz_mpoly_vec_struct, p) - 0usize];
    [
        "Offset of field: fmpz_mpoly_vec_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mpoly_vec_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mpoly_vec_struct::length",
    ][::std::mem::offset_of!(fmpz_mpoly_vec_struct, length) - 16usize];
};
pub type fmpz_mpoly_vec_t = [fmpz_mpoly_vec_struct; 1usize];
#[repr(C)]
pub struct _fmpz_mpoly_stripe_struct {
    pub big_mem: *mut ::std::os::raw::c_char,
    pub big_mem_alloc: slong,
    pub N: slong,
    pub bits: flint_bitcnt_t,
    pub cmpmask: *const ulong,
    pub startidx: *mut slong,
    pub endidx: *mut slong,
    pub emin: *mut ulong,
    pub emax: *mut ulong,
    pub coeff_bits: flint_bitcnt_t,
    pub upperclosed: ::std::os::raw::c_int,
    pub flint_small: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of _fmpz_mpoly_stripe_struct",
    ][::std::mem::size_of::<_fmpz_mpoly_stripe_struct>() - 88usize];
    [
        "Alignment of _fmpz_mpoly_stripe_struct",
    ][::std::mem::align_of::<_fmpz_mpoly_stripe_struct>() - 8usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::big_mem",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, big_mem) - 0usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::big_mem_alloc",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, big_mem_alloc) - 8usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::N",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, N) - 16usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::bits",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, bits) - 24usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::cmpmask",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, cmpmask) - 32usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::startidx",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, startidx) - 40usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::endidx",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, endidx) - 48usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::emin",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, emin) - 56usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::emax",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, emax) - 64usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::coeff_bits",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, coeff_bits) - 72usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::upperclosed",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, upperclosed) - 80usize];
    [
        "Offset of field: _fmpz_mpoly_stripe_struct::flint_small",
    ][::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, flint_small) - 84usize];
};
pub type fmpz_mpoly_stripe_struct = _fmpz_mpoly_stripe_struct;
pub type fmpz_mpoly_stripe_t = [fmpz_mpoly_stripe_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpolyd_ctx_struct {
    pub nvars: slong,
    pub perm: *mut slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpolyd_ctx_struct",
    ][::std::mem::size_of::<fmpz_mpolyd_ctx_struct>() - 16usize];
    [
        "Alignment of fmpz_mpolyd_ctx_struct",
    ][::std::mem::align_of::<fmpz_mpolyd_ctx_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpolyd_ctx_struct::nvars",
    ][::std::mem::offset_of!(fmpz_mpolyd_ctx_struct, nvars) - 0usize];
    [
        "Offset of field: fmpz_mpolyd_ctx_struct::perm",
    ][::std::mem::offset_of!(fmpz_mpolyd_ctx_struct, perm) - 8usize];
};
pub type fmpz_mpolyd_ctx_t = [fmpz_mpolyd_ctx_struct; 1usize];
#[repr(C)]
pub struct _bindgen_ty_16 {
    pub powers: *mut fmpz,
    pub length: slong,
    pub alloc: slong,
    pub tmp: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_16"][::std::mem::size_of::<_bindgen_ty_16>() - 32usize];
    ["Alignment of _bindgen_ty_16"][::std::mem::align_of::<_bindgen_ty_16>() - 8usize];
    [
        "Offset of field: _bindgen_ty_16::powers",
    ][::std::mem::offset_of!(_bindgen_ty_16, powers) - 0usize];
    [
        "Offset of field: _bindgen_ty_16::length",
    ][::std::mem::offset_of!(_bindgen_ty_16, length) - 8usize];
    [
        "Offset of field: _bindgen_ty_16::alloc",
    ][::std::mem::offset_of!(_bindgen_ty_16, alloc) - 16usize];
    [
        "Offset of field: _bindgen_ty_16::tmp",
    ][::std::mem::offset_of!(_bindgen_ty_16, tmp) - 24usize];
};
pub type fmpz_pow_cache_t = [_bindgen_ty_16; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_geobucket {
    pub polys: [fmpz_mpoly_struct; 32usize],
    pub temps: [fmpz_mpoly_struct; 32usize],
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpoly_geobucket",
    ][::std::mem::size_of::<fmpz_mpoly_geobucket>() - 2568usize];
    [
        "Alignment of fmpz_mpoly_geobucket",
    ][::std::mem::align_of::<fmpz_mpoly_geobucket>() - 8usize];
    [
        "Offset of field: fmpz_mpoly_geobucket::polys",
    ][::std::mem::offset_of!(fmpz_mpoly_geobucket, polys) - 0usize];
    [
        "Offset of field: fmpz_mpoly_geobucket::temps",
    ][::std::mem::offset_of!(fmpz_mpoly_geobucket, temps) - 1280usize];
    [
        "Offset of field: fmpz_mpoly_geobucket::length",
    ][::std::mem::offset_of!(fmpz_mpoly_geobucket, length) - 2560usize];
};
pub type fmpz_mpoly_geobucket_struct = fmpz_mpoly_geobucket;
pub type fmpz_mpoly_geobucket_t = [fmpz_mpoly_geobucket_struct; 1usize];
pub const truth_t_T_TRUE: truth_t = 0;
pub const truth_t_T_FALSE: truth_t = 1;
pub const truth_t_T_UNKNOWN: truth_t = 2;
pub type truth_t = ::std::os::raw::c_uint;
#[repr(C)]
pub struct gr_stream_struct {
    pub fp: *mut FLINT_FILE,
    pub s: *mut ::std::os::raw::c_char,
    pub len: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_stream_struct"][::std::mem::size_of::<gr_stream_struct>() - 32usize];
    [
        "Alignment of gr_stream_struct",
    ][::std::mem::align_of::<gr_stream_struct>() - 8usize];
    [
        "Offset of field: gr_stream_struct::fp",
    ][::std::mem::offset_of!(gr_stream_struct, fp) - 0usize];
    [
        "Offset of field: gr_stream_struct::s",
    ][::std::mem::offset_of!(gr_stream_struct, s) - 8usize];
    [
        "Offset of field: gr_stream_struct::len",
    ][::std::mem::offset_of!(gr_stream_struct, len) - 16usize];
    [
        "Offset of field: gr_stream_struct::alloc",
    ][::std::mem::offset_of!(gr_stream_struct, alloc) - 24usize];
};
pub type gr_stream_t = [gr_stream_struct; 1usize];
pub type gr_funcptr = ::std::option::Option<
    unsafe extern "C" fn() -> ::std::os::raw::c_int,
>;
#[repr(C)]
pub struct gr_ctx_struct {
    pub data: [::std::os::raw::c_char; 48usize],
    pub which_ring: ulong,
    pub sizeof_elem: slong,
    pub methods: *mut gr_funcptr,
    pub size_limit: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_ctx_struct"][::std::mem::size_of::<gr_ctx_struct>() - 80usize];
    ["Alignment of gr_ctx_struct"][::std::mem::align_of::<gr_ctx_struct>() - 8usize];
    [
        "Offset of field: gr_ctx_struct::data",
    ][::std::mem::offset_of!(gr_ctx_struct, data) - 0usize];
    [
        "Offset of field: gr_ctx_struct::which_ring",
    ][::std::mem::offset_of!(gr_ctx_struct, which_ring) - 48usize];
    [
        "Offset of field: gr_ctx_struct::sizeof_elem",
    ][::std::mem::offset_of!(gr_ctx_struct, sizeof_elem) - 56usize];
    [
        "Offset of field: gr_ctx_struct::methods",
    ][::std::mem::offset_of!(gr_ctx_struct, methods) - 64usize];
    [
        "Offset of field: gr_ctx_struct::size_limit",
    ][::std::mem::offset_of!(gr_ctx_struct, size_limit) - 72usize];
};
pub type gr_ctx_t = [gr_ctx_struct; 1usize];
pub type gr_ptr = *mut ::std::os::raw::c_void;
pub type gr_srcptr = *const ::std::os::raw::c_void;
pub type gr_ctx_ptr = *mut ::std::os::raw::c_void;
#[repr(C)]
pub struct gr_vec_struct {
    pub entries: gr_ptr,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_vec_struct"][::std::mem::size_of::<gr_vec_struct>() - 24usize];
    ["Alignment of gr_vec_struct"][::std::mem::align_of::<gr_vec_struct>() - 8usize];
    [
        "Offset of field: gr_vec_struct::entries",
    ][::std::mem::offset_of!(gr_vec_struct, entries) - 0usize];
    [
        "Offset of field: gr_vec_struct::alloc",
    ][::std::mem::offset_of!(gr_vec_struct, alloc) - 8usize];
    [
        "Offset of field: gr_vec_struct::length",
    ][::std::mem::offset_of!(gr_vec_struct, length) - 16usize];
};
pub type gr_vec_t = [gr_vec_struct; 1usize];
#[repr(C)]
pub struct gr_mat_struct {
    pub entries: gr_ptr,
    pub r: slong,
    pub c: slong,
    pub rows: *mut gr_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_mat_struct"][::std::mem::size_of::<gr_mat_struct>() - 32usize];
    ["Alignment of gr_mat_struct"][::std::mem::align_of::<gr_mat_struct>() - 8usize];
    [
        "Offset of field: gr_mat_struct::entries",
    ][::std::mem::offset_of!(gr_mat_struct, entries) - 0usize];
    [
        "Offset of field: gr_mat_struct::r",
    ][::std::mem::offset_of!(gr_mat_struct, r) - 8usize];
    [
        "Offset of field: gr_mat_struct::c",
    ][::std::mem::offset_of!(gr_mat_struct, c) - 16usize];
    [
        "Offset of field: gr_mat_struct::rows",
    ][::std::mem::offset_of!(gr_mat_struct, rows) - 24usize];
};
pub type gr_mat_t = [gr_mat_struct; 1usize];
#[repr(C)]
pub struct gr_poly_struct {
    pub coeffs: gr_ptr,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_poly_struct"][::std::mem::size_of::<gr_poly_struct>() - 24usize];
    ["Alignment of gr_poly_struct"][::std::mem::align_of::<gr_poly_struct>() - 8usize];
    [
        "Offset of field: gr_poly_struct::coeffs",
    ][::std::mem::offset_of!(gr_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: gr_poly_struct::alloc",
    ][::std::mem::offset_of!(gr_poly_struct, alloc) - 8usize];
    [
        "Offset of field: gr_poly_struct::length",
    ][::std::mem::offset_of!(gr_poly_struct, length) - 16usize];
};
pub type gr_poly_t = [gr_poly_struct; 1usize];
#[repr(C)]
pub struct fexpr_struct {
    pub data: *mut ulong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fexpr_struct"][::std::mem::size_of::<fexpr_struct>() - 16usize];
    ["Alignment of fexpr_struct"][::std::mem::align_of::<fexpr_struct>() - 8usize];
    [
        "Offset of field: fexpr_struct::data",
    ][::std::mem::offset_of!(fexpr_struct, data) - 0usize];
    [
        "Offset of field: fexpr_struct::alloc",
    ][::std::mem::offset_of!(fexpr_struct, alloc) - 8usize];
};
pub type fexpr_t = [fexpr_struct; 1usize];
pub type fexpr_ptr = *mut fexpr_struct;
pub type fexpr_srcptr = *const fexpr_struct;
#[repr(C)]
pub struct fexpr_vec_struct {
    pub entries: *mut fexpr_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fexpr_vec_struct"][::std::mem::size_of::<fexpr_vec_struct>() - 24usize];
    [
        "Alignment of fexpr_vec_struct",
    ][::std::mem::align_of::<fexpr_vec_struct>() - 8usize];
    [
        "Offset of field: fexpr_vec_struct::entries",
    ][::std::mem::offset_of!(fexpr_vec_struct, entries) - 0usize];
    [
        "Offset of field: fexpr_vec_struct::alloc",
    ][::std::mem::offset_of!(fexpr_vec_struct, alloc) - 8usize];
    [
        "Offset of field: fexpr_vec_struct::length",
    ][::std::mem::offset_of!(fexpr_vec_struct, length) - 16usize];
};
pub type fexpr_vec_t = [fexpr_vec_struct; 1usize];
#[repr(C)]
pub struct qqbar_struct {
    pub poly: fmpz_poly_struct,
    pub enclosure: acb_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qqbar_struct"][::std::mem::size_of::<qqbar_struct>() - 120usize];
    ["Alignment of qqbar_struct"][::std::mem::align_of::<qqbar_struct>() - 8usize];
    [
        "Offset of field: qqbar_struct::poly",
    ][::std::mem::offset_of!(qqbar_struct, poly) - 0usize];
    [
        "Offset of field: qqbar_struct::enclosure",
    ][::std::mem::offset_of!(qqbar_struct, enclosure) - 24usize];
};
pub type qqbar_t = [qqbar_struct; 1usize];
pub type qqbar_ptr = *mut qqbar_struct;
pub type qqbar_srcptr = *const qqbar_struct;
/// 2x2 integer matrix
#[repr(C)]
pub struct _fmpz_mat22_struct {
    pub _11: fmpz_t,
    pub _12: fmpz_t,
    pub _21: fmpz_t,
    pub _22: fmpz_t,
    pub det: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of _fmpz_mat22_struct",
    ][::std::mem::size_of::<_fmpz_mat22_struct>() - 40usize];
    [
        "Alignment of _fmpz_mat22_struct",
    ][::std::mem::align_of::<_fmpz_mat22_struct>() - 8usize];
    [
        "Offset of field: _fmpz_mat22_struct::_11",
    ][::std::mem::offset_of!(_fmpz_mat22_struct, _11) - 0usize];
    [
        "Offset of field: _fmpz_mat22_struct::_12",
    ][::std::mem::offset_of!(_fmpz_mat22_struct, _12) - 8usize];
    [
        "Offset of field: _fmpz_mat22_struct::_21",
    ][::std::mem::offset_of!(_fmpz_mat22_struct, _21) - 16usize];
    [
        "Offset of field: _fmpz_mat22_struct::_22",
    ][::std::mem::offset_of!(_fmpz_mat22_struct, _22) - 24usize];
    [
        "Offset of field: _fmpz_mat22_struct::det",
    ][::std::mem::offset_of!(_fmpz_mat22_struct, det) - 32usize];
};
pub type _fmpz_mat22_t = [_fmpz_mat22_struct; 1usize];
#[repr(C)]
pub struct _ui_mat22_struct {
    pub _11: ulong,
    pub _12: ulong,
    pub _21: ulong,
    pub _22: ulong,
    pub det: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ui_mat22_struct"][::std::mem::size_of::<_ui_mat22_struct>() - 40usize];
    [
        "Alignment of _ui_mat22_struct",
    ][::std::mem::align_of::<_ui_mat22_struct>() - 8usize];
    [
        "Offset of field: _ui_mat22_struct::_11",
    ][::std::mem::offset_of!(_ui_mat22_struct, _11) - 0usize];
    [
        "Offset of field: _ui_mat22_struct::_12",
    ][::std::mem::offset_of!(_ui_mat22_struct, _12) - 8usize];
    [
        "Offset of field: _ui_mat22_struct::_21",
    ][::std::mem::offset_of!(_ui_mat22_struct, _21) - 16usize];
    [
        "Offset of field: _ui_mat22_struct::_22",
    ][::std::mem::offset_of!(_ui_mat22_struct, _22) - 24usize];
    [
        "Offset of field: _ui_mat22_struct::det",
    ][::std::mem::offset_of!(_ui_mat22_struct, det) - 32usize];
};
pub type _ui_mat22_t = [_ui_mat22_struct; 1usize];
/// resizable integer vector specific to cfrac functionality
#[repr(C)]
pub struct _fmpq_cfrac_list_struct {
    pub array: *mut fmpz,
    pub length: slong,
    pub alloc: slong,
    pub limit: slong,
    pub alt_sum: fmpz_t,
    pub want_alt_sum: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of _fmpq_cfrac_list_struct",
    ][::std::mem::size_of::<_fmpq_cfrac_list_struct>() - 48usize];
    [
        "Alignment of _fmpq_cfrac_list_struct",
    ][::std::mem::align_of::<_fmpq_cfrac_list_struct>() - 8usize];
    [
        "Offset of field: _fmpq_cfrac_list_struct::array",
    ][::std::mem::offset_of!(_fmpq_cfrac_list_struct, array) - 0usize];
    [
        "Offset of field: _fmpq_cfrac_list_struct::length",
    ][::std::mem::offset_of!(_fmpq_cfrac_list_struct, length) - 8usize];
    [
        "Offset of field: _fmpq_cfrac_list_struct::alloc",
    ][::std::mem::offset_of!(_fmpq_cfrac_list_struct, alloc) - 16usize];
    [
        "Offset of field: _fmpq_cfrac_list_struct::limit",
    ][::std::mem::offset_of!(_fmpq_cfrac_list_struct, limit) - 24usize];
    [
        "Offset of field: _fmpq_cfrac_list_struct::alt_sum",
    ][::std::mem::offset_of!(_fmpq_cfrac_list_struct, alt_sum) - 32usize];
    [
        "Offset of field: _fmpq_cfrac_list_struct::want_alt_sum",
    ][::std::mem::offset_of!(_fmpq_cfrac_list_struct, want_alt_sum) - 40usize];
};
pub type _fmpq_cfrac_list_t = [_fmpq_cfrac_list_struct; 1usize];
/// ball for closed interval [left, right]
#[repr(C)]
pub struct _fmpq_ball_struct {
    pub left_num: fmpz_t,
    pub left_den: fmpz_t,
    pub right_num: fmpz_t,
    pub right_den: fmpz_t,
    pub exact: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmpq_ball_struct"][::std::mem::size_of::<_fmpq_ball_struct>() - 40usize];
    [
        "Alignment of _fmpq_ball_struct",
    ][::std::mem::align_of::<_fmpq_ball_struct>() - 8usize];
    [
        "Offset of field: _fmpq_ball_struct::left_num",
    ][::std::mem::offset_of!(_fmpq_ball_struct, left_num) - 0usize];
    [
        "Offset of field: _fmpq_ball_struct::left_den",
    ][::std::mem::offset_of!(_fmpq_ball_struct, left_den) - 8usize];
    [
        "Offset of field: _fmpq_ball_struct::right_num",
    ][::std::mem::offset_of!(_fmpq_ball_struct, right_num) - 16usize];
    [
        "Offset of field: _fmpq_ball_struct::right_den",
    ][::std::mem::offset_of!(_fmpq_ball_struct, right_den) - 24usize];
    [
        "Offset of field: _fmpq_ball_struct::exact",
    ][::std::mem::offset_of!(_fmpq_ball_struct, exact) - 32usize];
};
pub type _fmpq_ball_t = [_fmpq_ball_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_powers_precomp_struct {
    pub powers: *mut *mut fmpz,
    pub len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_poly_powers_precomp_struct",
    ][::std::mem::size_of::<fmpz_poly_powers_precomp_struct>() - 16usize];
    [
        "Alignment of fmpz_poly_powers_precomp_struct",
    ][::std::mem::align_of::<fmpz_poly_powers_precomp_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_powers_precomp_struct::powers",
    ][::std::mem::offset_of!(fmpz_poly_powers_precomp_struct, powers) - 0usize];
    [
        "Offset of field: fmpz_poly_powers_precomp_struct::len",
    ][::std::mem::offset_of!(fmpz_poly_powers_precomp_struct, len) - 8usize];
};
pub type fmpz_poly_powers_precomp_t = [fmpz_poly_powers_precomp_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_mul_precache_struct {
    pub jj: *mut *mut ulong,
    pub n: slong,
    pub len2: slong,
    pub loglen: slong,
    pub bits2: slong,
    pub limbs: slong,
    pub poly2: fmpz_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_poly_mul_precache_struct",
    ][::std::mem::size_of::<fmpz_poly_mul_precache_struct>() - 72usize];
    [
        "Alignment of fmpz_poly_mul_precache_struct",
    ][::std::mem::align_of::<fmpz_poly_mul_precache_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::jj",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, jj) - 0usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::n",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, n) - 8usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::len2",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, len2) - 16usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::loglen",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, loglen) - 24usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::bits2",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, bits2) - 32usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::limbs",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, limbs) - 40usize];
    [
        "Offset of field: fmpz_poly_mul_precache_struct::poly2",
    ][::std::mem::offset_of!(fmpz_poly_mul_precache_struct, poly2) - 48usize];
};
pub type fmpz_poly_mul_precache_t = [fmpz_poly_mul_precache_struct; 1usize];
#[repr(C)]
pub struct fmpq_poly_powers_precomp_struct {
    pub powers: *mut fmpq_poly_struct,
    pub len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpq_poly_powers_precomp_struct",
    ][::std::mem::size_of::<fmpq_poly_powers_precomp_struct>() - 16usize];
    [
        "Alignment of fmpq_poly_powers_precomp_struct",
    ][::std::mem::align_of::<fmpq_poly_powers_precomp_struct>() - 8usize];
    [
        "Offset of field: fmpq_poly_powers_precomp_struct::powers",
    ][::std::mem::offset_of!(fmpq_poly_powers_precomp_struct, powers) - 0usize];
    [
        "Offset of field: fmpq_poly_powers_precomp_struct::len",
    ][::std::mem::offset_of!(fmpq_poly_powers_precomp_struct, len) - 8usize];
};
pub type fmpq_poly_powers_precomp_t = [fmpq_poly_powers_precomp_struct; 1usize];
#[repr(C)]
pub struct nf_struct {
    pub pol: fmpq_poly_t,
    pub pinv: nf_struct__bindgen_ty_1,
    pub powers: nf_struct__bindgen_ty_2,
    pub traces: fmpq_poly_t,
    pub flag: ulong,
}
#[repr(C)]
pub struct nf_struct__bindgen_ty_1 {
    pub qq: __BindgenUnionField<fmpz_preinvn_t>,
    pub bindgen_union_field: [u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nf_struct__bindgen_ty_1",
    ][::std::mem::size_of::<nf_struct__bindgen_ty_1>() - 24usize];
    [
        "Alignment of nf_struct__bindgen_ty_1",
    ][::std::mem::align_of::<nf_struct__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: nf_struct__bindgen_ty_1::qq",
    ][::std::mem::offset_of!(nf_struct__bindgen_ty_1, qq) - 0usize];
};
#[repr(C)]
pub struct nf_struct__bindgen_ty_2 {
    pub qq: __BindgenUnionField<fmpq_poly_powers_precomp_t>,
    pub zz: __BindgenUnionField<fmpz_poly_powers_precomp_t>,
    pub bindgen_union_field: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of nf_struct__bindgen_ty_2",
    ][::std::mem::size_of::<nf_struct__bindgen_ty_2>() - 16usize];
    [
        "Alignment of nf_struct__bindgen_ty_2",
    ][::std::mem::align_of::<nf_struct__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: nf_struct__bindgen_ty_2::qq",
    ][::std::mem::offset_of!(nf_struct__bindgen_ty_2, qq) - 0usize];
    [
        "Offset of field: nf_struct__bindgen_ty_2::zz",
    ][::std::mem::offset_of!(nf_struct__bindgen_ty_2, zz) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nf_struct"][::std::mem::size_of::<nf_struct>() - 112usize];
    ["Alignment of nf_struct"][::std::mem::align_of::<nf_struct>() - 8usize];
    ["Offset of field: nf_struct::pol"][::std::mem::offset_of!(nf_struct, pol) - 0usize];
    [
        "Offset of field: nf_struct::pinv",
    ][::std::mem::offset_of!(nf_struct, pinv) - 32usize];
    [
        "Offset of field: nf_struct::powers",
    ][::std::mem::offset_of!(nf_struct, powers) - 56usize];
    [
        "Offset of field: nf_struct::traces",
    ][::std::mem::offset_of!(nf_struct, traces) - 72usize];
    [
        "Offset of field: nf_struct::flag",
    ][::std::mem::offset_of!(nf_struct, flag) - 104usize];
};
pub type nf_t = [nf_struct; 1usize];
#[repr(C)]
pub struct lnf_elem_struct {
    pub num: fmpz_t,
    pub den: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lnf_elem_struct"][::std::mem::size_of::<lnf_elem_struct>() - 16usize];
    ["Alignment of lnf_elem_struct"][::std::mem::align_of::<lnf_elem_struct>() - 8usize];
    [
        "Offset of field: lnf_elem_struct::num",
    ][::std::mem::offset_of!(lnf_elem_struct, num) - 0usize];
    [
        "Offset of field: lnf_elem_struct::den",
    ][::std::mem::offset_of!(lnf_elem_struct, den) - 8usize];
};
pub type lnf_elem_t = [lnf_elem_struct; 1usize];
#[repr(C)]
pub struct qnf_elem_struct {
    pub num: [fmpz; 3usize],
    pub den: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qnf_elem_struct"][::std::mem::size_of::<qnf_elem_struct>() - 32usize];
    ["Alignment of qnf_elem_struct"][::std::mem::align_of::<qnf_elem_struct>() - 8usize];
    [
        "Offset of field: qnf_elem_struct::num",
    ][::std::mem::offset_of!(qnf_elem_struct, num) - 0usize];
    [
        "Offset of field: qnf_elem_struct::den",
    ][::std::mem::offset_of!(qnf_elem_struct, den) - 24usize];
};
pub type qnf_elem_t = [qnf_elem_struct; 1usize];
#[repr(C)]
pub struct nf_elem_struct {
    pub elem: __BindgenUnionField<fmpq_poly_t>,
    pub lelem: __BindgenUnionField<lnf_elem_t>,
    pub qelem: __BindgenUnionField<qnf_elem_t>,
    pub bindgen_union_field: [u64; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nf_elem_struct"][::std::mem::size_of::<nf_elem_struct>() - 32usize];
    ["Alignment of nf_elem_struct"][::std::mem::align_of::<nf_elem_struct>() - 8usize];
    [
        "Offset of field: nf_elem_struct::elem",
    ][::std::mem::offset_of!(nf_elem_struct, elem) - 0usize];
    [
        "Offset of field: nf_elem_struct::lelem",
    ][::std::mem::offset_of!(nf_elem_struct, lelem) - 0usize];
    [
        "Offset of field: nf_elem_struct::qelem",
    ][::std::mem::offset_of!(nf_elem_struct, qelem) - 0usize];
};
pub type nf_elem_t = [nf_elem_struct; 1usize];
pub const calcium_func_code_CA_QQBar: calcium_func_code = 0;
pub const calcium_func_code_CA_Neg: calcium_func_code = 1;
pub const calcium_func_code_CA_Add: calcium_func_code = 2;
pub const calcium_func_code_CA_Sub: calcium_func_code = 3;
pub const calcium_func_code_CA_Mul: calcium_func_code = 4;
pub const calcium_func_code_CA_Div: calcium_func_code = 5;
pub const calcium_func_code_CA_Sqrt: calcium_func_code = 6;
pub const calcium_func_code_CA_Cbrt: calcium_func_code = 7;
pub const calcium_func_code_CA_Root: calcium_func_code = 8;
pub const calcium_func_code_CA_Floor: calcium_func_code = 9;
pub const calcium_func_code_CA_Ceil: calcium_func_code = 10;
pub const calcium_func_code_CA_Abs: calcium_func_code = 11;
pub const calcium_func_code_CA_Sign: calcium_func_code = 12;
pub const calcium_func_code_CA_Re: calcium_func_code = 13;
pub const calcium_func_code_CA_Im: calcium_func_code = 14;
pub const calcium_func_code_CA_Arg: calcium_func_code = 15;
pub const calcium_func_code_CA_Conjugate: calcium_func_code = 16;
pub const calcium_func_code_CA_Pi: calcium_func_code = 17;
pub const calcium_func_code_CA_Sin: calcium_func_code = 18;
pub const calcium_func_code_CA_Cos: calcium_func_code = 19;
pub const calcium_func_code_CA_Exp: calcium_func_code = 20;
pub const calcium_func_code_CA_Log: calcium_func_code = 21;
pub const calcium_func_code_CA_Pow: calcium_func_code = 22;
pub const calcium_func_code_CA_Tan: calcium_func_code = 23;
pub const calcium_func_code_CA_Cot: calcium_func_code = 24;
pub const calcium_func_code_CA_Cosh: calcium_func_code = 25;
pub const calcium_func_code_CA_Sinh: calcium_func_code = 26;
pub const calcium_func_code_CA_Tanh: calcium_func_code = 27;
pub const calcium_func_code_CA_Coth: calcium_func_code = 28;
pub const calcium_func_code_CA_Atan: calcium_func_code = 29;
pub const calcium_func_code_CA_Acos: calcium_func_code = 30;
pub const calcium_func_code_CA_Asin: calcium_func_code = 31;
pub const calcium_func_code_CA_Acot: calcium_func_code = 32;
pub const calcium_func_code_CA_Atanh: calcium_func_code = 33;
pub const calcium_func_code_CA_Acosh: calcium_func_code = 34;
pub const calcium_func_code_CA_Asinh: calcium_func_code = 35;
pub const calcium_func_code_CA_Acoth: calcium_func_code = 36;
pub const calcium_func_code_CA_Euler: calcium_func_code = 37;
pub const calcium_func_code_CA_Gamma: calcium_func_code = 38;
pub const calcium_func_code_CA_LogGamma: calcium_func_code = 39;
pub const calcium_func_code_CA_Psi: calcium_func_code = 40;
pub const calcium_func_code_CA_Erf: calcium_func_code = 41;
pub const calcium_func_code_CA_Erfc: calcium_func_code = 42;
pub const calcium_func_code_CA_Erfi: calcium_func_code = 43;
pub const calcium_func_code_CA_RiemannZeta: calcium_func_code = 44;
pub const calcium_func_code_CA_HurwitzZeta: calcium_func_code = 45;
pub const calcium_func_code_CA_FUNC_CODE_LENGTH: calcium_func_code = 46;
pub type calcium_func_code = ::std::os::raw::c_uint;
#[repr(C)]
pub struct ca_elem_struct {
    pub q: __BindgenUnionField<fmpq>,
    pub nf: __BindgenUnionField<nf_elem_struct>,
    pub mpoly_q: __BindgenUnionField<*mut fmpz_mpoly_q_struct>,
    pub bindgen_union_field: [u64; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_elem_struct"][::std::mem::size_of::<ca_elem_struct>() - 32usize];
    ["Alignment of ca_elem_struct"][::std::mem::align_of::<ca_elem_struct>() - 8usize];
    [
        "Offset of field: ca_elem_struct::q",
    ][::std::mem::offset_of!(ca_elem_struct, q) - 0usize];
    [
        "Offset of field: ca_elem_struct::nf",
    ][::std::mem::offset_of!(ca_elem_struct, nf) - 0usize];
    [
        "Offset of field: ca_elem_struct::mpoly_q",
    ][::std::mem::offset_of!(ca_elem_struct, mpoly_q) - 0usize];
};
#[repr(C)]
pub struct ca_struct {
    pub field: ulong,
    pub elem: ca_elem_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_struct"][::std::mem::size_of::<ca_struct>() - 40usize];
    ["Alignment of ca_struct"][::std::mem::align_of::<ca_struct>() - 8usize];
    [
        "Offset of field: ca_struct::field",
    ][::std::mem::offset_of!(ca_struct, field) - 0usize];
    [
        "Offset of field: ca_struct::elem",
    ][::std::mem::offset_of!(ca_struct, elem) - 8usize];
};
pub type ca_t = [ca_struct; 1usize];
pub type ca_ptr = *mut ca_struct;
pub type ca_srcptr = *const ca_struct;
#[repr(C)]
pub struct ca_ext_qqbar {
    pub x: qqbar_struct,
    pub nf: *mut nf_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_ext_qqbar"][::std::mem::size_of::<ca_ext_qqbar>() - 128usize];
    ["Alignment of ca_ext_qqbar"][::std::mem::align_of::<ca_ext_qqbar>() - 8usize];
    [
        "Offset of field: ca_ext_qqbar::x",
    ][::std::mem::offset_of!(ca_ext_qqbar, x) - 0usize];
    [
        "Offset of field: ca_ext_qqbar::nf",
    ][::std::mem::offset_of!(ca_ext_qqbar, nf) - 120usize];
};
#[repr(C)]
pub struct ca_ext_func_data {
    pub args: *mut ca_struct,
    pub nargs: slong,
    pub enclosure: acb_struct,
    pub prec: slong,
    pub qqbar: *mut qqbar_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_ext_func_data"][::std::mem::size_of::<ca_ext_func_data>() - 128usize];
    [
        "Alignment of ca_ext_func_data",
    ][::std::mem::align_of::<ca_ext_func_data>() - 8usize];
    [
        "Offset of field: ca_ext_func_data::args",
    ][::std::mem::offset_of!(ca_ext_func_data, args) - 0usize];
    [
        "Offset of field: ca_ext_func_data::nargs",
    ][::std::mem::offset_of!(ca_ext_func_data, nargs) - 8usize];
    [
        "Offset of field: ca_ext_func_data::enclosure",
    ][::std::mem::offset_of!(ca_ext_func_data, enclosure) - 16usize];
    [
        "Offset of field: ca_ext_func_data::prec",
    ][::std::mem::offset_of!(ca_ext_func_data, prec) - 112usize];
    [
        "Offset of field: ca_ext_func_data::qqbar",
    ][::std::mem::offset_of!(ca_ext_func_data, qqbar) - 120usize];
};
#[repr(C)]
pub struct ca_ext_struct {
    pub head: calcium_func_code,
    pub hash: ulong,
    pub depth: slong,
    pub data: ca_ext_struct__bindgen_ty_1,
}
#[repr(C)]
pub struct ca_ext_struct__bindgen_ty_1 {
    pub qqbar: __BindgenUnionField<ca_ext_qqbar>,
    pub func_data: __BindgenUnionField<ca_ext_func_data>,
    pub bindgen_union_field: [u64; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of ca_ext_struct__bindgen_ty_1",
    ][::std::mem::size_of::<ca_ext_struct__bindgen_ty_1>() - 128usize];
    [
        "Alignment of ca_ext_struct__bindgen_ty_1",
    ][::std::mem::align_of::<ca_ext_struct__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: ca_ext_struct__bindgen_ty_1::qqbar",
    ][::std::mem::offset_of!(ca_ext_struct__bindgen_ty_1, qqbar) - 0usize];
    [
        "Offset of field: ca_ext_struct__bindgen_ty_1::func_data",
    ][::std::mem::offset_of!(ca_ext_struct__bindgen_ty_1, func_data) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_ext_struct"][::std::mem::size_of::<ca_ext_struct>() - 152usize];
    ["Alignment of ca_ext_struct"][::std::mem::align_of::<ca_ext_struct>() - 8usize];
    [
        "Offset of field: ca_ext_struct::head",
    ][::std::mem::offset_of!(ca_ext_struct, head) - 0usize];
    [
        "Offset of field: ca_ext_struct::hash",
    ][::std::mem::offset_of!(ca_ext_struct, hash) - 8usize];
    [
        "Offset of field: ca_ext_struct::depth",
    ][::std::mem::offset_of!(ca_ext_struct, depth) - 16usize];
    [
        "Offset of field: ca_ext_struct::data",
    ][::std::mem::offset_of!(ca_ext_struct, data) - 24usize];
};
pub type ca_ext_t = [ca_ext_struct; 1usize];
pub type ca_ext_ptr = *mut ca_ext_struct;
pub type ca_ext_srcptr = *const ca_ext_struct;
#[repr(C)]
pub struct ca_ext_cache_struct {
    pub items: *mut *mut ca_ext_struct,
    pub length: slong,
    pub alloc: slong,
    pub hash_size: slong,
    pub hash_table: *mut slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of ca_ext_cache_struct",
    ][::std::mem::size_of::<ca_ext_cache_struct>() - 40usize];
    [
        "Alignment of ca_ext_cache_struct",
    ][::std::mem::align_of::<ca_ext_cache_struct>() - 8usize];
    [
        "Offset of field: ca_ext_cache_struct::items",
    ][::std::mem::offset_of!(ca_ext_cache_struct, items) - 0usize];
    [
        "Offset of field: ca_ext_cache_struct::length",
    ][::std::mem::offset_of!(ca_ext_cache_struct, length) - 8usize];
    [
        "Offset of field: ca_ext_cache_struct::alloc",
    ][::std::mem::offset_of!(ca_ext_cache_struct, alloc) - 16usize];
    [
        "Offset of field: ca_ext_cache_struct::hash_size",
    ][::std::mem::offset_of!(ca_ext_cache_struct, hash_size) - 24usize];
    [
        "Offset of field: ca_ext_cache_struct::hash_table",
    ][::std::mem::offset_of!(ca_ext_cache_struct, hash_table) - 32usize];
};
pub type ca_ext_cache_t = [ca_ext_cache_struct; 1usize];
#[repr(C)]
pub struct ca_field_struct {
    pub length: slong,
    pub ext: *mut *mut ca_ext_struct,
    pub ideal: fmpz_mpoly_vec_struct,
    pub hash: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_field_struct"][::std::mem::size_of::<ca_field_struct>() - 48usize];
    ["Alignment of ca_field_struct"][::std::mem::align_of::<ca_field_struct>() - 8usize];
    [
        "Offset of field: ca_field_struct::length",
    ][::std::mem::offset_of!(ca_field_struct, length) - 0usize];
    [
        "Offset of field: ca_field_struct::ext",
    ][::std::mem::offset_of!(ca_field_struct, ext) - 8usize];
    [
        "Offset of field: ca_field_struct::ideal",
    ][::std::mem::offset_of!(ca_field_struct, ideal) - 16usize];
    [
        "Offset of field: ca_field_struct::hash",
    ][::std::mem::offset_of!(ca_field_struct, hash) - 40usize];
};
pub type ca_field_t = [ca_field_struct; 1usize];
pub type ca_field_ptr = *mut ca_field_struct;
pub type ca_field_srcptr = *const ca_field_struct;
#[repr(C)]
pub struct ca_field_cache_struct {
    pub items: *mut *mut ca_field_struct,
    pub length: slong,
    pub alloc: slong,
    pub hash_size: slong,
    pub hash_table: *mut slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of ca_field_cache_struct",
    ][::std::mem::size_of::<ca_field_cache_struct>() - 40usize];
    [
        "Alignment of ca_field_cache_struct",
    ][::std::mem::align_of::<ca_field_cache_struct>() - 8usize];
    [
        "Offset of field: ca_field_cache_struct::items",
    ][::std::mem::offset_of!(ca_field_cache_struct, items) - 0usize];
    [
        "Offset of field: ca_field_cache_struct::length",
    ][::std::mem::offset_of!(ca_field_cache_struct, length) - 8usize];
    [
        "Offset of field: ca_field_cache_struct::alloc",
    ][::std::mem::offset_of!(ca_field_cache_struct, alloc) - 16usize];
    [
        "Offset of field: ca_field_cache_struct::hash_size",
    ][::std::mem::offset_of!(ca_field_cache_struct, hash_size) - 24usize];
    [
        "Offset of field: ca_field_cache_struct::hash_table",
    ][::std::mem::offset_of!(ca_field_cache_struct, hash_table) - 32usize];
};
pub type ca_field_cache_t = [ca_field_cache_struct; 1usize];
#[repr(C)]
pub struct ca_ctx_struct {
    pub ext_cache: ca_ext_cache_struct,
    pub field_cache: ca_field_cache_struct,
    pub field_qq: *mut ca_field_struct,
    pub field_qq_i: *mut ca_field_struct,
    pub mctx: *mut *mut fmpz_mpoly_ctx_struct,
    pub mctx_len: slong,
    pub options: *mut slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_ctx_struct"][::std::mem::size_of::<ca_ctx_struct>() - 120usize];
    ["Alignment of ca_ctx_struct"][::std::mem::align_of::<ca_ctx_struct>() - 8usize];
    [
        "Offset of field: ca_ctx_struct::ext_cache",
    ][::std::mem::offset_of!(ca_ctx_struct, ext_cache) - 0usize];
    [
        "Offset of field: ca_ctx_struct::field_cache",
    ][::std::mem::offset_of!(ca_ctx_struct, field_cache) - 40usize];
    [
        "Offset of field: ca_ctx_struct::field_qq",
    ][::std::mem::offset_of!(ca_ctx_struct, field_qq) - 80usize];
    [
        "Offset of field: ca_ctx_struct::field_qq_i",
    ][::std::mem::offset_of!(ca_ctx_struct, field_qq_i) - 88usize];
    [
        "Offset of field: ca_ctx_struct::mctx",
    ][::std::mem::offset_of!(ca_ctx_struct, mctx) - 96usize];
    [
        "Offset of field: ca_ctx_struct::mctx_len",
    ][::std::mem::offset_of!(ca_ctx_struct, mctx_len) - 104usize];
    [
        "Offset of field: ca_ctx_struct::options",
    ][::std::mem::offset_of!(ca_ctx_struct, options) - 112usize];
};
pub type ca_ctx_t = [ca_ctx_struct; 1usize];
#[repr(C)]
pub struct ca_factor_struct {
    pub base: ca_ptr,
    pub exp: ca_ptr,
    pub length: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_factor_struct"][::std::mem::size_of::<ca_factor_struct>() - 32usize];
    [
        "Alignment of ca_factor_struct",
    ][::std::mem::align_of::<ca_factor_struct>() - 8usize];
    [
        "Offset of field: ca_factor_struct::base",
    ][::std::mem::offset_of!(ca_factor_struct, base) - 0usize];
    [
        "Offset of field: ca_factor_struct::exp",
    ][::std::mem::offset_of!(ca_factor_struct, exp) - 8usize];
    [
        "Offset of field: ca_factor_struct::length",
    ][::std::mem::offset_of!(ca_factor_struct, length) - 16usize];
    [
        "Offset of field: ca_factor_struct::alloc",
    ][::std::mem::offset_of!(ca_factor_struct, alloc) - 24usize];
};
pub type ca_factor_t = [ca_factor_struct; 1usize];
#[repr(C)]
pub struct ca_vec_struct {
    pub entries: ca_ptr,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_vec_struct"][::std::mem::size_of::<ca_vec_struct>() - 24usize];
    ["Alignment of ca_vec_struct"][::std::mem::align_of::<ca_vec_struct>() - 8usize];
    [
        "Offset of field: ca_vec_struct::entries",
    ][::std::mem::offset_of!(ca_vec_struct, entries) - 0usize];
    [
        "Offset of field: ca_vec_struct::alloc",
    ][::std::mem::offset_of!(ca_vec_struct, alloc) - 8usize];
    [
        "Offset of field: ca_vec_struct::length",
    ][::std::mem::offset_of!(ca_vec_struct, length) - 16usize];
};
pub type ca_vec_t = [ca_vec_struct; 1usize];
#[repr(C)]
pub struct ca_mat_struct {
    pub entries: ca_ptr,
    pub r: slong,
    pub c: slong,
    pub rows: *mut ca_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_mat_struct"][::std::mem::size_of::<ca_mat_struct>() - 32usize];
    ["Alignment of ca_mat_struct"][::std::mem::align_of::<ca_mat_struct>() - 8usize];
    [
        "Offset of field: ca_mat_struct::entries",
    ][::std::mem::offset_of!(ca_mat_struct, entries) - 0usize];
    [
        "Offset of field: ca_mat_struct::r",
    ][::std::mem::offset_of!(ca_mat_struct, r) - 8usize];
    [
        "Offset of field: ca_mat_struct::c",
    ][::std::mem::offset_of!(ca_mat_struct, c) - 16usize];
    [
        "Offset of field: ca_mat_struct::rows",
    ][::std::mem::offset_of!(ca_mat_struct, rows) - 24usize];
};
pub type ca_mat_t = [ca_mat_struct; 1usize];
#[repr(C)]
pub struct ca_poly_struct {
    pub coeffs: *mut ca_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_poly_struct"][::std::mem::size_of::<ca_poly_struct>() - 24usize];
    ["Alignment of ca_poly_struct"][::std::mem::align_of::<ca_poly_struct>() - 8usize];
    [
        "Offset of field: ca_poly_struct::coeffs",
    ][::std::mem::offset_of!(ca_poly_struct, coeffs) - 0usize];
    [
        "Offset of field: ca_poly_struct::alloc",
    ][::std::mem::offset_of!(ca_poly_struct, alloc) - 8usize];
    [
        "Offset of field: ca_poly_struct::length",
    ][::std::mem::offset_of!(ca_poly_struct, length) - 16usize];
};
pub type ca_poly_t = [ca_poly_struct; 1usize];
pub const CA_OPT_VERBOSE: _bindgen_ty_17 = 0;
pub const CA_OPT_PRINT_FLAGS: _bindgen_ty_17 = 1;
pub const CA_OPT_MPOLY_ORD: _bindgen_ty_17 = 2;
pub const CA_OPT_PREC_LIMIT: _bindgen_ty_17 = 3;
pub const CA_OPT_QQBAR_DEG_LIMIT: _bindgen_ty_17 = 4;
pub const CA_OPT_LOW_PREC: _bindgen_ty_17 = 5;
pub const CA_OPT_SMOOTH_LIMIT: _bindgen_ty_17 = 6;
pub const CA_OPT_LLL_PREC: _bindgen_ty_17 = 7;
pub const CA_OPT_POW_LIMIT: _bindgen_ty_17 = 8;
pub const CA_OPT_USE_GROEBNER: _bindgen_ty_17 = 9;
pub const CA_OPT_GROEBNER_LENGTH_LIMIT: _bindgen_ty_17 = 10;
pub const CA_OPT_GROEBNER_POLY_LENGTH_LIMIT: _bindgen_ty_17 = 11;
pub const CA_OPT_GROEBNER_POLY_BITS_LIMIT: _bindgen_ty_17 = 12;
pub const CA_OPT_VIETA_LIMIT: _bindgen_ty_17 = 13;
pub const CA_OPT_TRIG_FORM: _bindgen_ty_17 = 14;
pub const CA_OPT_NUM_OPTIONS: _bindgen_ty_17 = 15;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
#[repr(C)]
pub struct ca_poly_vec_struct {
    pub entries: *mut ca_poly_struct,
    pub length: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of ca_poly_vec_struct",
    ][::std::mem::size_of::<ca_poly_vec_struct>() - 24usize];
    [
        "Alignment of ca_poly_vec_struct",
    ][::std::mem::align_of::<ca_poly_vec_struct>() - 8usize];
    [
        "Offset of field: ca_poly_vec_struct::entries",
    ][::std::mem::offset_of!(ca_poly_vec_struct, entries) - 0usize];
    [
        "Offset of field: ca_poly_vec_struct::length",
    ][::std::mem::offset_of!(ca_poly_vec_struct, length) - 8usize];
    [
        "Offset of field: ca_poly_vec_struct::alloc",
    ][::std::mem::offset_of!(ca_poly_vec_struct, alloc) - 16usize];
};
pub type ca_poly_vec_t = [ca_poly_vec_struct; 1usize];
#[repr(C)]
pub struct d_mat_struct {
    pub entries: *mut f64,
    pub r: slong,
    pub c: slong,
    pub rows: *mut *mut f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of d_mat_struct"][::std::mem::size_of::<d_mat_struct>() - 32usize];
    ["Alignment of d_mat_struct"][::std::mem::align_of::<d_mat_struct>() - 8usize];
    [
        "Offset of field: d_mat_struct::entries",
    ][::std::mem::offset_of!(d_mat_struct, entries) - 0usize];
    [
        "Offset of field: d_mat_struct::r",
    ][::std::mem::offset_of!(d_mat_struct, r) - 8usize];
    [
        "Offset of field: d_mat_struct::c",
    ][::std::mem::offset_of!(d_mat_struct, c) - 16usize];
    [
        "Offset of field: d_mat_struct::rows",
    ][::std::mem::offset_of!(d_mat_struct, rows) - 24usize];
};
pub type d_mat_t = [d_mat_struct; 1usize];
#[repr(C)]
pub struct double_uint64_u {
    pub f: __BindgenUnionField<f64>,
    pub i: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double_uint64_u"][::std::mem::size_of::<double_uint64_u>() - 8usize];
    ["Alignment of double_uint64_u"][::std::mem::align_of::<double_uint64_u>() - 8usize];
    [
        "Offset of field: double_uint64_u::f",
    ][::std::mem::offset_of!(double_uint64_u, f) - 0usize];
    [
        "Offset of field: double_uint64_u::i",
    ][::std::mem::offset_of!(double_uint64_u, i) - 0usize];
};
#[repr(C)]
pub struct di_t {
    pub a: f64,
    pub b: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of di_t"][::std::mem::size_of::<di_t>() - 16usize];
    ["Alignment of di_t"][::std::mem::align_of::<di_t>() - 8usize];
    ["Offset of field: di_t::a"][::std::mem::offset_of!(di_t, a) - 0usize];
    ["Offset of field: di_t::b"][::std::mem::offset_of!(di_t, b) - 8usize];
};
pub const fexpr_builtin_symbol_FEXPR_AGM: fexpr_builtin_symbol = 0;
pub const fexpr_builtin_symbol_FEXPR_AGMSequence: fexpr_builtin_symbol = 1;
pub const fexpr_builtin_symbol_FEXPR_Abs: fexpr_builtin_symbol = 2;
pub const fexpr_builtin_symbol_FEXPR_Acos: fexpr_builtin_symbol = 3;
pub const fexpr_builtin_symbol_FEXPR_Acosh: fexpr_builtin_symbol = 4;
pub const fexpr_builtin_symbol_FEXPR_Acot: fexpr_builtin_symbol = 5;
pub const fexpr_builtin_symbol_FEXPR_Acoth: fexpr_builtin_symbol = 6;
pub const fexpr_builtin_symbol_FEXPR_Acsc: fexpr_builtin_symbol = 7;
pub const fexpr_builtin_symbol_FEXPR_Acsch: fexpr_builtin_symbol = 8;
pub const fexpr_builtin_symbol_FEXPR_Add: fexpr_builtin_symbol = 9;
pub const fexpr_builtin_symbol_FEXPR_AiryAi: fexpr_builtin_symbol = 10;
pub const fexpr_builtin_symbol_FEXPR_AiryAiZero: fexpr_builtin_symbol = 11;
pub const fexpr_builtin_symbol_FEXPR_AiryBi: fexpr_builtin_symbol = 12;
pub const fexpr_builtin_symbol_FEXPR_AiryBiZero: fexpr_builtin_symbol = 13;
pub const fexpr_builtin_symbol_FEXPR_AlgebraicNumberSerialized: fexpr_builtin_symbol = 14;
pub const fexpr_builtin_symbol_FEXPR_AlgebraicNumbers: fexpr_builtin_symbol = 15;
pub const fexpr_builtin_symbol_FEXPR_All: fexpr_builtin_symbol = 16;
pub const fexpr_builtin_symbol_FEXPR_AnalyticContinuation: fexpr_builtin_symbol = 17;
pub const fexpr_builtin_symbol_FEXPR_And: fexpr_builtin_symbol = 18;
pub const fexpr_builtin_symbol_FEXPR_AngleBrackets: fexpr_builtin_symbol = 19;
pub const fexpr_builtin_symbol_FEXPR_Approximation: fexpr_builtin_symbol = 20;
pub const fexpr_builtin_symbol_FEXPR_Arg: fexpr_builtin_symbol = 21;
pub const fexpr_builtin_symbol_FEXPR_ArgMax: fexpr_builtin_symbol = 22;
pub const fexpr_builtin_symbol_FEXPR_ArgMaxUnique: fexpr_builtin_symbol = 23;
pub const fexpr_builtin_symbol_FEXPR_ArgMin: fexpr_builtin_symbol = 24;
pub const fexpr_builtin_symbol_FEXPR_ArgMinUnique: fexpr_builtin_symbol = 25;
pub const fexpr_builtin_symbol_FEXPR_Asec: fexpr_builtin_symbol = 26;
pub const fexpr_builtin_symbol_FEXPR_Asech: fexpr_builtin_symbol = 27;
pub const fexpr_builtin_symbol_FEXPR_Asin: fexpr_builtin_symbol = 28;
pub const fexpr_builtin_symbol_FEXPR_Asinh: fexpr_builtin_symbol = 29;
pub const fexpr_builtin_symbol_FEXPR_AsymptoticTo: fexpr_builtin_symbol = 30;
pub const fexpr_builtin_symbol_FEXPR_Atan: fexpr_builtin_symbol = 31;
pub const fexpr_builtin_symbol_FEXPR_Atan2: fexpr_builtin_symbol = 32;
pub const fexpr_builtin_symbol_FEXPR_Atanh: fexpr_builtin_symbol = 33;
pub const fexpr_builtin_symbol_FEXPR_BarnesG: fexpr_builtin_symbol = 34;
pub const fexpr_builtin_symbol_FEXPR_BellNumber: fexpr_builtin_symbol = 35;
pub const fexpr_builtin_symbol_FEXPR_BernoulliB: fexpr_builtin_symbol = 36;
pub const fexpr_builtin_symbol_FEXPR_BernoulliPolynomial: fexpr_builtin_symbol = 37;
pub const fexpr_builtin_symbol_FEXPR_BernsteinEllipse: fexpr_builtin_symbol = 38;
pub const fexpr_builtin_symbol_FEXPR_BesselI: fexpr_builtin_symbol = 39;
pub const fexpr_builtin_symbol_FEXPR_BesselJ: fexpr_builtin_symbol = 40;
pub const fexpr_builtin_symbol_FEXPR_BesselJZero: fexpr_builtin_symbol = 41;
pub const fexpr_builtin_symbol_FEXPR_BesselK: fexpr_builtin_symbol = 42;
pub const fexpr_builtin_symbol_FEXPR_BesselY: fexpr_builtin_symbol = 43;
pub const fexpr_builtin_symbol_FEXPR_BesselYZero: fexpr_builtin_symbol = 44;
pub const fexpr_builtin_symbol_FEXPR_BetaFunction: fexpr_builtin_symbol = 45;
pub const fexpr_builtin_symbol_FEXPR_Binomial: fexpr_builtin_symbol = 46;
pub const fexpr_builtin_symbol_FEXPR_Braces: fexpr_builtin_symbol = 47;
pub const fexpr_builtin_symbol_FEXPR_Brackets: fexpr_builtin_symbol = 48;
pub const fexpr_builtin_symbol_FEXPR_CC: fexpr_builtin_symbol = 49;
pub const fexpr_builtin_symbol_FEXPR_Call: fexpr_builtin_symbol = 50;
pub const fexpr_builtin_symbol_FEXPR_CallIndeterminate: fexpr_builtin_symbol = 51;
pub const fexpr_builtin_symbol_FEXPR_Cardinality: fexpr_builtin_symbol = 52;
pub const fexpr_builtin_symbol_FEXPR_CarlsonHypergeometricR: fexpr_builtin_symbol = 53;
pub const fexpr_builtin_symbol_FEXPR_CarlsonHypergeometricT: fexpr_builtin_symbol = 54;
pub const fexpr_builtin_symbol_FEXPR_CarlsonRC: fexpr_builtin_symbol = 55;
pub const fexpr_builtin_symbol_FEXPR_CarlsonRD: fexpr_builtin_symbol = 56;
pub const fexpr_builtin_symbol_FEXPR_CarlsonRF: fexpr_builtin_symbol = 57;
pub const fexpr_builtin_symbol_FEXPR_CarlsonRG: fexpr_builtin_symbol = 58;
pub const fexpr_builtin_symbol_FEXPR_CarlsonRJ: fexpr_builtin_symbol = 59;
pub const fexpr_builtin_symbol_FEXPR_CartesianPower: fexpr_builtin_symbol = 60;
pub const fexpr_builtin_symbol_FEXPR_CartesianProduct: fexpr_builtin_symbol = 61;
pub const fexpr_builtin_symbol_FEXPR_Case: fexpr_builtin_symbol = 62;
pub const fexpr_builtin_symbol_FEXPR_Cases: fexpr_builtin_symbol = 63;
pub const fexpr_builtin_symbol_FEXPR_CatalanConstant: fexpr_builtin_symbol = 64;
pub const fexpr_builtin_symbol_FEXPR_Ceil: fexpr_builtin_symbol = 65;
pub const fexpr_builtin_symbol_FEXPR_Characteristic: fexpr_builtin_symbol = 66;
pub const fexpr_builtin_symbol_FEXPR_ChebyshevT: fexpr_builtin_symbol = 67;
pub const fexpr_builtin_symbol_FEXPR_ChebyshevU: fexpr_builtin_symbol = 68;
pub const fexpr_builtin_symbol_FEXPR_ClosedComplexDisk: fexpr_builtin_symbol = 69;
pub const fexpr_builtin_symbol_FEXPR_ClosedOpenInterval: fexpr_builtin_symbol = 70;
pub const fexpr_builtin_symbol_FEXPR_Coefficient: fexpr_builtin_symbol = 71;
pub const fexpr_builtin_symbol_FEXPR_Column: fexpr_builtin_symbol = 72;
pub const fexpr_builtin_symbol_FEXPR_ColumnMatrix: fexpr_builtin_symbol = 73;
pub const fexpr_builtin_symbol_FEXPR_CommutativeRings: fexpr_builtin_symbol = 74;
pub const fexpr_builtin_symbol_FEXPR_ComplexBranchDerivative: fexpr_builtin_symbol = 75;
pub const fexpr_builtin_symbol_FEXPR_ComplexDerivative: fexpr_builtin_symbol = 76;
pub const fexpr_builtin_symbol_FEXPR_ComplexInfinities: fexpr_builtin_symbol = 77;
pub const fexpr_builtin_symbol_FEXPR_ComplexLimit: fexpr_builtin_symbol = 78;
pub const fexpr_builtin_symbol_FEXPR_ComplexSignedInfinities: fexpr_builtin_symbol = 79;
pub const fexpr_builtin_symbol_FEXPR_ComplexSingularityClosure: fexpr_builtin_symbol = 80;
pub const fexpr_builtin_symbol_FEXPR_ComplexZeroMultiplicity: fexpr_builtin_symbol = 81;
pub const fexpr_builtin_symbol_FEXPR_Concatenation: fexpr_builtin_symbol = 82;
pub const fexpr_builtin_symbol_FEXPR_CongruentMod: fexpr_builtin_symbol = 83;
pub const fexpr_builtin_symbol_FEXPR_Conjugate: fexpr_builtin_symbol = 84;
pub const fexpr_builtin_symbol_FEXPR_ConreyGenerator: fexpr_builtin_symbol = 85;
pub const fexpr_builtin_symbol_FEXPR_Cos: fexpr_builtin_symbol = 86;
pub const fexpr_builtin_symbol_FEXPR_CosIntegral: fexpr_builtin_symbol = 87;
pub const fexpr_builtin_symbol_FEXPR_Cosh: fexpr_builtin_symbol = 88;
pub const fexpr_builtin_symbol_FEXPR_CoshIntegral: fexpr_builtin_symbol = 89;
pub const fexpr_builtin_symbol_FEXPR_Cot: fexpr_builtin_symbol = 90;
pub const fexpr_builtin_symbol_FEXPR_Coth: fexpr_builtin_symbol = 91;
pub const fexpr_builtin_symbol_FEXPR_CoulombC: fexpr_builtin_symbol = 92;
pub const fexpr_builtin_symbol_FEXPR_CoulombF: fexpr_builtin_symbol = 93;
pub const fexpr_builtin_symbol_FEXPR_CoulombG: fexpr_builtin_symbol = 94;
pub const fexpr_builtin_symbol_FEXPR_CoulombH: fexpr_builtin_symbol = 95;
pub const fexpr_builtin_symbol_FEXPR_CoulombSigma: fexpr_builtin_symbol = 96;
pub const fexpr_builtin_symbol_FEXPR_Csc: fexpr_builtin_symbol = 97;
pub const fexpr_builtin_symbol_FEXPR_Csch: fexpr_builtin_symbol = 98;
pub const fexpr_builtin_symbol_FEXPR_Csgn: fexpr_builtin_symbol = 99;
pub const fexpr_builtin_symbol_FEXPR_CurvePath: fexpr_builtin_symbol = 100;
pub const fexpr_builtin_symbol_FEXPR_Cyclotomic: fexpr_builtin_symbol = 101;
pub const fexpr_builtin_symbol_FEXPR_Decimal: fexpr_builtin_symbol = 102;
pub const fexpr_builtin_symbol_FEXPR_DedekindEta: fexpr_builtin_symbol = 103;
pub const fexpr_builtin_symbol_FEXPR_DedekindEtaEpsilon: fexpr_builtin_symbol = 104;
pub const fexpr_builtin_symbol_FEXPR_DedekindSum: fexpr_builtin_symbol = 105;
pub const fexpr_builtin_symbol_FEXPR_Def: fexpr_builtin_symbol = 106;
pub const fexpr_builtin_symbol_FEXPR_Delta: fexpr_builtin_symbol = 107;
pub const fexpr_builtin_symbol_FEXPR_Delta_: fexpr_builtin_symbol = 108;
pub const fexpr_builtin_symbol_FEXPR_Derivative: fexpr_builtin_symbol = 109;
pub const fexpr_builtin_symbol_FEXPR_Det: fexpr_builtin_symbol = 110;
pub const fexpr_builtin_symbol_FEXPR_DiagonalMatrix: fexpr_builtin_symbol = 111;
pub const fexpr_builtin_symbol_FEXPR_DigammaFunction: fexpr_builtin_symbol = 112;
pub const fexpr_builtin_symbol_FEXPR_DigammaFunctionZero: fexpr_builtin_symbol = 113;
pub const fexpr_builtin_symbol_FEXPR_DirichletCharacter: fexpr_builtin_symbol = 114;
pub const fexpr_builtin_symbol_FEXPR_DirichletGroup: fexpr_builtin_symbol = 115;
pub const fexpr_builtin_symbol_FEXPR_DirichletL: fexpr_builtin_symbol = 116;
pub const fexpr_builtin_symbol_FEXPR_DirichletLZero: fexpr_builtin_symbol = 117;
pub const fexpr_builtin_symbol_FEXPR_DirichletLambda: fexpr_builtin_symbol = 118;
pub const fexpr_builtin_symbol_FEXPR_DiscreteLog: fexpr_builtin_symbol = 119;
pub const fexpr_builtin_symbol_FEXPR_Div: fexpr_builtin_symbol = 120;
pub const fexpr_builtin_symbol_FEXPR_Divides: fexpr_builtin_symbol = 121;
pub const fexpr_builtin_symbol_FEXPR_DivisorProduct: fexpr_builtin_symbol = 122;
pub const fexpr_builtin_symbol_FEXPR_DivisorSigma: fexpr_builtin_symbol = 123;
pub const fexpr_builtin_symbol_FEXPR_DivisorSum: fexpr_builtin_symbol = 124;
pub const fexpr_builtin_symbol_FEXPR_DoubleFactorial: fexpr_builtin_symbol = 125;
pub const fexpr_builtin_symbol_FEXPR_EisensteinE: fexpr_builtin_symbol = 126;
pub const fexpr_builtin_symbol_FEXPR_EisensteinG: fexpr_builtin_symbol = 127;
pub const fexpr_builtin_symbol_FEXPR_Element: fexpr_builtin_symbol = 128;
pub const fexpr_builtin_symbol_FEXPR_Ellipsis: fexpr_builtin_symbol = 129;
pub const fexpr_builtin_symbol_FEXPR_EllipticE: fexpr_builtin_symbol = 130;
pub const fexpr_builtin_symbol_FEXPR_EllipticK: fexpr_builtin_symbol = 131;
pub const fexpr_builtin_symbol_FEXPR_EllipticPi: fexpr_builtin_symbol = 132;
pub const fexpr_builtin_symbol_FEXPR_EllipticRootE: fexpr_builtin_symbol = 133;
pub const fexpr_builtin_symbol_FEXPR_Enclosure: fexpr_builtin_symbol = 134;
pub const fexpr_builtin_symbol_FEXPR_Equal: fexpr_builtin_symbol = 135;
pub const fexpr_builtin_symbol_FEXPR_EqualAndElement: fexpr_builtin_symbol = 136;
pub const fexpr_builtin_symbol_FEXPR_EqualNearestDecimal: fexpr_builtin_symbol = 137;
pub const fexpr_builtin_symbol_FEXPR_EqualQSeriesEllipsis: fexpr_builtin_symbol = 138;
pub const fexpr_builtin_symbol_FEXPR_Equivalent: fexpr_builtin_symbol = 139;
pub const fexpr_builtin_symbol_FEXPR_Erf: fexpr_builtin_symbol = 140;
pub const fexpr_builtin_symbol_FEXPR_Erfc: fexpr_builtin_symbol = 141;
pub const fexpr_builtin_symbol_FEXPR_Erfi: fexpr_builtin_symbol = 142;
pub const fexpr_builtin_symbol_FEXPR_Euler: fexpr_builtin_symbol = 143;
pub const fexpr_builtin_symbol_FEXPR_EulerE: fexpr_builtin_symbol = 144;
pub const fexpr_builtin_symbol_FEXPR_EulerPhi: fexpr_builtin_symbol = 145;
pub const fexpr_builtin_symbol_FEXPR_EulerPolynomial: fexpr_builtin_symbol = 146;
pub const fexpr_builtin_symbol_FEXPR_EulerQSeries: fexpr_builtin_symbol = 147;
pub const fexpr_builtin_symbol_FEXPR_Exists: fexpr_builtin_symbol = 148;
pub const fexpr_builtin_symbol_FEXPR_Exp: fexpr_builtin_symbol = 149;
pub const fexpr_builtin_symbol_FEXPR_ExpIntegralE: fexpr_builtin_symbol = 150;
pub const fexpr_builtin_symbol_FEXPR_ExpIntegralEi: fexpr_builtin_symbol = 151;
pub const fexpr_builtin_symbol_FEXPR_ExtendedRealNumbers: fexpr_builtin_symbol = 152;
pub const fexpr_builtin_symbol_FEXPR_Factorial: fexpr_builtin_symbol = 153;
pub const fexpr_builtin_symbol_FEXPR_FallingFactorial: fexpr_builtin_symbol = 154;
pub const fexpr_builtin_symbol_FEXPR_False: fexpr_builtin_symbol = 155;
pub const fexpr_builtin_symbol_FEXPR_Fibonacci: fexpr_builtin_symbol = 156;
pub const fexpr_builtin_symbol_FEXPR_Fields: fexpr_builtin_symbol = 157;
pub const fexpr_builtin_symbol_FEXPR_FiniteField: fexpr_builtin_symbol = 158;
pub const fexpr_builtin_symbol_FEXPR_Floor: fexpr_builtin_symbol = 159;
pub const fexpr_builtin_symbol_FEXPR_For: fexpr_builtin_symbol = 160;
pub const fexpr_builtin_symbol_FEXPR_FormalLaurentSeries: fexpr_builtin_symbol = 161;
pub const fexpr_builtin_symbol_FEXPR_FormalPowerSeries: fexpr_builtin_symbol = 162;
pub const fexpr_builtin_symbol_FEXPR_FormalPuiseuxSeries: fexpr_builtin_symbol = 163;
pub const fexpr_builtin_symbol_FEXPR_FresnelC: fexpr_builtin_symbol = 164;
pub const fexpr_builtin_symbol_FEXPR_FresnelS: fexpr_builtin_symbol = 165;
pub const fexpr_builtin_symbol_FEXPR_Fun: fexpr_builtin_symbol = 166;
pub const fexpr_builtin_symbol_FEXPR_GCD: fexpr_builtin_symbol = 167;
pub const fexpr_builtin_symbol_FEXPR_Gamma: fexpr_builtin_symbol = 168;
pub const fexpr_builtin_symbol_FEXPR_GaussLegendreWeight: fexpr_builtin_symbol = 169;
pub const fexpr_builtin_symbol_FEXPR_GaussSum: fexpr_builtin_symbol = 170;
pub const fexpr_builtin_symbol_FEXPR_GegenbauerC: fexpr_builtin_symbol = 171;
pub const fexpr_builtin_symbol_FEXPR_GeneralLinearGroup: fexpr_builtin_symbol = 172;
pub const fexpr_builtin_symbol_FEXPR_GeneralizedBernoulliB: fexpr_builtin_symbol = 173;
pub const fexpr_builtin_symbol_FEXPR_GeneralizedRiemannHypothesis: fexpr_builtin_symbol = 174;
pub const fexpr_builtin_symbol_FEXPR_GlaisherConstant: fexpr_builtin_symbol = 175;
pub const fexpr_builtin_symbol_FEXPR_GoldenRatio: fexpr_builtin_symbol = 176;
pub const fexpr_builtin_symbol_FEXPR_Greater: fexpr_builtin_symbol = 177;
pub const fexpr_builtin_symbol_FEXPR_GreaterEqual: fexpr_builtin_symbol = 178;
pub const fexpr_builtin_symbol_FEXPR_GreekGamma: fexpr_builtin_symbol = 179;
pub const fexpr_builtin_symbol_FEXPR_GreekGamma_: fexpr_builtin_symbol = 180;
pub const fexpr_builtin_symbol_FEXPR_GreekPi: fexpr_builtin_symbol = 181;
pub const fexpr_builtin_symbol_FEXPR_GreekPi_: fexpr_builtin_symbol = 182;
pub const fexpr_builtin_symbol_FEXPR_Guess: fexpr_builtin_symbol = 183;
pub const fexpr_builtin_symbol_FEXPR_HankelH1: fexpr_builtin_symbol = 184;
pub const fexpr_builtin_symbol_FEXPR_HankelH2: fexpr_builtin_symbol = 185;
pub const fexpr_builtin_symbol_FEXPR_HarmonicNumber: fexpr_builtin_symbol = 186;
pub const fexpr_builtin_symbol_FEXPR_HermiteH: fexpr_builtin_symbol = 187;
pub const fexpr_builtin_symbol_FEXPR_HilbertClassPolynomial: fexpr_builtin_symbol = 188;
pub const fexpr_builtin_symbol_FEXPR_HilbertMatrix: fexpr_builtin_symbol = 189;
pub const fexpr_builtin_symbol_FEXPR_HurwitzZeta: fexpr_builtin_symbol = 190;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric0F1: fexpr_builtin_symbol = 191;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric0F1Regularized: fexpr_builtin_symbol = 192;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric1F1: fexpr_builtin_symbol = 193;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric1F1Regularized: fexpr_builtin_symbol = 194;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric1F2: fexpr_builtin_symbol = 195;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric1F2Regularized: fexpr_builtin_symbol = 196;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric2F0: fexpr_builtin_symbol = 197;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric2F1: fexpr_builtin_symbol = 198;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric2F1Regularized: fexpr_builtin_symbol = 199;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric2F2: fexpr_builtin_symbol = 200;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric2F2Regularized: fexpr_builtin_symbol = 201;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric3F2: fexpr_builtin_symbol = 202;
pub const fexpr_builtin_symbol_FEXPR_Hypergeometric3F2Regularized: fexpr_builtin_symbol = 203;
pub const fexpr_builtin_symbol_FEXPR_HypergeometricU: fexpr_builtin_symbol = 204;
pub const fexpr_builtin_symbol_FEXPR_HypergeometricUStar: fexpr_builtin_symbol = 205;
pub const fexpr_builtin_symbol_FEXPR_HypergeometricUStarRemainder: fexpr_builtin_symbol = 206;
pub const fexpr_builtin_symbol_FEXPR_IdentityMatrix: fexpr_builtin_symbol = 207;
pub const fexpr_builtin_symbol_FEXPR_Im: fexpr_builtin_symbol = 208;
pub const fexpr_builtin_symbol_FEXPR_Implies: fexpr_builtin_symbol = 209;
pub const fexpr_builtin_symbol_FEXPR_IncompleteBeta: fexpr_builtin_symbol = 210;
pub const fexpr_builtin_symbol_FEXPR_IncompleteBetaRegularized: fexpr_builtin_symbol = 211;
pub const fexpr_builtin_symbol_FEXPR_IncompleteEllipticE: fexpr_builtin_symbol = 212;
pub const fexpr_builtin_symbol_FEXPR_IncompleteEllipticF: fexpr_builtin_symbol = 213;
pub const fexpr_builtin_symbol_FEXPR_IncompleteEllipticPi: fexpr_builtin_symbol = 214;
pub const fexpr_builtin_symbol_FEXPR_IndefiniteIntegralEqual: fexpr_builtin_symbol = 215;
pub const fexpr_builtin_symbol_FEXPR_Infimum: fexpr_builtin_symbol = 216;
pub const fexpr_builtin_symbol_FEXPR_Infinity: fexpr_builtin_symbol = 217;
pub const fexpr_builtin_symbol_FEXPR_IntegersGreaterEqual: fexpr_builtin_symbol = 218;
pub const fexpr_builtin_symbol_FEXPR_IntegersLessEqual: fexpr_builtin_symbol = 219;
pub const fexpr_builtin_symbol_FEXPR_Integral: fexpr_builtin_symbol = 220;
pub const fexpr_builtin_symbol_FEXPR_Intersection: fexpr_builtin_symbol = 221;
pub const fexpr_builtin_symbol_FEXPR_Interval: fexpr_builtin_symbol = 222;
pub const fexpr_builtin_symbol_FEXPR_IsEven: fexpr_builtin_symbol = 223;
pub const fexpr_builtin_symbol_FEXPR_IsHolomorphicOn: fexpr_builtin_symbol = 224;
pub const fexpr_builtin_symbol_FEXPR_IsMeromorphicOn: fexpr_builtin_symbol = 225;
pub const fexpr_builtin_symbol_FEXPR_IsOdd: fexpr_builtin_symbol = 226;
pub const fexpr_builtin_symbol_FEXPR_IsPrime: fexpr_builtin_symbol = 227;
pub const fexpr_builtin_symbol_FEXPR_Item: fexpr_builtin_symbol = 228;
pub const fexpr_builtin_symbol_FEXPR_JacobiP: fexpr_builtin_symbol = 229;
pub const fexpr_builtin_symbol_FEXPR_JacobiSymbol: fexpr_builtin_symbol = 230;
pub const fexpr_builtin_symbol_FEXPR_JacobiTheta: fexpr_builtin_symbol = 231;
pub const fexpr_builtin_symbol_FEXPR_JacobiThetaEpsilon: fexpr_builtin_symbol = 232;
pub const fexpr_builtin_symbol_FEXPR_JacobiThetaPermutation: fexpr_builtin_symbol = 233;
pub const fexpr_builtin_symbol_FEXPR_JacobiThetaQ: fexpr_builtin_symbol = 234;
pub const fexpr_builtin_symbol_FEXPR_KeiperLiLambda: fexpr_builtin_symbol = 235;
pub const fexpr_builtin_symbol_FEXPR_KhinchinConstant: fexpr_builtin_symbol = 236;
pub const fexpr_builtin_symbol_FEXPR_KroneckerDelta: fexpr_builtin_symbol = 237;
pub const fexpr_builtin_symbol_FEXPR_KroneckerSymbol: fexpr_builtin_symbol = 238;
pub const fexpr_builtin_symbol_FEXPR_LCM: fexpr_builtin_symbol = 239;
pub const fexpr_builtin_symbol_FEXPR_LaguerreL: fexpr_builtin_symbol = 240;
pub const fexpr_builtin_symbol_FEXPR_LambertW: fexpr_builtin_symbol = 241;
pub const fexpr_builtin_symbol_FEXPR_Lamda: fexpr_builtin_symbol = 242;
pub const fexpr_builtin_symbol_FEXPR_Lamda_: fexpr_builtin_symbol = 243;
pub const fexpr_builtin_symbol_FEXPR_LandauG: fexpr_builtin_symbol = 244;
pub const fexpr_builtin_symbol_FEXPR_Lattice: fexpr_builtin_symbol = 245;
pub const fexpr_builtin_symbol_FEXPR_LeftLimit: fexpr_builtin_symbol = 246;
pub const fexpr_builtin_symbol_FEXPR_LegendreP: fexpr_builtin_symbol = 247;
pub const fexpr_builtin_symbol_FEXPR_LegendrePolynomialZero: fexpr_builtin_symbol = 248;
pub const fexpr_builtin_symbol_FEXPR_LegendreSymbol: fexpr_builtin_symbol = 249;
pub const fexpr_builtin_symbol_FEXPR_Length: fexpr_builtin_symbol = 250;
pub const fexpr_builtin_symbol_FEXPR_LerchPhi: fexpr_builtin_symbol = 251;
pub const fexpr_builtin_symbol_FEXPR_Less: fexpr_builtin_symbol = 252;
pub const fexpr_builtin_symbol_FEXPR_LessEqual: fexpr_builtin_symbol = 253;
pub const fexpr_builtin_symbol_FEXPR_Limit: fexpr_builtin_symbol = 254;
pub const fexpr_builtin_symbol_FEXPR_LiouvilleLambda: fexpr_builtin_symbol = 255;
pub const fexpr_builtin_symbol_FEXPR_List: fexpr_builtin_symbol = 256;
pub const fexpr_builtin_symbol_FEXPR_Log: fexpr_builtin_symbol = 257;
pub const fexpr_builtin_symbol_FEXPR_LogBarnesG: fexpr_builtin_symbol = 258;
pub const fexpr_builtin_symbol_FEXPR_LogBarnesGRemainder: fexpr_builtin_symbol = 259;
pub const fexpr_builtin_symbol_FEXPR_LogGamma: fexpr_builtin_symbol = 260;
pub const fexpr_builtin_symbol_FEXPR_LogIntegral: fexpr_builtin_symbol = 261;
pub const fexpr_builtin_symbol_FEXPR_Logic: fexpr_builtin_symbol = 262;
pub const fexpr_builtin_symbol_FEXPR_LowerGamma: fexpr_builtin_symbol = 263;
pub const fexpr_builtin_symbol_FEXPR_Matrices: fexpr_builtin_symbol = 264;
pub const fexpr_builtin_symbol_FEXPR_Matrix: fexpr_builtin_symbol = 265;
pub const fexpr_builtin_symbol_FEXPR_Matrix2x2: fexpr_builtin_symbol = 266;
pub const fexpr_builtin_symbol_FEXPR_Max: fexpr_builtin_symbol = 267;
pub const fexpr_builtin_symbol_FEXPR_Maximum: fexpr_builtin_symbol = 268;
pub const fexpr_builtin_symbol_FEXPR_MeromorphicDerivative: fexpr_builtin_symbol = 269;
pub const fexpr_builtin_symbol_FEXPR_MeromorphicLimit: fexpr_builtin_symbol = 270;
pub const fexpr_builtin_symbol_FEXPR_Min: fexpr_builtin_symbol = 271;
pub const fexpr_builtin_symbol_FEXPR_Minimum: fexpr_builtin_symbol = 272;
pub const fexpr_builtin_symbol_FEXPR_Mod: fexpr_builtin_symbol = 273;
pub const fexpr_builtin_symbol_FEXPR_ModularGroupAction: fexpr_builtin_symbol = 274;
pub const fexpr_builtin_symbol_FEXPR_ModularGroupFundamentalDomain: fexpr_builtin_symbol = 275;
pub const fexpr_builtin_symbol_FEXPR_ModularJ: fexpr_builtin_symbol = 276;
pub const fexpr_builtin_symbol_FEXPR_ModularLambda: fexpr_builtin_symbol = 277;
pub const fexpr_builtin_symbol_FEXPR_ModularLambdaFundamentalDomain: fexpr_builtin_symbol = 278;
pub const fexpr_builtin_symbol_FEXPR_MoebiusMu: fexpr_builtin_symbol = 279;
pub const fexpr_builtin_symbol_FEXPR_Mul: fexpr_builtin_symbol = 280;
pub const fexpr_builtin_symbol_FEXPR_MultiZetaValue: fexpr_builtin_symbol = 281;
pub const fexpr_builtin_symbol_FEXPR_NN: fexpr_builtin_symbol = 282;
pub const fexpr_builtin_symbol_FEXPR_Neg: fexpr_builtin_symbol = 283;
pub const fexpr_builtin_symbol_FEXPR_Not: fexpr_builtin_symbol = 284;
pub const fexpr_builtin_symbol_FEXPR_NotElement: fexpr_builtin_symbol = 285;
pub const fexpr_builtin_symbol_FEXPR_NotEqual: fexpr_builtin_symbol = 286;
pub const fexpr_builtin_symbol_FEXPR_NumberE: fexpr_builtin_symbol = 287;
pub const fexpr_builtin_symbol_FEXPR_NumberI: fexpr_builtin_symbol = 288;
pub const fexpr_builtin_symbol_FEXPR_Omega: fexpr_builtin_symbol = 289;
pub const fexpr_builtin_symbol_FEXPR_Omega_: fexpr_builtin_symbol = 290;
pub const fexpr_builtin_symbol_FEXPR_One: fexpr_builtin_symbol = 291;
pub const fexpr_builtin_symbol_FEXPR_OpenClosedInterval: fexpr_builtin_symbol = 292;
pub const fexpr_builtin_symbol_FEXPR_OpenComplexDisk: fexpr_builtin_symbol = 293;
pub const fexpr_builtin_symbol_FEXPR_OpenInterval: fexpr_builtin_symbol = 294;
pub const fexpr_builtin_symbol_FEXPR_OpenRealBall: fexpr_builtin_symbol = 295;
pub const fexpr_builtin_symbol_FEXPR_Or: fexpr_builtin_symbol = 296;
pub const fexpr_builtin_symbol_FEXPR_Otherwise: fexpr_builtin_symbol = 297;
pub const fexpr_builtin_symbol_FEXPR_PSL2Z: fexpr_builtin_symbol = 298;
pub const fexpr_builtin_symbol_FEXPR_Parentheses: fexpr_builtin_symbol = 299;
pub const fexpr_builtin_symbol_FEXPR_PartitionsP: fexpr_builtin_symbol = 300;
pub const fexpr_builtin_symbol_FEXPR_Path: fexpr_builtin_symbol = 301;
pub const fexpr_builtin_symbol_FEXPR_Phi: fexpr_builtin_symbol = 302;
pub const fexpr_builtin_symbol_FEXPR_Phi_: fexpr_builtin_symbol = 303;
pub const fexpr_builtin_symbol_FEXPR_Pi: fexpr_builtin_symbol = 304;
pub const fexpr_builtin_symbol_FEXPR_Pol: fexpr_builtin_symbol = 305;
pub const fexpr_builtin_symbol_FEXPR_Poles: fexpr_builtin_symbol = 306;
pub const fexpr_builtin_symbol_FEXPR_PolyLog: fexpr_builtin_symbol = 307;
pub const fexpr_builtin_symbol_FEXPR_Polynomial: fexpr_builtin_symbol = 308;
pub const fexpr_builtin_symbol_FEXPR_PolynomialDegree: fexpr_builtin_symbol = 309;
pub const fexpr_builtin_symbol_FEXPR_PolynomialFractions: fexpr_builtin_symbol = 310;
pub const fexpr_builtin_symbol_FEXPR_PolynomialRootIndexed: fexpr_builtin_symbol = 311;
pub const fexpr_builtin_symbol_FEXPR_PolynomialRootNearest: fexpr_builtin_symbol = 312;
pub const fexpr_builtin_symbol_FEXPR_Polynomials: fexpr_builtin_symbol = 313;
pub const fexpr_builtin_symbol_FEXPR_Pos: fexpr_builtin_symbol = 314;
pub const fexpr_builtin_symbol_FEXPR_Pow: fexpr_builtin_symbol = 315;
pub const fexpr_builtin_symbol_FEXPR_Prime: fexpr_builtin_symbol = 316;
pub const fexpr_builtin_symbol_FEXPR_PrimePi: fexpr_builtin_symbol = 317;
pub const fexpr_builtin_symbol_FEXPR_PrimeProduct: fexpr_builtin_symbol = 318;
pub const fexpr_builtin_symbol_FEXPR_PrimeSum: fexpr_builtin_symbol = 319;
pub const fexpr_builtin_symbol_FEXPR_Primes: fexpr_builtin_symbol = 320;
pub const fexpr_builtin_symbol_FEXPR_PrimitiveDirichletCharacters: fexpr_builtin_symbol = 321;
pub const fexpr_builtin_symbol_FEXPR_PrimitiveReducedPositiveIntegralBinaryQuadraticForms: fexpr_builtin_symbol = 322;
pub const fexpr_builtin_symbol_FEXPR_Product: fexpr_builtin_symbol = 323;
pub const fexpr_builtin_symbol_FEXPR_ProjectiveComplexNumbers: fexpr_builtin_symbol = 324;
pub const fexpr_builtin_symbol_FEXPR_ProjectiveRealNumbers: fexpr_builtin_symbol = 325;
pub const fexpr_builtin_symbol_FEXPR_Psi: fexpr_builtin_symbol = 326;
pub const fexpr_builtin_symbol_FEXPR_Psi_: fexpr_builtin_symbol = 327;
pub const fexpr_builtin_symbol_FEXPR_QQ: fexpr_builtin_symbol = 328;
pub const fexpr_builtin_symbol_FEXPR_QSeriesCoefficient: fexpr_builtin_symbol = 329;
pub const fexpr_builtin_symbol_FEXPR_QuotientRing: fexpr_builtin_symbol = 330;
pub const fexpr_builtin_symbol_FEXPR_RR: fexpr_builtin_symbol = 331;
pub const fexpr_builtin_symbol_FEXPR_Range: fexpr_builtin_symbol = 332;
pub const fexpr_builtin_symbol_FEXPR_Re: fexpr_builtin_symbol = 333;
pub const fexpr_builtin_symbol_FEXPR_RealAbs: fexpr_builtin_symbol = 334;
pub const fexpr_builtin_symbol_FEXPR_RealAlgebraicNumbers: fexpr_builtin_symbol = 335;
pub const fexpr_builtin_symbol_FEXPR_RealBall: fexpr_builtin_symbol = 336;
pub const fexpr_builtin_symbol_FEXPR_RealDerivative: fexpr_builtin_symbol = 337;
pub const fexpr_builtin_symbol_FEXPR_RealInfinities: fexpr_builtin_symbol = 338;
pub const fexpr_builtin_symbol_FEXPR_RealLimit: fexpr_builtin_symbol = 339;
pub const fexpr_builtin_symbol_FEXPR_RealSignedInfinities: fexpr_builtin_symbol = 340;
pub const fexpr_builtin_symbol_FEXPR_RealSingularityClosure: fexpr_builtin_symbol = 341;
pub const fexpr_builtin_symbol_FEXPR_Repeat: fexpr_builtin_symbol = 342;
pub const fexpr_builtin_symbol_FEXPR_Residue: fexpr_builtin_symbol = 343;
pub const fexpr_builtin_symbol_FEXPR_RiemannHypothesis: fexpr_builtin_symbol = 344;
pub const fexpr_builtin_symbol_FEXPR_RiemannXi: fexpr_builtin_symbol = 345;
pub const fexpr_builtin_symbol_FEXPR_RiemannZeta: fexpr_builtin_symbol = 346;
pub const fexpr_builtin_symbol_FEXPR_RiemannZetaZero: fexpr_builtin_symbol = 347;
pub const fexpr_builtin_symbol_FEXPR_RightLimit: fexpr_builtin_symbol = 348;
pub const fexpr_builtin_symbol_FEXPR_Rings: fexpr_builtin_symbol = 349;
pub const fexpr_builtin_symbol_FEXPR_RisingFactorial: fexpr_builtin_symbol = 350;
pub const fexpr_builtin_symbol_FEXPR_Root: fexpr_builtin_symbol = 351;
pub const fexpr_builtin_symbol_FEXPR_RootOfUnity: fexpr_builtin_symbol = 352;
pub const fexpr_builtin_symbol_FEXPR_Row: fexpr_builtin_symbol = 353;
pub const fexpr_builtin_symbol_FEXPR_RowMatrix: fexpr_builtin_symbol = 354;
pub const fexpr_builtin_symbol_FEXPR_SL2Z: fexpr_builtin_symbol = 355;
pub const fexpr_builtin_symbol_FEXPR_Same: fexpr_builtin_symbol = 356;
pub const fexpr_builtin_symbol_FEXPR_Sec: fexpr_builtin_symbol = 357;
pub const fexpr_builtin_symbol_FEXPR_Sech: fexpr_builtin_symbol = 358;
pub const fexpr_builtin_symbol_FEXPR_SequenceLimit: fexpr_builtin_symbol = 359;
pub const fexpr_builtin_symbol_FEXPR_SequenceLimitInferior: fexpr_builtin_symbol = 360;
pub const fexpr_builtin_symbol_FEXPR_SequenceLimitSuperior: fexpr_builtin_symbol = 361;
pub const fexpr_builtin_symbol_FEXPR_Ser: fexpr_builtin_symbol = 362;
pub const fexpr_builtin_symbol_FEXPR_Set: fexpr_builtin_symbol = 363;
pub const fexpr_builtin_symbol_FEXPR_SetMinus: fexpr_builtin_symbol = 364;
pub const fexpr_builtin_symbol_FEXPR_Sets: fexpr_builtin_symbol = 365;
pub const fexpr_builtin_symbol_FEXPR_ShowExpandedNormalForm: fexpr_builtin_symbol = 366;
pub const fexpr_builtin_symbol_FEXPR_Sigma: fexpr_builtin_symbol = 367;
pub const fexpr_builtin_symbol_FEXPR_Sigma_: fexpr_builtin_symbol = 368;
pub const fexpr_builtin_symbol_FEXPR_Sign: fexpr_builtin_symbol = 369;
pub const fexpr_builtin_symbol_FEXPR_SignExtendedComplexNumbers: fexpr_builtin_symbol = 370;
pub const fexpr_builtin_symbol_FEXPR_Sin: fexpr_builtin_symbol = 371;
pub const fexpr_builtin_symbol_FEXPR_SinIntegral: fexpr_builtin_symbol = 372;
pub const fexpr_builtin_symbol_FEXPR_Sinc: fexpr_builtin_symbol = 373;
pub const fexpr_builtin_symbol_FEXPR_SingularValues: fexpr_builtin_symbol = 374;
pub const fexpr_builtin_symbol_FEXPR_Sinh: fexpr_builtin_symbol = 375;
pub const fexpr_builtin_symbol_FEXPR_SinhIntegral: fexpr_builtin_symbol = 376;
pub const fexpr_builtin_symbol_FEXPR_SloaneA: fexpr_builtin_symbol = 377;
pub const fexpr_builtin_symbol_FEXPR_Solutions: fexpr_builtin_symbol = 378;
pub const fexpr_builtin_symbol_FEXPR_SpecialLinearGroup: fexpr_builtin_symbol = 379;
pub const fexpr_builtin_symbol_FEXPR_Spectrum: fexpr_builtin_symbol = 380;
pub const fexpr_builtin_symbol_FEXPR_SphericalHarmonicY: fexpr_builtin_symbol = 381;
pub const fexpr_builtin_symbol_FEXPR_Sqrt: fexpr_builtin_symbol = 382;
pub const fexpr_builtin_symbol_FEXPR_SquaresR: fexpr_builtin_symbol = 383;
pub const fexpr_builtin_symbol_FEXPR_Step: fexpr_builtin_symbol = 384;
pub const fexpr_builtin_symbol_FEXPR_StieltjesGamma: fexpr_builtin_symbol = 385;
pub const fexpr_builtin_symbol_FEXPR_StirlingCycle: fexpr_builtin_symbol = 386;
pub const fexpr_builtin_symbol_FEXPR_StirlingS1: fexpr_builtin_symbol = 387;
pub const fexpr_builtin_symbol_FEXPR_StirlingS2: fexpr_builtin_symbol = 388;
pub const fexpr_builtin_symbol_FEXPR_StirlingSeriesRemainder: fexpr_builtin_symbol = 389;
pub const fexpr_builtin_symbol_FEXPR_Sub: fexpr_builtin_symbol = 390;
pub const fexpr_builtin_symbol_FEXPR_Subscript: fexpr_builtin_symbol = 391;
pub const fexpr_builtin_symbol_FEXPR_Subset: fexpr_builtin_symbol = 392;
pub const fexpr_builtin_symbol_FEXPR_SubsetEqual: fexpr_builtin_symbol = 393;
pub const fexpr_builtin_symbol_FEXPR_Subsets: fexpr_builtin_symbol = 394;
pub const fexpr_builtin_symbol_FEXPR_Sum: fexpr_builtin_symbol = 395;
pub const fexpr_builtin_symbol_FEXPR_Supremum: fexpr_builtin_symbol = 396;
pub const fexpr_builtin_symbol_FEXPR_SymmetricPolynomial: fexpr_builtin_symbol = 397;
pub const fexpr_builtin_symbol_FEXPR_Tan: fexpr_builtin_symbol = 398;
pub const fexpr_builtin_symbol_FEXPR_Tanh: fexpr_builtin_symbol = 399;
pub const fexpr_builtin_symbol_FEXPR_Theta: fexpr_builtin_symbol = 400;
pub const fexpr_builtin_symbol_FEXPR_Theta_: fexpr_builtin_symbol = 401;
pub const fexpr_builtin_symbol_FEXPR_True: fexpr_builtin_symbol = 402;
pub const fexpr_builtin_symbol_FEXPR_Tuple: fexpr_builtin_symbol = 403;
pub const fexpr_builtin_symbol_FEXPR_Tuples: fexpr_builtin_symbol = 404;
pub const fexpr_builtin_symbol_FEXPR_Undefined: fexpr_builtin_symbol = 405;
pub const fexpr_builtin_symbol_FEXPR_Union: fexpr_builtin_symbol = 406;
pub const fexpr_builtin_symbol_FEXPR_UniqueSolution: fexpr_builtin_symbol = 407;
pub const fexpr_builtin_symbol_FEXPR_UniqueZero: fexpr_builtin_symbol = 408;
pub const fexpr_builtin_symbol_FEXPR_UnitCircle: fexpr_builtin_symbol = 409;
pub const fexpr_builtin_symbol_FEXPR_Unknown: fexpr_builtin_symbol = 410;
pub const fexpr_builtin_symbol_FEXPR_UnsignedInfinity: fexpr_builtin_symbol = 411;
pub const fexpr_builtin_symbol_FEXPR_UpperGamma: fexpr_builtin_symbol = 412;
pub const fexpr_builtin_symbol_FEXPR_UpperHalfPlane: fexpr_builtin_symbol = 413;
pub const fexpr_builtin_symbol_FEXPR_WeierstrassP: fexpr_builtin_symbol = 414;
pub const fexpr_builtin_symbol_FEXPR_WeierstrassSigma: fexpr_builtin_symbol = 415;
pub const fexpr_builtin_symbol_FEXPR_WeierstrassZeta: fexpr_builtin_symbol = 416;
pub const fexpr_builtin_symbol_FEXPR_Where: fexpr_builtin_symbol = 417;
pub const fexpr_builtin_symbol_FEXPR_XGCD: fexpr_builtin_symbol = 418;
pub const fexpr_builtin_symbol_FEXPR_XX: fexpr_builtin_symbol = 419;
pub const fexpr_builtin_symbol_FEXPR_Xi: fexpr_builtin_symbol = 420;
pub const fexpr_builtin_symbol_FEXPR_Xi_: fexpr_builtin_symbol = 421;
pub const fexpr_builtin_symbol_FEXPR_ZZ: fexpr_builtin_symbol = 422;
pub const fexpr_builtin_symbol_FEXPR_Zero: fexpr_builtin_symbol = 423;
pub const fexpr_builtin_symbol_FEXPR_ZeroMatrix: fexpr_builtin_symbol = 424;
pub const fexpr_builtin_symbol_FEXPR_Zeros: fexpr_builtin_symbol = 425;
pub const fexpr_builtin_symbol_FEXPR_alpha: fexpr_builtin_symbol = 426;
pub const fexpr_builtin_symbol_FEXPR_alpha_: fexpr_builtin_symbol = 427;
pub const fexpr_builtin_symbol_FEXPR_beta: fexpr_builtin_symbol = 428;
pub const fexpr_builtin_symbol_FEXPR_beta_: fexpr_builtin_symbol = 429;
pub const fexpr_builtin_symbol_FEXPR_chi: fexpr_builtin_symbol = 430;
pub const fexpr_builtin_symbol_FEXPR_chi_: fexpr_builtin_symbol = 431;
pub const fexpr_builtin_symbol_FEXPR_delta: fexpr_builtin_symbol = 432;
pub const fexpr_builtin_symbol_FEXPR_delta_: fexpr_builtin_symbol = 433;
pub const fexpr_builtin_symbol_FEXPR_ell: fexpr_builtin_symbol = 434;
pub const fexpr_builtin_symbol_FEXPR_ell_: fexpr_builtin_symbol = 435;
pub const fexpr_builtin_symbol_FEXPR_epsilon: fexpr_builtin_symbol = 436;
pub const fexpr_builtin_symbol_FEXPR_epsilon_: fexpr_builtin_symbol = 437;
pub const fexpr_builtin_symbol_FEXPR_eta: fexpr_builtin_symbol = 438;
pub const fexpr_builtin_symbol_FEXPR_eta_: fexpr_builtin_symbol = 439;
pub const fexpr_builtin_symbol_FEXPR_gamma: fexpr_builtin_symbol = 440;
pub const fexpr_builtin_symbol_FEXPR_gamma_: fexpr_builtin_symbol = 441;
pub const fexpr_builtin_symbol_FEXPR_iota: fexpr_builtin_symbol = 442;
pub const fexpr_builtin_symbol_FEXPR_iota_: fexpr_builtin_symbol = 443;
pub const fexpr_builtin_symbol_FEXPR_kappa: fexpr_builtin_symbol = 444;
pub const fexpr_builtin_symbol_FEXPR_kappa_: fexpr_builtin_symbol = 445;
pub const fexpr_builtin_symbol_FEXPR_lamda: fexpr_builtin_symbol = 446;
pub const fexpr_builtin_symbol_FEXPR_lamda_: fexpr_builtin_symbol = 447;
pub const fexpr_builtin_symbol_FEXPR_mu: fexpr_builtin_symbol = 448;
pub const fexpr_builtin_symbol_FEXPR_mu_: fexpr_builtin_symbol = 449;
pub const fexpr_builtin_symbol_FEXPR_nu: fexpr_builtin_symbol = 450;
pub const fexpr_builtin_symbol_FEXPR_nu_: fexpr_builtin_symbol = 451;
pub const fexpr_builtin_symbol_FEXPR_omega: fexpr_builtin_symbol = 452;
pub const fexpr_builtin_symbol_FEXPR_omega_: fexpr_builtin_symbol = 453;
pub const fexpr_builtin_symbol_FEXPR_phi: fexpr_builtin_symbol = 454;
pub const fexpr_builtin_symbol_FEXPR_phi_: fexpr_builtin_symbol = 455;
pub const fexpr_builtin_symbol_FEXPR_pi: fexpr_builtin_symbol = 456;
pub const fexpr_builtin_symbol_FEXPR_pi_: fexpr_builtin_symbol = 457;
pub const fexpr_builtin_symbol_FEXPR_rho: fexpr_builtin_symbol = 458;
pub const fexpr_builtin_symbol_FEXPR_rho_: fexpr_builtin_symbol = 459;
pub const fexpr_builtin_symbol_FEXPR_sigma: fexpr_builtin_symbol = 460;
pub const fexpr_builtin_symbol_FEXPR_sigma_: fexpr_builtin_symbol = 461;
pub const fexpr_builtin_symbol_FEXPR_tau: fexpr_builtin_symbol = 462;
pub const fexpr_builtin_symbol_FEXPR_tau_: fexpr_builtin_symbol = 463;
pub const fexpr_builtin_symbol_FEXPR_theta: fexpr_builtin_symbol = 464;
pub const fexpr_builtin_symbol_FEXPR_theta_: fexpr_builtin_symbol = 465;
pub const fexpr_builtin_symbol_FEXPR_varphi: fexpr_builtin_symbol = 466;
pub const fexpr_builtin_symbol_FEXPR_varphi_: fexpr_builtin_symbol = 467;
pub const fexpr_builtin_symbol_FEXPR_vartheta: fexpr_builtin_symbol = 468;
pub const fexpr_builtin_symbol_FEXPR_vartheta_: fexpr_builtin_symbol = 469;
pub const fexpr_builtin_symbol_FEXPR_xi: fexpr_builtin_symbol = 470;
pub const fexpr_builtin_symbol_FEXPR_xi_: fexpr_builtin_symbol = 471;
pub const fexpr_builtin_symbol_FEXPR_zeta: fexpr_builtin_symbol = 472;
pub const fexpr_builtin_symbol_FEXPR_zeta_: fexpr_builtin_symbol = 473;
pub const fexpr_builtin_symbol_FEXPR_BUILTIN_LENGTH: fexpr_builtin_symbol = 474;
pub type fexpr_builtin_symbol = ::std::os::raw::c_uint;
pub type _fexpr_latex_writer = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut gr_stream_struct,
        arg2: *const fexpr_struct,
        arg3: ulong,
    ),
>;
#[repr(C)]
pub struct fexpr_symbol_info {
    pub symbol: fexpr_builtin_symbol,
    pub string: *const ::std::os::raw::c_char,
    pub latex_string: *const ::std::os::raw::c_char,
    pub latex_writer: _fexpr_latex_writer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fexpr_symbol_info"][::std::mem::size_of::<fexpr_symbol_info>() - 32usize];
    [
        "Alignment of fexpr_symbol_info",
    ][::std::mem::align_of::<fexpr_symbol_info>() - 8usize];
    [
        "Offset of field: fexpr_symbol_info::symbol",
    ][::std::mem::offset_of!(fexpr_symbol_info, symbol) - 0usize];
    [
        "Offset of field: fexpr_symbol_info::string",
    ][::std::mem::offset_of!(fexpr_symbol_info, string) - 8usize];
    [
        "Offset of field: fexpr_symbol_info::latex_string",
    ][::std::mem::offset_of!(fexpr_symbol_info, latex_string) - 16usize];
    [
        "Offset of field: fexpr_symbol_info::latex_writer",
    ][::std::mem::offset_of!(fexpr_symbol_info, latex_writer) - 24usize];
};
#[repr(C)]
pub struct fmpq_mpoly_univar_struct {
    pub coeffs: *mut fmpq_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpq_mpoly_univar_struct",
    ][::std::mem::size_of::<fmpq_mpoly_univar_struct>() - 32usize];
    [
        "Alignment of fmpq_mpoly_univar_struct",
    ][::std::mem::align_of::<fmpq_mpoly_univar_struct>() - 8usize];
    [
        "Offset of field: fmpq_mpoly_univar_struct::coeffs",
    ][::std::mem::offset_of!(fmpq_mpoly_univar_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpq_mpoly_univar_struct::exps",
    ][::std::mem::offset_of!(fmpq_mpoly_univar_struct, exps) - 8usize];
    [
        "Offset of field: fmpq_mpoly_univar_struct::alloc",
    ][::std::mem::offset_of!(fmpq_mpoly_univar_struct, alloc) - 16usize];
    [
        "Offset of field: fmpq_mpoly_univar_struct::length",
    ][::std::mem::offset_of!(fmpq_mpoly_univar_struct, length) - 24usize];
};
pub type fmpq_mpoly_univar_t = [fmpq_mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct ecm_s {
    pub t: nn_ptr,
    pub u: nn_ptr,
    pub v: nn_ptr,
    pub w: nn_ptr,
    pub x: nn_ptr,
    pub z: nn_ptr,
    pub a24: nn_ptr,
    pub ninv: nn_ptr,
    pub one: nn_ptr,
    pub GCD_table: *mut ::std::os::raw::c_uchar,
    pub prime_table: *mut *mut ::std::os::raw::c_uchar,
    pub n_size: ulong,
    pub normbits: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ecm_s"][::std::mem::size_of::<ecm_s>() - 104usize];
    ["Alignment of ecm_s"][::std::mem::align_of::<ecm_s>() - 8usize];
    ["Offset of field: ecm_s::t"][::std::mem::offset_of!(ecm_s, t) - 0usize];
    ["Offset of field: ecm_s::u"][::std::mem::offset_of!(ecm_s, u) - 8usize];
    ["Offset of field: ecm_s::v"][::std::mem::offset_of!(ecm_s, v) - 16usize];
    ["Offset of field: ecm_s::w"][::std::mem::offset_of!(ecm_s, w) - 24usize];
    ["Offset of field: ecm_s::x"][::std::mem::offset_of!(ecm_s, x) - 32usize];
    ["Offset of field: ecm_s::z"][::std::mem::offset_of!(ecm_s, z) - 40usize];
    ["Offset of field: ecm_s::a24"][::std::mem::offset_of!(ecm_s, a24) - 48usize];
    ["Offset of field: ecm_s::ninv"][::std::mem::offset_of!(ecm_s, ninv) - 56usize];
    ["Offset of field: ecm_s::one"][::std::mem::offset_of!(ecm_s, one) - 64usize];
    [
        "Offset of field: ecm_s::GCD_table",
    ][::std::mem::offset_of!(ecm_s, GCD_table) - 72usize];
    [
        "Offset of field: ecm_s::prime_table",
    ][::std::mem::offset_of!(ecm_s, prime_table) - 80usize];
    ["Offset of field: ecm_s::n_size"][::std::mem::offset_of!(ecm_s, n_size) - 88usize];
    [
        "Offset of field: ecm_s::normbits",
    ][::std::mem::offset_of!(ecm_s, normbits) - 96usize];
};
pub type ecm_t = [ecm_s; 1usize];
pub type mpf = __mpf_struct;
#[repr(C)]
pub struct mpf_mat_struct {
    pub entries: *mut mpf,
    pub r: slong,
    pub c: slong,
    pub prec: flint_bitcnt_t,
    pub rows: *mut *mut mpf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpf_mat_struct"][::std::mem::size_of::<mpf_mat_struct>() - 40usize];
    ["Alignment of mpf_mat_struct"][::std::mem::align_of::<mpf_mat_struct>() - 8usize];
    [
        "Offset of field: mpf_mat_struct::entries",
    ][::std::mem::offset_of!(mpf_mat_struct, entries) - 0usize];
    [
        "Offset of field: mpf_mat_struct::r",
    ][::std::mem::offset_of!(mpf_mat_struct, r) - 8usize];
    [
        "Offset of field: mpf_mat_struct::c",
    ][::std::mem::offset_of!(mpf_mat_struct, c) - 16usize];
    [
        "Offset of field: mpf_mat_struct::prec",
    ][::std::mem::offset_of!(mpf_mat_struct, prec) - 24usize];
    [
        "Offset of field: mpf_mat_struct::rows",
    ][::std::mem::offset_of!(mpf_mat_struct, rows) - 32usize];
};
pub type mpf_mat_t = [mpf_mat_struct; 1usize];
pub const rep_type_GRAM: rep_type = 0;
pub const rep_type_Z_BASIS: rep_type = 1;
pub type rep_type = ::std::os::raw::c_uint;
pub const gram_type_APPROX: gram_type = 0;
pub const gram_type_EXACT: gram_type = 1;
pub type gram_type = ::std::os::raw::c_uint;
#[repr(C)]
pub struct fmpz_lll_struct {
    pub delta: f64,
    pub eta: f64,
    pub rt: rep_type,
    pub gt: gram_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_lll_struct"][::std::mem::size_of::<fmpz_lll_struct>() - 24usize];
    ["Alignment of fmpz_lll_struct"][::std::mem::align_of::<fmpz_lll_struct>() - 8usize];
    [
        "Offset of field: fmpz_lll_struct::delta",
    ][::std::mem::offset_of!(fmpz_lll_struct, delta) - 0usize];
    [
        "Offset of field: fmpz_lll_struct::eta",
    ][::std::mem::offset_of!(fmpz_lll_struct, eta) - 8usize];
    [
        "Offset of field: fmpz_lll_struct::rt",
    ][::std::mem::offset_of!(fmpz_lll_struct, rt) - 16usize];
    [
        "Offset of field: fmpz_lll_struct::gt",
    ][::std::mem::offset_of!(fmpz_lll_struct, gt) - 20usize];
};
pub type fmpz_lll_t = [fmpz_lll_struct; 1usize];
#[repr(C)]
pub struct fmpz_gram_union {
    pub appSP: __BindgenUnionField<d_mat_t>,
    pub appSP2: __BindgenUnionField<mpf_mat_t>,
    pub exactSP: __BindgenUnionField<fmpz_mat_t>,
    pub bindgen_union_field: [u64; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_gram_union"][::std::mem::size_of::<fmpz_gram_union>() - 40usize];
    ["Alignment of fmpz_gram_union"][::std::mem::align_of::<fmpz_gram_union>() - 8usize];
    [
        "Offset of field: fmpz_gram_union::appSP",
    ][::std::mem::offset_of!(fmpz_gram_union, appSP) - 0usize];
    [
        "Offset of field: fmpz_gram_union::appSP2",
    ][::std::mem::offset_of!(fmpz_gram_union, appSP2) - 0usize];
    [
        "Offset of field: fmpz_gram_union::exactSP",
    ][::std::mem::offset_of!(fmpz_gram_union, exactSP) - 0usize];
};
pub type fmpz_gram_t = [fmpz_gram_union; 1usize];
#[repr(C)]
pub struct fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct {
    pub gammapow: fmpz_t,
    pub cm: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct",
    ][::std::mem::size_of::<fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct>()
        - 16usize];
    [
        "Alignment of fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct",
    ][::std::mem::align_of::<fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct>()
        - 8usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct::gammapow",
    ][::std::mem::offset_of!(
        fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct, gammapow
    ) - 0usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct::cm",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct, cm)
        - 8usize];
};
#[repr(C)]
pub struct fmpz_mod_discrete_log_pohlig_hellman_entry_struct {
    pub exp: slong,
    pub prime: ulong,
    pub gamma: fmpz_t,
    pub gammainv: fmpz_t,
    pub startingbeta: fmpz_t,
    pub co: fmpz_t,
    pub startinge: fmpz_t,
    pub idem: fmpz_t,
    pub cbound: ulong,
    pub dbound: ulong,
    pub table: *mut fmpz_mod_discrete_log_pohlig_hellman_table_entry_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_discrete_log_pohlig_hellman_entry_struct",
    ][::std::mem::size_of::<fmpz_mod_discrete_log_pohlig_hellman_entry_struct>()
        - 88usize];
    [
        "Alignment of fmpz_mod_discrete_log_pohlig_hellman_entry_struct",
    ][::std::mem::align_of::<fmpz_mod_discrete_log_pohlig_hellman_entry_struct>()
        - 8usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::exp",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, exp)
        - 0usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::prime",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, prime)
        - 8usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::gamma",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, gamma)
        - 16usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::gammainv",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, gammainv)
        - 24usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::startingbeta",
    ][::std::mem::offset_of!(
        fmpz_mod_discrete_log_pohlig_hellman_entry_struct, startingbeta
    ) - 32usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::co",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, co)
        - 40usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::startinge",
    ][::std::mem::offset_of!(
        fmpz_mod_discrete_log_pohlig_hellman_entry_struct, startinge
    ) - 48usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::idem",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, idem)
        - 56usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::cbound",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, cbound)
        - 64usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::dbound",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, dbound)
        - 72usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_entry_struct::table",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_entry_struct, table)
        - 80usize];
};
#[repr(C)]
pub struct fmpz_mod_discrete_log_pohlig_hellman_struct {
    pub fpctx: fmpz_mod_ctx_t,
    pub pm1: fmpz_t,
    pub alpha: fmpz_t,
    pub alphainv: fmpz_t,
    pub num_factors: slong,
    pub entries: *mut fmpz_mod_discrete_log_pohlig_hellman_entry_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_discrete_log_pohlig_hellman_struct",
    ][::std::mem::size_of::<fmpz_mod_discrete_log_pohlig_hellman_struct>() - 152usize];
    [
        "Alignment of fmpz_mod_discrete_log_pohlig_hellman_struct",
    ][::std::mem::align_of::<fmpz_mod_discrete_log_pohlig_hellman_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_struct::fpctx",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_struct, fpctx)
        - 0usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_struct::pm1",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_struct, pm1)
        - 112usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_struct::alpha",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_struct, alpha)
        - 120usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_struct::alphainv",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_struct, alphainv)
        - 128usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_struct::num_factors",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_struct, num_factors)
        - 136usize];
    [
        "Offset of field: fmpz_mod_discrete_log_pohlig_hellman_struct::entries",
    ][::std::mem::offset_of!(fmpz_mod_discrete_log_pohlig_hellman_struct, entries)
        - 144usize];
};
pub type fmpz_mod_discrete_log_pohlig_hellman_t = [fmpz_mod_discrete_log_pohlig_hellman_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_res_struct {
    pub res: fmpz_t,
    pub lc: fmpz_t,
    pub len0: slong,
    pub len1: slong,
    pub off: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_res_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_res_struct>() - 40usize];
    [
        "Alignment of fmpz_mod_poly_res_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_res_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_res_struct::res",
    ][::std::mem::offset_of!(fmpz_mod_poly_res_struct, res) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_res_struct::lc",
    ][::std::mem::offset_of!(fmpz_mod_poly_res_struct, lc) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_res_struct::len0",
    ][::std::mem::offset_of!(fmpz_mod_poly_res_struct, len0) - 16usize];
    [
        "Offset of field: fmpz_mod_poly_res_struct::len1",
    ][::std::mem::offset_of!(fmpz_mod_poly_res_struct, len1) - 24usize];
    [
        "Offset of field: fmpz_mod_poly_res_struct::off",
    ][::std::mem::offset_of!(fmpz_mod_poly_res_struct, off) - 32usize];
};
pub type fmpz_mod_poly_res_t = [fmpz_mod_poly_res_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_frobenius_powers_2exp_struct {
    pub pow: *mut fmpz_mod_poly_struct,
    pub len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_frobenius_powers_2exp_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_frobenius_powers_2exp_struct>() - 16usize];
    [
        "Alignment of fmpz_mod_poly_frobenius_powers_2exp_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_frobenius_powers_2exp_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_frobenius_powers_2exp_struct::pow",
    ][::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_2exp_struct, pow) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_frobenius_powers_2exp_struct::len",
    ][::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_2exp_struct, len) - 8usize];
};
pub type fmpz_mod_poly_frobenius_powers_2exp_t = [fmpz_mod_poly_frobenius_powers_2exp_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_frobenius_powers_struct {
    pub pow: *mut fmpz_mod_poly_struct,
    pub len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_frobenius_powers_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_frobenius_powers_struct>() - 16usize];
    [
        "Alignment of fmpz_mod_poly_frobenius_powers_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_frobenius_powers_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_frobenius_powers_struct::pow",
    ][::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_struct, pow) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_frobenius_powers_struct::len",
    ][::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_struct, len) - 8usize];
};
pub type fmpz_mod_poly_frobenius_powers_t = [fmpz_mod_poly_frobenius_powers_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_matrix_precompute_arg_t {
    pub A: *mut fmpz_mat_struct,
    pub poly1: *mut fmpz_mod_poly_struct,
    pub poly2: *mut fmpz_mod_poly_struct,
    pub poly2inv: *mut fmpz_mod_poly_struct,
    pub ctx: *const fmpz_mod_ctx_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_matrix_precompute_arg_t",
    ][::std::mem::size_of::<fmpz_mod_poly_matrix_precompute_arg_t>() - 40usize];
    [
        "Alignment of fmpz_mod_poly_matrix_precompute_arg_t",
    ][::std::mem::align_of::<fmpz_mod_poly_matrix_precompute_arg_t>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::A",
    ][::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, A) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::poly1",
    ][::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, poly1) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::poly2",
    ][::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, poly2) - 16usize];
    [
        "Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::poly2inv",
    ][::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, poly2inv) - 24usize];
    [
        "Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::ctx",
    ][::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, ctx) - 32usize];
};
#[repr(C)]
pub struct fmpz_mod_poly_compose_mod_precomp_preinv_arg_t {
    pub A: *mut fmpz_mat_struct,
    pub res: *mut fmpz_mod_poly_struct,
    pub poly1: *mut fmpz_mod_poly_struct,
    pub poly3: *mut fmpz_mod_poly_struct,
    pub poly3inv: *mut fmpz_mod_poly_struct,
    pub ctx: *const fmpz_mod_ctx_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_compose_mod_precomp_preinv_arg_t",
    ][::std::mem::size_of::<fmpz_mod_poly_compose_mod_precomp_preinv_arg_t>() - 48usize];
    [
        "Alignment of fmpz_mod_poly_compose_mod_precomp_preinv_arg_t",
    ][::std::mem::align_of::<fmpz_mod_poly_compose_mod_precomp_preinv_arg_t>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::A",
    ][::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, A)
        - 0usize];
    [
        "Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::res",
    ][::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, res)
        - 8usize];
    [
        "Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::poly1",
    ][::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, poly1)
        - 16usize];
    [
        "Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::poly3",
    ][::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, poly3)
        - 24usize];
    [
        "Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::poly3inv",
    ][::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, poly3inv)
        - 32usize];
    [
        "Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::ctx",
    ][::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, ctx)
        - 40usize];
};
#[repr(C)]
pub struct fmpz_mod_poly_radix_struct {
    pub V: *mut fmpz,
    pub W: *mut fmpz,
    pub Rpow: *mut *mut fmpz,
    pub Rinv: *mut *mut fmpz,
    pub degR: slong,
    pub k: slong,
    pub invL: fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_radix_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_radix_struct>() - 56usize];
    [
        "Alignment of fmpz_mod_poly_radix_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_radix_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::V",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, V) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::W",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, W) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::Rpow",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, Rpow) - 16usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::Rinv",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, Rinv) - 24usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::degR",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, degR) - 32usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::k",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, k) - 40usize];
    [
        "Offset of field: fmpz_mod_poly_radix_struct::invL",
    ][::std::mem::offset_of!(fmpz_mod_poly_radix_struct, invL) - 48usize];
};
pub type fmpz_mod_poly_radix_t = [fmpz_mod_poly_radix_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_berlekamp_massey_struct {
    pub npoints: slong,
    pub R0: fmpz_mod_poly_t,
    pub R1: fmpz_mod_poly_t,
    pub V0: fmpz_mod_poly_t,
    pub V1: fmpz_mod_poly_t,
    pub qt: fmpz_mod_poly_t,
    pub rt: fmpz_mod_poly_t,
    pub points: fmpz_mod_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_berlekamp_massey_struct",
    ][::std::mem::size_of::<fmpz_mod_berlekamp_massey_struct>() - 176usize];
    [
        "Alignment of fmpz_mod_berlekamp_massey_struct",
    ][::std::mem::align_of::<fmpz_mod_berlekamp_massey_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::npoints",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, npoints) - 0usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::R0",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, R0) - 8usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::R1",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, R1) - 32usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::V0",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, V0) - 56usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::V1",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, V1) - 80usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::qt",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, qt) - 104usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::rt",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, rt) - 128usize];
    [
        "Offset of field: fmpz_mod_berlekamp_massey_struct::points",
    ][::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, points) - 152usize];
};
pub type fmpz_mod_berlekamp_massey_t = [fmpz_mod_berlekamp_massey_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_univar_struct {
    pub coeffs: *mut fmpz_mod_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpoly_univar_struct",
    ][::std::mem::size_of::<fmpz_mod_mpoly_univar_struct>() - 32usize];
    [
        "Alignment of fmpz_mod_mpoly_univar_struct",
    ][::std::mem::align_of::<fmpz_mod_mpoly_univar_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_univar_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_mpoly_univar_struct::exps",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_univar_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, alloc) - 16usize];
    [
        "Offset of field: fmpz_mod_mpoly_univar_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, length) - 24usize];
};
pub type fmpz_mod_mpoly_univar_t = [fmpz_mod_mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_geobucket {
    pub polys: [fmpz_mod_mpoly_struct; 32usize],
    pub temps: [fmpz_mod_mpoly_struct; 32usize],
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpoly_geobucket",
    ][::std::mem::size_of::<fmpz_mod_mpoly_geobucket>() - 3080usize];
    [
        "Alignment of fmpz_mod_mpoly_geobucket",
    ][::std::mem::align_of::<fmpz_mod_mpoly_geobucket>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_geobucket::polys",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_geobucket, polys) - 0usize];
    [
        "Offset of field: fmpz_mod_mpoly_geobucket::temps",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_geobucket, temps) - 1536usize];
    [
        "Offset of field: fmpz_mod_mpoly_geobucket::length",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_geobucket, length) - 3072usize];
};
pub type fmpz_mod_mpoly_geobucket_struct = fmpz_mod_mpoly_geobucket;
pub type fmpz_mod_mpoly_geobucket_t = [fmpz_mod_mpoly_geobucket_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_bpoly_struct {
    pub coeffs: *mut fmpz_mod_poly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_bpoly_struct",
    ][::std::mem::size_of::<fmpz_mod_bpoly_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_bpoly_struct",
    ][::std::mem::align_of::<fmpz_mod_bpoly_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_bpoly_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_bpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_bpoly_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_bpoly_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_bpoly_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_bpoly_struct, length) - 16usize];
};
pub type fmpz_mod_bpoly_t = [fmpz_mod_bpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_tpoly_struct {
    pub coeffs: *mut fmpz_mod_bpoly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_tpoly_struct",
    ][::std::mem::size_of::<fmpz_mod_tpoly_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_tpoly_struct",
    ][::std::mem::align_of::<fmpz_mod_tpoly_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_tpoly_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_tpoly_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_tpoly_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_tpoly_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_tpoly_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_tpoly_struct, length) - 16usize];
};
pub type fmpz_mod_tpoly_t = [fmpz_mod_tpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_polyu_struct {
    pub exps: *mut ulong,
    pub coeffs: *mut fmpz,
    pub length: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_polyu_struct",
    ][::std::mem::size_of::<fmpz_mod_polyu_struct>() - 32usize];
    [
        "Alignment of fmpz_mod_polyu_struct",
    ][::std::mem::align_of::<fmpz_mod_polyu_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_polyu_struct::exps",
    ][::std::mem::offset_of!(fmpz_mod_polyu_struct, exps) - 0usize];
    [
        "Offset of field: fmpz_mod_polyu_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_polyu_struct, coeffs) - 8usize];
    [
        "Offset of field: fmpz_mod_polyu_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_polyu_struct, length) - 16usize];
    [
        "Offset of field: fmpz_mod_polyu_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_polyu_struct, alloc) - 24usize];
};
pub type fmpz_mod_polyu_t = [fmpz_mod_polyu_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_polyun_struct {
    pub coeffs: *mut fmpz_mod_poly_struct,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_polyun_struct",
    ][::std::mem::size_of::<fmpz_mod_polyun_struct>() - 32usize];
    [
        "Alignment of fmpz_mod_polyun_struct",
    ][::std::mem::align_of::<fmpz_mod_polyun_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_polyun_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_polyun_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_polyun_struct::exps",
    ][::std::mem::offset_of!(fmpz_mod_polyun_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mod_polyun_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_polyun_struct, alloc) - 16usize];
    [
        "Offset of field: fmpz_mod_polyun_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_polyun_struct, length) - 24usize];
};
pub type fmpz_mod_polyun_t = [fmpz_mod_polyun_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyu_struct {
    pub coeffs: *mut fmpz_mod_mpoly_struct,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpolyu_struct",
    ][::std::mem::size_of::<fmpz_mod_mpolyu_struct>() - 40usize];
    [
        "Alignment of fmpz_mod_mpolyu_struct",
    ][::std::mem::align_of::<fmpz_mod_mpolyu_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyu_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpolyu_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_mpolyu_struct::exps",
    ][::std::mem::offset_of!(fmpz_mod_mpolyu_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyu_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpolyu_struct, alloc) - 16usize];
    [
        "Offset of field: fmpz_mod_mpolyu_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_mpolyu_struct, length) - 24usize];
    [
        "Offset of field: fmpz_mod_mpolyu_struct::bits",
    ][::std::mem::offset_of!(fmpz_mod_mpolyu_struct, bits) - 32usize];
};
pub type fmpz_mod_mpolyu_t = [fmpz_mod_mpolyu_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyn_struct {
    pub coeffs: *mut fmpz_mod_poly_struct,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
    pub bits: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpolyn_struct",
    ][::std::mem::size_of::<fmpz_mod_mpolyn_struct>() - 40usize];
    [
        "Alignment of fmpz_mod_mpolyn_struct",
    ][::std::mem::align_of::<fmpz_mod_mpolyn_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyn_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_mpolyn_struct::exps",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_struct, exps) - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyn_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_struct, alloc) - 16usize];
    [
        "Offset of field: fmpz_mod_mpolyn_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_struct, length) - 24usize];
    [
        "Offset of field: fmpz_mod_mpolyn_struct::bits",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_struct, bits) - 32usize];
};
pub type fmpz_mod_mpolyn_t = [fmpz_mod_mpolyn_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_stack_struct {
    pub array: *mut *mut fmpz_mod_poly_struct,
    pub alloc: slong,
    pub top: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_stack_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_poly_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_stack_struct::array",
    ][::std::mem::offset_of!(fmpz_mod_poly_stack_struct, array) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_stack_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_poly_stack_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_stack_struct::top",
    ][::std::mem::offset_of!(fmpz_mod_poly_stack_struct, top) - 16usize];
};
pub type fmpz_mod_poly_stack_t = [fmpz_mod_poly_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_bpoly_stack_struct {
    pub array: *mut *mut fmpz_mod_bpoly_struct,
    pub alloc: slong,
    pub top: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_bpoly_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_bpoly_stack_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_bpoly_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_bpoly_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_bpoly_stack_struct::array",
    ][::std::mem::offset_of!(fmpz_mod_bpoly_stack_struct, array) - 0usize];
    [
        "Offset of field: fmpz_mod_bpoly_stack_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_bpoly_stack_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_bpoly_stack_struct::top",
    ][::std::mem::offset_of!(fmpz_mod_bpoly_stack_struct, top) - 16usize];
};
pub type fmpz_mod_bpoly_stack_t = [fmpz_mod_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_polyun_stack_struct {
    pub array: *mut *mut fmpz_mod_polyun_struct,
    pub alloc: slong,
    pub top: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_polyun_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_polyun_stack_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_polyun_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_polyun_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_polyun_stack_struct::array",
    ][::std::mem::offset_of!(fmpz_mod_polyun_stack_struct, array) - 0usize];
    [
        "Offset of field: fmpz_mod_polyun_stack_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_polyun_stack_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_polyun_stack_struct::top",
    ][::std::mem::offset_of!(fmpz_mod_polyun_stack_struct, top) - 16usize];
};
pub type fmpz_mod_polyun_stack_t = [fmpz_mod_polyun_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyn_stack_struct {
    pub array: *mut *mut fmpz_mod_mpolyn_struct,
    pub alloc: slong,
    pub top: slong,
    pub bits: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpolyn_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_mpolyn_stack_struct>() - 32usize];
    [
        "Alignment of fmpz_mod_mpolyn_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_mpolyn_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyn_stack_struct::array",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, array) - 0usize];
    [
        "Offset of field: fmpz_mod_mpolyn_stack_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyn_stack_struct::top",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, top) - 16usize];
    [
        "Offset of field: fmpz_mod_mpolyn_stack_struct::bits",
    ][::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, bits) - 24usize];
};
pub type fmpz_mod_mpolyn_stack_t = [fmpz_mod_mpolyn_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_bpoly_stack_struct {
    pub poly_stack: fmpz_mod_poly_stack_t,
    pub bpoly_stack: fmpz_mod_bpoly_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_bpoly_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_bpoly_stack_struct>() - 48usize];
    [
        "Alignment of fmpz_mod_poly_bpoly_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_bpoly_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_bpoly_stack_struct::poly_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_bpoly_stack_struct, poly_stack) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_bpoly_stack_struct::bpoly_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_bpoly_stack_struct, bpoly_stack) - 24usize];
};
pub type fmpz_mod_poly_bpoly_stack_t = [fmpz_mod_poly_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_polyun_stack_struct {
    pub poly_stack: fmpz_mod_poly_stack_t,
    pub polyun_stack: fmpz_mod_polyun_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_polyun_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_polyun_stack_struct>() - 48usize];
    [
        "Alignment of fmpz_mod_poly_polyun_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_polyun_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_polyun_stack_struct::poly_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_polyun_stack_struct, poly_stack) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_polyun_stack_struct::polyun_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_polyun_stack_struct, polyun_stack) - 24usize];
};
pub type fmpz_mod_poly_polyun_stack_t = [fmpz_mod_poly_polyun_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_polyun_mpolyn_stack_struct {
    pub poly_stack: fmpz_mod_poly_stack_t,
    pub polyun_stack: fmpz_mod_polyun_stack_t,
    pub mpolyn_stack: fmpz_mod_mpolyn_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_polyun_mpolyn_stack_struct",
    ][::std::mem::size_of::<fmpz_mod_poly_polyun_mpolyn_stack_struct>() - 80usize];
    [
        "Alignment of fmpz_mod_poly_polyun_mpolyn_stack_struct",
    ][::std::mem::align_of::<fmpz_mod_poly_polyun_mpolyn_stack_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_polyun_mpolyn_stack_struct::poly_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_polyun_mpolyn_stack_struct, poly_stack)
        - 0usize];
    [
        "Offset of field: fmpz_mod_poly_polyun_mpolyn_stack_struct::polyun_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_polyun_mpolyn_stack_struct, polyun_stack)
        - 24usize];
    [
        "Offset of field: fmpz_mod_poly_polyun_mpolyn_stack_struct::mpolyn_stack",
    ][::std::mem::offset_of!(fmpz_mod_poly_polyun_mpolyn_stack_struct, mpolyn_stack)
        - 48usize];
};
pub type fmpz_mod_poly_polyun_mpolyn_stack_t = [fmpz_mod_poly_polyun_mpolyn_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyv_struct {
    pub coeffs: *mut fmpz_mod_mpoly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpolyv_struct",
    ][::std::mem::size_of::<fmpz_mod_mpolyv_struct>() - 24usize];
    [
        "Alignment of fmpz_mod_mpolyv_struct",
    ][::std::mem::align_of::<fmpz_mod_mpolyv_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyv_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpolyv_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mod_mpolyv_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mod_mpolyv_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mod_mpolyv_struct::length",
    ][::std::mem::offset_of!(fmpz_mod_mpolyv_struct, length) - 16usize];
};
pub type fmpz_mod_mpolyv_t = [fmpz_mod_mpolyv_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_pfrac_struct {
    pub bits: flint_bitcnt_t,
    pub w: slong,
    pub r: slong,
    pub inv_prod_dbetas: *mut fmpz_mod_poly_struct,
    pub inv_prod_dbetas_mvar: *mut fmpz_mod_mpoly_struct,
    pub dbetas: *mut fmpz_mod_poly_struct,
    pub dbetas_mvar: *mut fmpz_mod_mpoly_struct,
    pub prod_mbetas: *mut fmpz_mod_mpoly_struct,
    pub prod_mbetas_coeffs: *mut fmpz_mod_mpolyv_struct,
    pub mbetas: *mut fmpz_mod_mpoly_struct,
    pub deltas: *mut fmpz_mod_mpoly_struct,
    pub xalpha: *mut fmpz_mod_mpoly_struct,
    pub q: *mut fmpz_mod_mpoly_struct,
    pub G: *mut fmpz_mod_mpoly_geobucket_struct,
    pub qt: *mut fmpz_mod_mpoly_struct,
    pub newt: *mut fmpz_mod_mpoly_struct,
    pub delta_coeffs: *mut fmpz_mod_mpolyv_struct,
    pub T: fmpz_mod_mpoly_t,
    pub Q: fmpz_mod_mpoly_t,
    pub R: fmpz_mod_mpoly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_mpoly_pfrac_struct",
    ][::std::mem::size_of::<fmpz_mod_mpoly_pfrac_struct>() - 280usize];
    [
        "Alignment of fmpz_mod_mpoly_pfrac_struct",
    ][::std::mem::align_of::<fmpz_mod_mpoly_pfrac_struct>() - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::bits",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, bits) - 0usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::w",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, w) - 8usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::r",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, r) - 16usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::inv_prod_dbetas",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, inv_prod_dbetas) - 24usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::inv_prod_dbetas_mvar",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, inv_prod_dbetas_mvar)
        - 32usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::dbetas",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, dbetas) - 40usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::dbetas_mvar",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, dbetas_mvar) - 48usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::prod_mbetas",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, prod_mbetas) - 56usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::prod_mbetas_coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, prod_mbetas_coeffs) - 64usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::mbetas",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, mbetas) - 72usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::deltas",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, deltas) - 80usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::xalpha",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, xalpha) - 88usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::q",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, q) - 96usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::G",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, G) - 104usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::qt",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, qt) - 112usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::newt",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, newt) - 120usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::delta_coeffs",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, delta_coeffs) - 128usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::T",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, T) - 136usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::Q",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, Q) - 184usize];
    [
        "Offset of field: fmpz_mod_mpoly_pfrac_struct::R",
    ][::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, R) - 232usize];
};
pub type fmpz_mod_mpoly_pfrac_t = [fmpz_mod_mpoly_pfrac_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_interval_poly_arg_t {
    pub baby: *mut fmpz_mod_poly_struct,
    pub res: *mut fmpz_mod_poly_struct,
    pub H: *mut fmpz_mod_poly_struct,
    pub v: *mut fmpz_mod_poly_struct,
    pub vinv: *mut fmpz_mod_poly_struct,
    pub ctx: *const fmpz_mod_ctx_struct,
    pub tmp: *mut fmpz,
    pub m: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mod_poly_interval_poly_arg_t",
    ][::std::mem::size_of::<fmpz_mod_poly_interval_poly_arg_t>() - 64usize];
    [
        "Alignment of fmpz_mod_poly_interval_poly_arg_t",
    ][::std::mem::align_of::<fmpz_mod_poly_interval_poly_arg_t>() - 8usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::baby",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, baby) - 0usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::res",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, res) - 8usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::H",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, H) - 16usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::v",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, v) - 24usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::vinv",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, vinv) - 32usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::ctx",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, ctx) - 40usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::tmp",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, tmp) - 48usize];
    [
        "Offset of field: fmpz_mod_poly_interval_poly_arg_t::m",
    ][::std::mem::offset_of!(fmpz_mod_poly_interval_poly_arg_t, m) - 56usize];
};
#[repr(C)]
pub struct zassenhaus_prune_struct {
    pub deg: slong,
    pub pos_degs: *mut ::std::os::raw::c_uchar,
    pub new_length: slong,
    pub new_total: slong,
    pub new_degs: *mut slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of zassenhaus_prune_struct",
    ][::std::mem::size_of::<zassenhaus_prune_struct>() - 48usize];
    [
        "Alignment of zassenhaus_prune_struct",
    ][::std::mem::align_of::<zassenhaus_prune_struct>() - 8usize];
    [
        "Offset of field: zassenhaus_prune_struct::deg",
    ][::std::mem::offset_of!(zassenhaus_prune_struct, deg) - 0usize];
    [
        "Offset of field: zassenhaus_prune_struct::pos_degs",
    ][::std::mem::offset_of!(zassenhaus_prune_struct, pos_degs) - 8usize];
    [
        "Offset of field: zassenhaus_prune_struct::new_length",
    ][::std::mem::offset_of!(zassenhaus_prune_struct, new_length) - 16usize];
    [
        "Offset of field: zassenhaus_prune_struct::new_total",
    ][::std::mem::offset_of!(zassenhaus_prune_struct, new_total) - 24usize];
    [
        "Offset of field: zassenhaus_prune_struct::new_degs",
    ][::std::mem::offset_of!(zassenhaus_prune_struct, new_degs) - 32usize];
    [
        "Offset of field: zassenhaus_prune_struct::alloc",
    ][::std::mem::offset_of!(zassenhaus_prune_struct, alloc) - 40usize];
};
pub type zassenhaus_prune_t = [zassenhaus_prune_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpolyv_struct {
    pub coeffs: *mut fmpz_mpoly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_mpolyv_struct",
    ][::std::mem::size_of::<fmpz_mpolyv_struct>() - 24usize];
    [
        "Alignment of fmpz_mpolyv_struct",
    ][::std::mem::align_of::<fmpz_mpolyv_struct>() - 8usize];
    [
        "Offset of field: fmpz_mpolyv_struct::coeffs",
    ][::std::mem::offset_of!(fmpz_mpolyv_struct, coeffs) - 0usize];
    [
        "Offset of field: fmpz_mpolyv_struct::alloc",
    ][::std::mem::offset_of!(fmpz_mpolyv_struct, alloc) - 8usize];
    [
        "Offset of field: fmpz_mpolyv_struct::length",
    ][::std::mem::offset_of!(fmpz_mpolyv_struct, length) - 16usize];
};
pub type fmpz_mpolyv_t = [fmpz_mpolyv_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_pfrac_struct {
    pub r: slong,
    pub bits: *mut flint_bitcnt_t,
    pub a: fmpz_poly_t,
    pub newa: fmpz_poly_t,
    pub t: fmpz_poly_t,
    pub b: *mut fmpz_poly_struct,
    pub bprod: *mut fmpz_poly_struct,
    pub old_pk: fmpz_t,
    pub pk: fmpz_t,
    pub p: fmpz_t,
    pub halfpks: *mut fmpz,
    pub ctxp: fmpz_mod_ctx_t,
    pub ctxs: *mut fmpz_mod_ctx_struct,
    pub T: fmpz_mod_poly_t,
    pub R: fmpz_mod_poly_t,
    pub Q: fmpz_mod_poly_t,
    pub B: *mut fmpz_mod_poly_struct,
    pub invBprod: *mut fmpz_mod_poly_struct,
    pub inwBprod: *mut fmpz_mod_poly_struct,
    pub B_inv: *mut fmpz_mod_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of fmpz_poly_pfrac_struct",
    ][::std::mem::size_of::<fmpz_poly_pfrac_struct>() - 360usize];
    [
        "Alignment of fmpz_poly_pfrac_struct",
    ][::std::mem::align_of::<fmpz_poly_pfrac_struct>() - 8usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::r",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, r) - 0usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::bits",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, bits) - 8usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::a",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, a) - 16usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::newa",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, newa) - 40usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::t",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, t) - 64usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::b",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, b) - 88usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::bprod",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, bprod) - 96usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::old_pk",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, old_pk) - 104usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::pk",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, pk) - 112usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::p",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, p) - 120usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::halfpks",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, halfpks) - 128usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::ctxp",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, ctxp) - 136usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::ctxs",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, ctxs) - 248usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::T",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, T) - 256usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::R",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, R) - 280usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::Q",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, Q) - 304usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::B",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, B) - 328usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::invBprod",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, invBprod) - 336usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::inwBprod",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, inwBprod) - 344usize];
    [
        "Offset of field: fmpz_poly_pfrac_struct::B_inv",
    ][::std::mem::offset_of!(fmpz_poly_pfrac_struct, B_inv) - 352usize];
};
pub type fmpz_poly_pfrac_t = [fmpz_poly_pfrac_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_pfrac_struct {
    pub bits: flint_bitcnt_t,
    pub w: slong,
    pub r: slong,
    pub prod_mbetas: *mut fmpz_mpoly_struct,
    pub prod_mbetas_coeffs: *mut fmpz_mpolyv_struct,
    pub mbetas: *mut fmpz_mpoly_struct,
    pub deltas: *mut fmpz_mpoly_struct,
    pub xalpha: *mut fmpz_mpoly_struct,
    pub q: *mut fmpz_mpoly_struct,
    pub U: *mut fmpz_mpoly_univar_struct,
    pub G: *mut fmpz_mpoly_geobucket_struct,
    pub qt: *mut fmpz_mpoly_struct,
